<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima 5.46.0 Manual: Functions and Variables for Sets</title>

<meta name="description" content="Maxima 5.46.0 Manual: Functions and Variables for Sets">
<meta name="keywords" content="Maxima 5.46.0 Manual: Functions and Variables for Sets">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_307.html#Function-and-Variable-Index" rel="index" title="Function and Variable Index">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="maxima_148.html#Sets" rel="up" title="Sets">
<link href="maxima_151.html#Function-Definition" rel="next" title="Function Definition">
<link href="maxima_149.html#Introduction-to-Sets" rel="previous" title="Introduction to Sets">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="ja" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="Functions-and-Variables-for-Sets"></a>
<div class="header">
<p>
Previous: <a href="maxima_149.html#Introduction-to-Sets" accesskey="p" rel="previous">Introduction to Sets</a>, Up: <a href="maxima_148.html#Sets" accesskey="u" rel="up">Sets</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="maxima_307.html#Function-and-Variable-Index" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Functions-and-Variables-for-Sets-1"></a>
<h3 class="section">35.2 Functions and Variables for Sets</h3>

<a name="adjoin"></a><a name="Item_003a-nset_002fdeffn_002fadjoin"></a><dl>
<dt><a name="index-adjoin"></a>関数: <strong>adjoin</strong> <em>(<var>x</var>, <var>a</var>) </em></dt>
<dd>
<p>集合<var>a</var>に要素<code>{<var>x</var>}</code>を加えた集合を返します。
</p>
<p>もし<var>a</var>が集合リテラルでないなら、
<code>adjoin</code>は文句を言います。
</p>
<p><code>adjoin(<var>x</var>, <var>a</var>)</code>と<code>union(set(<var>x</var>), <var>a</var>)</code>は同値です;
しかしながら、<code>adjoin</code>は<code>union</code>より幾分早いかもしれません。
</p>
<p><code>disjoin</code>も参照してください。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) adjoin (c, {a, b});
(%o1)                       {a, b, c}
(%i2) adjoin (a, {a, b});
(%o2)                        {a, b}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="belln"></a><a name="Item_003a-nset_002fdeffn_002fbelln"></a><dl>
<dt><a name="index-belln"></a>関数: <strong>belln</strong> <em>(<var>n</var>)</em></dt>
<dd>
<p><em>n</em>番目のベル数を返します。
<code>belln(n)</code>は<var>n</var>個のメンバーを持つ集合の分割の数です。
</p>
<p>非負整数<var>n</var>に対して、
<code>belln(<var>n</var>)</code>は<em>n</em>番目のベル数に整理されます。
<code>belln</code>は他のいかなる引数に関して整理されません。
</p>
<p><code>belln</code>は等式、リスト、行列、集合上に分配されます。
</p>
<p>例:
</p>
<p>非負整数に適用された<code>belln</code>。
</p>
<div class="example">
<pre class="example">(%i1) makelist (belln (i), i, 0, 6);
(%o1)               [1, 1, 2, 5, 15, 52, 203]
(%i2) is (cardinality (set_partitions ({})) = belln (0));
(%o2)                         true
(%i3) is (cardinality (set_partitions ({1, 2, 3, 4, 5, 6})) =
                       belln (6));
(%o3)                         true
</pre></div>

<p>非負整数でない引数に適用された<code>belln</code>。
</p>
<div class="example">
<pre class="example">(%i1) [belln (x), belln (sqrt(3)), belln (-9)];
(%o1)        [belln(x), belln(sqrt(3)), belln(- 9)]
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="cardinality"></a><a name="Item_003a-nset_002fdeffn_002fcardinality"></a><dl>
<dt><a name="index-cardinality"></a>関数: <strong>cardinality</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p>集合<var>a</var>の異なる要素の数を返します。
</p>
<p>整理がディセーブルされた時でも、
<code>cardinality</code>は冗長な要素を無視します。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) cardinality ({});
(%o1)                           0
(%i2) cardinality ({a, a, b, c});
(%o2)                           3
(%i3) simp : false;
(%o3)                         false
(%i4) cardinality ({a, a, b, c});
(%o4)                           3
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="cartesian_005fproduct"></a><a name="Item_003a-nset_002fdeffn_002fcartesian_005fproduct"></a><dl>
<dt><a name="index-cartesian_005fproduct"></a>関数: <strong>cartesian_product</strong> <em>(<var>b_1</var>, ... , <var>b_n</var>)</em></dt>
<dd><p>Returns a set of lists of the form 
形式<code>[<var>x_1</var>, ..., <var>x_n</var>]</code>のリストの集合を返します。
ここで、<var>x_1</var>, ..., <var>x_n</var>はそれぞれ、
集合<var>b_1</var>, ... , <var>b_n</var>の要素です。
</p>
<p>もし任意の引数が集合リテラルでないなら、
<code>cartesian_product</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) cartesian_product ({0, 1});
(%o1)                      {[0], [1]}
(%i2) cartesian_product ({0, 1}, {0, 1});
(%o2)           {[0, 0], [0, 1], [1, 0], [1, 1]}
(%i3) cartesian_product ({x}, {y}, {z});
(%o3)                      {[x, y, z]}
(%i4) cartesian_product ({x}, {-1, 0, 1});
(%o4)              {[x, - 1], [x, 0], [x, 1]}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>


<a name="disjoin"></a><a name="Item_003a-nset_002fdeffn_002fdisjoin"></a><dl>
<dt><a name="index-disjoin"></a>関数: <strong>disjoin</strong> <em>(<var>x</var>, <var>a</var>)</em></dt>
<dd><p>元<var>x</var>を持たない集合<var>a</var>を返します。
もし<var>x</var>が<var>a</var>のメンバーでないなら、
変更なしに<var>a</var>を返します。
</p>
<p>もし<var>a</var>が集合リテラルでないなら、
<code>disjoin</code>は文句を言います。
</p>
<p><code>disjoin(<var>x</var>, <var>a</var>)</code>, <code>delete(<var>x</var>, <var>a</var>)</code>,
<code>setdifference(<var>a</var>, set(<var>x</var>))</code>はすべて同値です。
これらの中で、
<code>disjoin</code>は一般的に他より速いです。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) disjoin (a, {a, b, c, d});
(%o1)                       {b, c, d}
(%i2) disjoin (a + b, {5, z, a + b, %pi});
(%o2)                      {5, %pi, z}
(%i3) disjoin (a - b, {5, z, a + b, %pi});
(%o3)                  {5, %pi, b + a, z}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="disjointp"></a><a name="Item_003a-nset_002fdeffn_002fdisjointp"></a><dl>
<dt><a name="index-disjointp"></a>関数: <strong>disjointp</strong> <em>(<var>a</var>, <var>b</var>) </em></dt>
<dd>
<p>集合<var>a</var>と<var>b</var>がばらばらなら、
<code>true</code>を返します。
</p>
<p>もし<var>a</var>か<var>b</var>が集合リテラルでないなら、
<code>disjointp</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) disjointp ({a, b, c}, {1, 2, 3});
(%o1)                         true
(%i2) disjointp ({a, b, 3}, {1, 2, 3});
(%o2)                         false
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>

<a name="divisors"></a><a name="Item_003a-nset_002fdeffn_002fdivisors"></a><dl>
<dt><a name="index-divisors"></a>関数: <strong>divisors</strong> <em>(<var>n</var>)</em></dt>
<dd>
<p><var>n</var>の約数の集合を表します。
</p>
<p><var>n</var>がゼロでない整数の時、
<code>divisors(<var>n</var>)</code>は整数の集合に整理されます。
約数の集合は元1と<var>n</var>を含みます。
負の整数の約数は、その絶対値の約数です。
</p>
<p><code>divisors</code>は、等式、リスト、行列、集合上に分配されます。
</p>
<p>例:
</p>
<p>28は完全数であることを検証できます:
(自身を除いた)約数が28です。
</p>
<div class="example">
<pre class="example">(%i1) s: divisors(28);
(%o1)                 {1, 2, 4, 7, 14, 28}
(%i2) lreduce (&quot;+&quot;, args(s)) - 28;
(%o2)                          28
</pre></div>

<p><code>divisors</code>は整理関数です。
<code>divisors(a)</code>の中で<code>a</code>に8を代入することは、
<code>divisors(8)</code>を再評価せずに約数をもたらします。
</p>
<div class="example">
<pre class="example">(%i1) divisors (a);
(%o1)                      divisors(a)
(%i2) subst (8, a, %);
(%o2)                     {1, 2, 4, 8}
</pre></div>

<p><code>divisors</code>は、等式、リスト、行列、集合上に分配されます。
</p>
<div class="example">
<pre class="example">(%i1) divisors (a = b);
(%o1)               divisors(a) = divisors(b)
(%i2) divisors ([a, b, c]);
(%o2)        [divisors(a), divisors(b), divisors(c)]
(%i3) divisors (matrix ([a, b], [c, d]));
                  [ divisors(a)  divisors(b) ]
(%o3)             [                          ]
                  [ divisors(c)  divisors(d) ]
(%i4) divisors ({a, b, c});
(%o4)        {divisors(a), divisors(b), divisors(c)}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="elementp"></a><a name="Item_003a-nset_002fdeffn_002felementp"></a><dl>
<dt><a name="index-elementp"></a>関数: <strong>elementp</strong> <em>(<var>x</var>, <var>a</var>)</em></dt>
<dd><p><var>x</var>が集合<var>a</var>の元の時だけ<code>true</code>を返します。
</p>
<p>もし<var>a</var>が集合リテラルでないなら、
<code>elementp</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) elementp (sin(1), {sin(1), sin(2), sin(3)});
(%o1)                         true
(%i2) elementp (sin(1), {cos(1), cos(2), cos(3)});
(%o2)                         false
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>

<a name="emptyp"></a><a name="Item_003a-nset_002fdeffn_002femptyp"></a><dl>
<dt><a name="index-emptyp"></a>関数: <strong>emptyp</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p><var>a</var>が空の集合か空のリストの時だけ、<code>true</code>を返します。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) map (emptyp, [{}, []]);
(%o1)                     [true, true]
(%i2) map (emptyp, [a + b, {{}}, %pi]);
(%o2)                 [false, false, false]
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>
       
<a name="equiv_005fclasses"></a><a name="Item_003a-nset_002fdeffn_002fequiv_005fclasses"></a><dl>
<dt><a name="index-equiv_005fclasses"></a>関数: <strong>equiv_classes</strong> <em>(<var>s</var>, <var>F</var>)</em></dt>
<dd><p>集合<var>s</var>の
同値関係<var>F</var>に関する
同値クラスの集合を返します。
</p>
<p><var>F</var>は<var>s</var>の<var>s</var>との直積集合上の２変数関数です。
The return value of 
<var>F</var>の戻り値は、<code>true</code>か<code>false</code>、もしくは、
<code>is(<var>expr</var>)</code>が<code>true</code>か<code>false</code>のような
式<var>expr</var>です。
</p>
<p><var>F</var>が同値関数でない時、
<code>equiv_classes</code>は不平なくそれを受け入れますが、
その場合、結果は、一般に正しくありません。
</p>

<p>例:
</p>
<p>同値関係が
<code>true</code>か<code>false</code>を返すラムダ式です。
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 1.0, 2, 2.0, 3, 3.0},
                        lambda ([x, y], is (equal (x, y))));
(%o1)            {{1, 1.0}, {2, 2.0}, {3, 3.0}}
</pre></div>

<p>同値関係が、<code>is</code>が<code>true</code>か<code>false</code>に評価される
関係関数の名前です。
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 1.0, 2, 2.0, 3, 3.0}, equal);
(%o1)            {{1, 1.0}, {2, 2.0}, {3, 3.0}}
</pre></div>

<p>同値クラスが3の倍数だけ違う数です。
</p>
<div class="example">
<pre class="example">(%i1) equiv_classes ({1, 2, 3, 4, 5, 6, 7},
                     lambda ([x, y], remainder (x - y, 3) = 0));
(%o1)              {{1, 4, 7}, {2, 5}, {3, 6}}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="every"></a><a name="Item_003a-nset_002fdeffn_002fevery"></a><dl>
<dt><a name="index-every"></a>関数: <strong>every</strong> <em>(<var>f</var>, <var>s</var>)</em></dt>
<dt><a name="index-every-1"></a>関数: <strong>every</strong> <em>(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</em></dt>
<dd>
<p>もし述語論理<var>f</var>が与えられた引数すべてで<code>true</code>なら、
<code>true</code>を返します。
</p>
<p>ある集合が二番目の引数として与えられたとして、
もし<code>is(<var>f</var>(<var>a_i</var>))</code>が
<var>s</var>の中の<var>a_i</var>すべてに関して
<code>true</code>を返すなら
<code>every(<var>f</var>, <var>s</var>)</code>は<code>true</code>です。
<code>every</code>は、
<var>s</var>の中の<var>a_i</var>すべてに関して<var>f</var>を評価するかもしれないししないかもしれません。
集合は順序付けされていないので、
<code>every</code>は任意の順序で<code><var>f</var>(<var>a_i</var>)</code>を評価します。
</p>
<p>非キスとして１つか複数のリストが与えられたとして、
もし<code>is(<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>))</code>が
<var>L_1</var>, ..., <var>L_n</var>それぞれの中の<var>x_1</var>, ..., <var>x_n</var>すべてに対して
<code>true</code>を返すなら、
<code>every(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</code>は<code>true</code>を返します。
<code>every</code>は、
<var>x_1</var>, ..., <var>x_n</var>のすべての組み合わせに対して<var>f</var>を評価するかもしれないししないかもしれません。
<code>every</code>はインデックスを増やす順序でリストを評価します。
</p>
<p>空の集合<code>{}</code>または空のリスト<code>[]</code>が引数として与えられたとして、
<code>every</code>は<code>false</code>を返します。
</p>
<p>グローバルフラグ<code>maperror</code>が<code>true</code>の時、
リスト<var>L_1</var>, ..., <var>L_n</var>すべては等しい長さを持たなければいけません。
<code>maperror</code>が<code>false</code>の時、
リスト引数は、最短のリストの長さに効果的に切り詰められます。
</p>
<p>(<code>is</code>を介して)
<code>true</code>か<code>false</code>以外の何かに評価される述語論理<var>f</var>の戻り値は、
<code>prederror</code>によって決定されます。
<code>prederror</code>が<code>true</code>の時、
そんな値は<code>false</code>として扱われ、
<code>every</code>の戻り値は<code>false</code>です。
<code>prederror</code>が<code>false</code>の時、
そんな値は<code>unknown</code>として扱われ、
<code>every</code>の戻り値は<code>unknown</code>です。
</p>
<p>例:
</p>
<p>１つの集合に適用された<code>every</code>。
述語論理は１引数関数です。
</p>
<div class="example">
<pre class="example">(%i1) every (integerp, {1, 2, 3, 4, 5, 6});
(%o1)                         true
(%i2) every (atom, {1, 2, sin(3), 4, 5 + y, 6});
(%o2)                         false
</pre></div>

<p>２つのリストに適用された<code>every</code>。
述語論理は２引数関数です。
</p>
<div class="example">
<pre class="example">(%i1) every (&quot;=&quot;, [a, b, c], [a, b, c]);
(%o1)                         true
(%i2) every (&quot;#&quot;, [a, b, c], [a, b, c]);
(%o2)                         false
</pre></div>

<p><code>true</code>か<code>false</code>以外の何かに評価される
述語論理<var>f</var>の戻り値は、
グローバルフラグ<code>prederror</code>によって決定されます。
</p>
<div class="example">
<pre class="example">(%i1) prederror : false;
(%o1)                         false
(%i2) map (lambda ([a, b], is (a &lt; b)), [x, y, z],
                   [x^2, y^2, z^2]);
(%o2)              [unknown, unknown, unknown]
(%i3) every (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o3)                        unknown
(%i4) prederror : true;
(%o4)                         true
(%i5) every (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o5)                         false
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>
 
<a name="extremal_005fsubset"></a><a name="Item_003a-nset_002fdeffn_002fextremal_005fsubset"></a><dl>
<dt><a name="index-extremal_005fsubset"></a>関数: <strong>extremal_subset</strong> <em>(<var>s</var>, <var>f</var>, max)</em></dt>
<dt><a name="index-extremal_005fsubset-1"></a>関数: <strong>extremal_subset</strong> <em>(<var>s</var>, <var>f</var>, min)</em></dt>
<dd>
<p>関数<var>f</var>が最大または最小値を取る、
<var>s</var>の部分集合を返します。
</p>
<p><code>extremal_subset(<var>s</var>, <var>f</var>, max)</code>は、
実数値関数<var>f</var>が最大値を取る、
集合またはリスト<var>s</var>の部分集合を返します。
</p>
<p><code>extremal_subset(<var>s</var>, <var>f</var>, min)</code>は、
実数値関数<var>f</var>が最小値を取る、
集合またはリスト<var>s</var>の部分集合を返します。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) extremal_subset ({-2, -1, 0, 1, 2}, abs, max);
(%o1)                       {- 2, 2}
(%i2) extremal_subset ({sqrt(2), 1.57, %pi/2}, sin, min);
(%o2)                       {sqrt(2)}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="flatten"></a><a name="Item_003a-nset_002fdeffn_002fflatten"></a><dl>
<dt><a name="index-flatten"></a>関数: <strong>flatten</strong> <em>(<var>expr</var>)</em></dt>
<dd>
<p><var>expr</var>と同じ演算子を持つ部分式の引数を集め、
これらの集めた引数から式を構成します。
</p>
<p><code>expr</code>の主演算子と違った演算子の部分式は、
たとえそれらが、逆に<code>expr</code>に関するものと同じ演算子の部分式を含んだとしても、
変更なしにコピーされます。
</p>
<p>引数の数が演算子に関して宣言された引数と違う
式を<code>flatten</code>が構成する可能性があるかもしれません;
これは、整理器や評価器からのエラーメッセージを起こさせるかもしれません。
<code>flatten</code>はそんな状況を検出しようとしません。
</p>
<p>特別な表現の式、例えば、標準有理式(CRE)、はflattenできません;
そんな場合、<code>flatten</code>は引数を変更なしに返します。
</p>
<p>例:
</p>
<p>リストに適用すると、<code>flatten</code>はリストの要素すべてを集めます。
</p>
<div class="example">
<pre class="example">(%i1) flatten ([a, b, [c, [d, e], f], [[g, h]], i, j]);
(%o1)            [a, b, c, d, e, f, g, h, i, j]
</pre></div>

<p>集合に適用すると、<code>flatten</code>は集合の元すべてを集めます。
</p>
<div class="example">
<pre class="example">(%i1) flatten ({a, {b}, {{c}}});
(%o1)                       {a, b, c}
(%i2) flatten ({a, {[a], {a}}});
(%o2)                       {a, [a]}
</pre></div>

<p><code>flatten</code>は、主演算子をn項に宣言する効果に似ています。
しかしながら、<code>flatten</code>は、
主演算子と違う演算子を持つ部分式上に影響を持ちません。
一方、n項宣言はそれらに影響します。
</p>
<div class="example">
<pre class="example">(%i1) expr: flatten (f (g (f (f (x)))));
(%o1)                     f(g(f(f(x))))
(%i2) declare (f, nary);
(%o2)                         done
(%i3) ev (expr);
(%o3)                      f(g(f(x)))
</pre></div>

<p><code>flatten</code>は、他の任意の演算子と同じように添字付き関数を扱います。
</p>
<div class="example">
<pre class="example">(%i1) flatten (f[5] (f[5] (x, y), z));
(%o1)                      f (x, y, z)
                            5
</pre></div>

<p>引数の数が演算子に関して宣言された引数と違う
式を<code>flatten</code>が構成する可能性があるかもしれません;
</p>
<div class="example">
<pre class="example">(%i1) 'mod (5, 'mod (7, 4));
(%o1)                   mod(5, mod(7, 4))
(%i2) flatten (%);
(%o2)                     mod(5, 7, 4)
(%i3) ''%, nouns;
Wrong number of arguments to mod
 -- an error.  Quitting.  To debug this try debugmode(true);
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="full_005flistify"></a><a name="Item_003a-nset_002fdeffn_002ffull_005flistify"></a><dl>
<dt><a name="index-full_005flistify"></a>関数: <strong>full_listify</strong> <em>(<var>a</var>)</em></dt>
<dd><p><var>a</var>の中のすべての集合演算子をリスト演算子で置き換え、
結果を返します。
<code>full_listify</code>は、
たとえ主演算子が<code>set</code>でなくても
入れ子の部分式の中の集合演算子を置き換えます。
</p>
<p><code>listify</code>は主演算子だけを置き換えます。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) full_listify ({a, b, {c, {d, e, f}, g}});
(%o1)               [a, b, [c, [d, e, f], g]]
(%i2) full_listify (F (G ({a, b, H({c, d, e})})));
(%o2)              F(G([a, b, H([c, d, e])]))
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="fullsetify"></a><a name="Item_003a-nset_002fdeffn_002ffullsetify"></a><dl>
<dt><a name="index-fullsetify"></a>関数: <strong>fullsetify</strong> <em>(<var>a</var>)</em></dt>
<dd><p><var>a</var>がリストの時、
リスト演算子を集合演算子で置き換え、
<code>fullsetify</code>を集合であるメンバーそれぞれに適用します。
<var>a</var>がリストでない時、変更なしで返します。
</p>
<p><code>setify</code>は主演算子だけを置き換えます。
</p>
<p>例:
</p>

<p><code>f([b])</code>の主演算子はリストでないので、
行<code>(%o2)</code>で、
<code>f</code>の引数は集合に変換されません。
</p>
<div class="example">
<pre class="example">(%i1) fullsetify ([a, [a]]);
(%o1)                       {a, {a}}
(%i2) fullsetify ([a, f([b])]);
(%o2)                      {a, f([b])}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="identity"></a><a name="Item_003a-nset_002fdeffn_002fidentity"></a><dl>
<dt><a name="index-identity"></a>関数: <strong>identity</strong> <em>(<var>x</var>)</em></dt>
<dd>
<p>任意の引数<var>x</var>に対して<var>x</var>を返します。
</p>
<p>例:
</p>
<p><code>identity</code>は、
引数が既にブーリアン値の時、
述語論理として使うことができます。
</p>
<div class="example">
<pre class="example">(%i1) every (identity, [true, true]);
(%o1)                         true
</pre></div>
</dd></dl>

<a name="integer_005fpartitions"></a><a name="Item_003a-nset_002fdeffn_002finteger_005fpartitions"></a><dl>
<dt><a name="index-integer_005fpartitions"></a>関数: <strong>integer_partitions</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-integer_005fpartitions-1"></a>関数: <strong>integer_partitions</strong> <em>(<var>n</var>, <var>len</var>)</em></dt>
<dd>
<p><var>n</var>の整数分割を返します。
すなわち、和が<var>n</var>になる整数のリストです。
</p>
<p><code>integer_partitions(<var>n</var>)</code>は、
整数<var>n</var>の分割すべての集合を返します。
分割それぞれは、大きい順に並べられたリストです。
</p>
<p><code>integer_partitions(<var>n</var>, <var>len</var>)</code>は、
長さ<var>len</var>以下の分割すべてを返します;
この場合、
<var>len</var>より少ない項を持つ分割それぞれには、
厳密に<var>len</var>項持つ分割にするように、ゼロが足されます。
分割それぞれは、大きい順に並べられたリストです。
</p>
<p>リスト<em>[a_1, ..., a_m]</em>は、
(1) <em>a_i</em>それぞれが非ゼロ整数、かつ、
(2) <em>a_1 + ... + a_m = n.</em>
の時、非負整数<em>n</em>の分割です。
従って0は分割を持ちません。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) integer_partitions (3);
(%o1)               {[1, 1, 1], [2, 1], [3]}
(%i2) s: integer_partitions (25)$
(%i3) cardinality (s);
(%o3)                         1958
(%i4) map (lambda ([x], apply (&quot;+&quot;, x)), s);
(%o4)                         {25}
(%i5) integer_partitions (5, 3);
(%o5) {[2, 2, 1], [3, 1, 1], [3, 2, 0], [4, 1, 0], [5, 0, 0]}
(%i6) integer_partitions (5, 2);
(%o6)               {[3, 2], [4, 1], [5, 0]}
</pre></div>

<p>条件を満たす分割すべてを見つけるには、
関数<code>subset</code>を使ってください;
以下は素数から成る10の分割すべてを見つける例です。
</p>
<div class="example">
<pre class="example">(%i1) s: integer_partitions (10)$
(%i2) cardinality (s);
(%o2)                          42
(%i3) xprimep(x) := integerp(x) and (x &gt; 1) and primep(x)$
(%i4) subset (s, lambda ([x], every (xprimep, x)));
(%o4) {[2, 2, 2, 2, 2], [3, 3, 2, 2], [5, 3, 2], [5, 5], [7, 3]}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="intersect"></a><a name="Item_003a-nset_002fdeffn_002fintersect"></a><dl>
<dt><a name="index-intersect"></a>関数: <strong>intersect</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em></dt>
<dd>
<p><code>intersect</code>は、以下に見る<code>intersection</code>と同じです。
</p>
<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="intersection"></a><a name="Item_003a-nset_002fdeffn_002fintersection"></a><dl>
<dt><a name="index-intersection"></a>関数: <strong>intersection</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em></dt>
<dd><p>集合<var>a_1</var>から<var>a_n</var>までに共通な
要素を含む
集合を返します。
</p>
<p>もし引数のいずれかが集合リテラルでないなら、
<code>intersection</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c, d};
(%o1)                     {a, b, c, d}
(%i2) S_2 : {d, e, f, g};
(%o2)                     {d, e, f, g}
(%i3) S_3 : {c, d, e, f};
(%o3)                     {c, d, e, f}
(%i4) S_4 : {u, v, w};
(%o4)                       {u, v, w}
(%i5) intersection (S_1, S_2);
(%o5)                          {d}
(%i6) intersection (S_2, S_3);
(%o6)                       {d, e, f}
(%i7) intersection (S_1, S_2, S_3);
(%o7)                          {d}
(%i8) intersection (S_1, S_2, S_3, S_4);
(%o8)                          {}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="Item_003a-nset_002fdeffn_002fkron_005fdelta"></a><dl>
<dt><a name="index-kron_005fdelta"></a>関数: <strong>kron_delta</strong> <em>(<var>x</var>, <var>y</var>, &hellip;, <var>xp</var>)</em></dt>
<dd>
<p>クロネッカーのデルタ関数を表します。
</p>
<p><code>kron_delta</code>は、
<var>xi</var>と<var>yj</var>が引数のすべての対で等しい時
1に整理され、
<var>xi</var>と<var>yj</var>が引数のある対で等しくない時
0に整理されます。
等号は<code>is(equal(xi,j))</code>を使って決定され、
不等号は<code>is(notsqual(xi,xj))</code>を使って決定されます。
厳密に1つの引数に対して、<code>kron_delta</code>はエラーをシグナルします。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) kron_delta(a,a);
(%o1)                                  1
(%i2) kron_delta(a,b,a,b);
(%o2)                          kron_delta(a, b)
(%i3) kron_delta(a,a,b,a+1);
(%o3)                                  0
(%i4) assume(equal(x,y));
(%o4)                            [equal(x, y)]
(%i5) kron_delta(x,y);
(%o5)                                  1
</pre></div>


</dd></dl>

<a name="listify"></a><a name="Item_003a-nset_002fdeffn_002flistify"></a><dl>
<dt><a name="index-listify"></a>関数: <strong>listify</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p><var>a</var>が集合の時、
<var>a</var>の元を含む
リストを返します。
そうでなければ、<code>listify</code>は<var>a</var>を返します。
</p>
<p><code>full_listify</code>は
<var>a</var>の中の集合演算子をリスト演算子に置き換えます。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) listify ({a, b, c, d});
(%o1)                     [a, b, c, d]
(%i2) listify (F ({a, b, c, d}));
(%o2)                    F({a, b, c, d})
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="lreduce"></a><a name="Item_003a-nset_002fdeffn_002flreduce"></a><dl>
<dt><a name="index-lreduce"></a>関数: <strong>lreduce</strong> <em>(<var>F</var>, <var>s</var>)</em></dt>
<dt><a name="index-lreduce-1"></a>関数: <strong>lreduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_0</var>)</em></dt>
<dd>
<p>二項関数<var>F</var>を合成によってn項関数に拡張します。
ここで<var>s</var>はリストです。
</p>
<p><code>lreduce(<var>F</var>, <var>s</var>)</code>は<code>F(... F(F(s_1, s_2), s_3), ... s_n)</code>を返します。
</p>
<p>オプション引数<var>s_0</var>が存在する時、
結果は<code>lreduce(<var>F</var>, cons(<var>s_0</var>, <var>s</var>))</code>と同値です。
</p>
<p>関数<var>F</var>は、最初の<i>leftmost</i>の元に適用されます。
だから、&quot;lreduce&quot;と名付けられています。
</p>
<p><code>rreduce</code>, <code>xreduce</code>, <code>tree_reduce</code>も参照してください。
</p>
<p>例:
</p>
<p>オプション引数なしの<code>lreduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) lreduce (f, [1, 2, 3]);
(%o1)                     f(f(1, 2), 3)
(%i2) lreduce (f, [1, 2, 3, 4]);
(%o2)                  f(f(f(1, 2), 3), 4)
</pre></div>

<p>オプション引数ありの<code>lreduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) lreduce (f, [1, 2, 3], 4);
(%o1)                  f(f(f(4, 1), 2), 3)
</pre></div>

<p>組み込み二項演算子に適用された<code>lreduce</code>。
<code>/</code>は割り算演算子。
</p>
<div class="example">
<pre class="example">(%i1) lreduce (&quot;^&quot;, args ({a, b, c, d}));
                               b c d
(%o1)                       ((a ) )
(%i2) lreduce (&quot;/&quot;, args ({a, b, c, d}));
                                a
(%o2)                         -----
                              b c d
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="makeset"></a><a name="Item_003a-nset_002fdeffn_002fmakeset"></a><dl>
<dt><a name="index-makeset"></a>関数: <strong>makeset</strong> <em>(<var>expr</var>, <var>x</var>, <var>s</var>)</em></dt>
<dd>
<p>式<var>expr</var>から生成された元を持つ集合を返します。
ここで、<var>x</var>は<var>expr</var>の中の変数のリストであり、
<var>s</var>はリストの集合かリストです。
集合の元それぞれを生成するために、
<var>expr</var>は、
<var>s</var>の元に並列にバインドされた変数<var>x</var>で評価されます。
</p>
<p><var>s</var>の元それぞれは
<var>x</var>と同じ長さを持たなければいけません。
変数<var>x</var>のリストは、添字の付かないシンボルのリストでなければいけません。
たとえシンボルが１つしかない場合でも、<var>x</var>は１要素のリストでなければいけなく、
<var>s</var>の元それぞれは１要素のリストでなければいけません。
</p>

<p><code>makelist</code>も参照してください。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) makeset (i/j, [i, j], [[1, a], [2, b], [3, c], [4, d]]);
                           1  2  3  4
(%o1)                     {-, -, -, -}
                           a  b  c  d
(%i2) S : {x, y, z}$
(%i3) S3 : cartesian_product (S, S, S);
(%o3) {[x, x, x], [x, x, y], [x, x, z], [x, y, x], [x, y, y], 
[x, y, z], [x, z, x], [x, z, y], [x, z, z], [y, x, x], 
[y, x, y], [y, x, z], [y, y, x], [y, y, y], [y, y, z], 
[y, z, x], [y, z, y], [y, z, z], [z, x, x], [z, x, y], 
[z, x, z], [z, y, x], [z, y, y], [z, y, z], [z, z, x], 
[z, z, y], [z, z, z]}
(%i4) makeset (i + j + k, [i, j, k], S3);
(%o4) {3 x, 3 y, y + 2 x, 2 y + x, 3 z, z + 2 x, z + y + x, 
                                       z + 2 y, 2 z + x, 2 z + y}
(%i5) makeset (sin(x), [x], {[1], [2], [3]});
(%o5)               {sin(1), sin(2), sin(3)}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="moebius"></a><a name="Item_003a-nset_002fdeffn_002fmoebius"></a><dl>
<dt><a name="index-moebius"></a>関数: <strong>moebius</strong> <em>(<var>n</var>)</em></dt>
<dd>
<p>メビウス関数を表します。
</p>
<p><var>n</var>が<em>k</em>個の異なる素数の積の時、
<code>moebius(<var>n</var>)</code>は<em>(-1)^k</em>に整理されます;
<em><var>n</var> = 1</em>の時、1に整理されます;
他の正の数すべてに対して、0に整理されます。
</p>
<p><code>moebius</code>は等式、リスト、行列、集合上に分配されます。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) moebius (1);
(%o1)                           1
(%i2) moebius (2 * 3 * 5);
(%o2)                          - 1
(%i3) moebius (11 * 17 * 29 * 31);
(%o3)                           1
(%i4) moebius (2^32);
(%o4)                           0
(%i5) moebius (n);
(%o5)                      moebius(n)
(%i6) moebius (n = 12);
(%o6)                    moebius(n) = 0
(%i7) moebius ([11, 11 * 13, 11 * 13 * 15]);
(%o7)                      [- 1, 1, 1]
(%i8) moebius (matrix ([11, 12], [13, 14]));
                           [ - 1  0 ]
(%o8)                      [        ]
                           [ - 1  1 ]
(%i9) moebius ({21, 22, 23, 24});
(%o9)                      {- 1, 0, 1}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>
 
<a name="multinomial_005fcoeff"></a><a name="Item_003a-nset_002fdeffn_002fmultinomial_005fcoeff"></a><dl>
<dt><a name="index-multinomial_005fcoeff"></a>関数: <strong>multinomial_coeff</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em></dt>
<dt><a name="index-multinomial_005fcoeff-1"></a>関数: <strong>multinomial_coeff</strong> <em>()</em></dt>
<dd>
<p>多項係数を返します。
</p>
<p><var>a_k</var>それぞれが非負の整数の時、
多項係数は、
<code><var>a_1</var> + ... + <var>a_n</var></code>個の別々のオブジェクトを
<em>k</em>番目の枠の中に<var>a_k</var>の要素を持つ<em>n</em>個の枠に置く方法の数を与えます。
</p>
<p>一般に、<code>multinomial_coeff (<var>a_1</var>, ..., <var>a_n</var>)</code>は
<code>(<var>a_1</var> + ... + <var>a_n</var>)!/(<var>a_1</var>! ... <var>a_n</var>!)</code>と同値です。
</p>
<p><code>multinomial_coeff()</code> (引数なし)は1に評価されます。
</p>
<p><code>minfactorial</code>は<code>multinomial_coeff</code>が返す値を整理することができます。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) multinomial_coeff (1, 2, x);
                            (x + 3)!
(%o1)                       --------
                              2 x!
(%i2) minfactorial (%);
                     (x + 1) (x + 2) (x + 3)
(%o2)                -----------------------
                                2
(%i3) multinomial_coeff (-6, 2);
                             (- 4)!
(%o3)                       --------
                            2 (- 6)!
(%i4) minfactorial (%);
(%o4)                          10
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="num_005fdistinct_005fpartitions"></a><a name="Item_003a-nset_002fdeffn_002fnum_005fdistinct_005fpartitions"></a><dl>
<dt><a name="index-num_005fdistinct_005fpartitions"></a>関数: <strong>num_distinct_partitions</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-num_005fdistinct_005fpartitions-1"></a>関数: <strong>num_distinct_partitions</strong> <em>(<var>n</var>, list)</em></dt>
<dd>
<p><var>n</var>が非負の整数の時、
<var>n</var>の異なる整数分割の数を返します。
そうでなければ、<code>num_distinct_partitions</code>は名詞形を返します。
</p>
<p><code>num_distinct_partitions(<var>n</var>, list)</code>は、
1, 2, 3, ..., <var>n</var>の異なる分割の数のリストを返します。
</p>
<p><var>n</var>の異なる分割は、
<em><var>n</var> = k_1 + ... + k_m</em>となるような
異なる正の整数<em>k_1</em>, ..., <em>k_m</em>のリストです。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) num_distinct_partitions (12);
(%o1)                          15
(%i2) num_distinct_partitions (12, list);
(%o2)      [1, 1, 1, 2, 2, 3, 4, 5, 6, 8, 10, 12, 15]
(%i3) num_distinct_partitions (n);
(%o3)              num_distinct_partitions(n)
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="num_005fpartitions"></a><a name="Item_003a-nset_002fdeffn_002fnum_005fpartitions"></a><dl>
<dt><a name="index-num_005fpartitions"></a>関数: <strong>num_partitions</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-num_005fpartitions-1"></a>関数: <strong>num_partitions</strong> <em>(<var>n</var>, list)</em></dt>
<dd>
<p><var>n</var>が非負の整数の時、
<var>n</var>の整数分割の数を返します。
そうでなければ、<code>num_partitions</code>は名詞式を返します。
</p>
<p><code>num_partitions(<var>n</var>, list)</code>は、
1, 2, 3, ..., <var>n</var>の整数分割の数のリストを返します。
</p>
<p>非負の整数<var>n</var>に対して、
<code>num_partitions(<var>n</var>)</code>は
<code>cardinality(integer_partitions(<var>n</var>))</code>と等しいです;
しかしながら、<code>num_partitions</code>は、
分割の集合を実際には構成しないので、はるかに速いです。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) num_partitions (5) = cardinality (integer_partitions (5));
(%o1)                         7 = 7
(%i2) num_partitions (8, list);
(%o2)            [1, 1, 2, 3, 5, 7, 11, 15, 22]
(%i3) num_partitions (n);
(%o3)                   num_partitions(n)
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>



<a name="partition_005fset"></a><a name="Item_003a-nset_002fdeffn_002fpartition_005fset"></a><dl>
<dt><a name="index-partition_005fset"></a>関数: <strong>partition_set</strong> <em>(<var>a</var>, <var>f</var>)</em></dt>
<dd>
<p>集合<var>a</var>を述語論理<var>f</var>に従って分割します。
</p>
<p><code>partition_set</code>は２つの集合のリストを返します。
最初の集合は
<var>f</var>が<code>false</code>に評価される
<var>a</var>の要素から成り、
二番目は<var>a</var>の他の要素すべてから成ります。
<code>partition_set</code>は
<code>is</code>を<var>f</var>の戻り値に適用しません。
</p>
<p>もし<var>a</var>が集合リテラルなら
<code>partition_set</code>は文句を言います。
</p>
<p><code>subset</code>も参照してください。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) partition_set ({2, 7, 1, 8, 2, 8}, evenp);
(%o1)                   [{1, 7}, {2, 8}]
(%i2) partition_set ({x, rat(y), rat(y) + z, 1},
                     lambda ([x], ratp(x)));
(%o2)/R/              [{1, x}, {y, y + z}]
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="permutations"></a><a name="Item_003a-nset_002fdeffn_002fpermutations"></a><dl>
<dt><a name="index-permutations"></a>関数: <strong>permutations</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p>リストまたは集合<var>a</var>の元の異なる順列すべての集合を返します。
順列それぞれは、集合でなくリストです。
</p>
<p><var>a</var>がリストの時、
<var>a</var>の重複した元が順列の中に含まれます。
</p>
<p>もし<var>a</var>がリストリテラルや集合リテラルでないなら、
<code>permutations</code>は文句を言います。
</p>
<p><code>random_permutation</code>も参照してください。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) permutations ([a, a]);
(%o1)                       {[a, a]}
(%i2) permutations ([a, a, b]);
(%o2)           {[a, a, b], [a, b, a], [b, a, a]}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="powerset"></a><a name="Item_003a-nset_002fdeffn_002fpowerset"></a><dl>
<dt><a name="index-powerset"></a>関数: <strong>powerset</strong> <em>(<var>a</var>)</em></dt>
<dt><a name="index-powerset-1"></a>関数: <strong>powerset</strong> <em>(<var>a</var>, <var>n</var>)</em></dt>
<dd>
<p><var>a</var>の部分集合すべての集合、または、その集合の部分集合を返します。
</p>
<p><code>powerset(<var>a</var>)</code>は
集合<var>a</var>の部分集合すべての集合を返します。
<code>powerset(<var>a</var>)</code>は<code>2^cardinality(<var>a</var>)</code>個の元を持ちます。
</p>
<p><code>powerset(<var>a</var>, <var>n</var>)</code>は、
濃度<var>n</var>を持つ<var>a</var>の部分集合すべての集合を返します。
</p>
<p>もし<var>a</var>が集合リテラルでないか、
<var>n</var>が非負の整数でないなら、
<code>powerset</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) powerset ({a, b, c});
(%o1) {{}, {a}, {a, b}, {a, b, c}, {a, c}, {b}, {b, c}, {c}}
(%i2) powerset ({w, x, y, z}, 4);
(%o2)                    {{w, x, y, z}}
(%i3) powerset ({w, x, y, z}, 3);
(%o3)     {{w, x, y}, {w, x, z}, {w, y, z}, {x, y, z}}
(%i4) powerset ({w, x, y, z}, 2);
(%o4)   {{w, x}, {w, y}, {w, z}, {x, y}, {x, z}, {y, z}}
(%i5) powerset ({w, x, y, z}, 1);
(%o5)                 {{w}, {x}, {y}, {z}}
(%i6) powerset ({w, x, y, z}, 0);
(%o6)                         {{}}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="Item_003a-nset_002fdeffn_002frandom_005fpermutation"></a><dl>
<dt><a name="index-random_005fpermutation"></a>関数: <strong>random_permutation</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p>クヌースのシャッフルアルゴリズムで構成されるような、
集合またはリスト<var>a</var>のランダムな順列を返します。
</p>
<p>戻り値は、たとえ要素すべてが偶然同じでも
引数とは別の新しいリストです。
しかしながら、引数の要素はコピーされません。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) random_permutation ([a, b, c, 1, 2, 3]);
(%o1)                  [c, 1, 2, 3, a, b]
(%i2) random_permutation ([a, b, c, 1, 2, 3]);
(%o2)                  [b, 3, 1, c, a, 2]
(%i3) random_permutation ({x + 1, y + 2, z + 3});
(%o3)                 [y + 2, z + 3, x + 1]
(%i4) random_permutation ({x + 1, y + 2, z + 3});
(%o4)                 [x + 1, y + 2, z + 3]
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="rreduce"></a><a name="Item_003a-nset_002fdeffn_002frreduce"></a><dl>
<dt><a name="index-rreduce"></a>関数: <strong>rreduce</strong> <em>(<var>F</var>, <var>s</var>)</em></dt>
<dt><a name="index-rreduce-1"></a>関数: <strong>rreduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_{n + 1}</var>)</em></dt>
<dd>
<p>合成によって二項関数<var>F</var>をn項関数に拡張します。
ここで、<var>s</var>はリストです。
</p>
<p><code>rreduce(<var>F</var>, <var>s</var>)</code>は
<code>F(s_1, ... F(s_{n - 2}, F(s_{n - 1}, s_n)))</code>を返します。
オプション引数<var>s_{n + 1}</var>が存在する時、
結果は、<code>rreduce(<var>F</var>, endcons(<var>s_{n + 1}</var>, <var>s</var>))</code>
と同値です。
</p>
<p>関数<var>F</var>は、最初<i>rightmost</i>のリスト要素に適用されます。
だから名前が&quot;rreduce&quot;です。
</p>
<p><code>lreduce</code>, <code>tree_reduce</code>, <code>xreduce</code>も参照してください。
</p>
<p>例:
</p>
<p>オプション引数なしの<code>rreduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) rreduce (f, [1, 2, 3]);
(%o1)                     f(1, f(2, 3))
(%i2) rreduce (f, [1, 2, 3, 4]);
(%o2)                  f(1, f(2, f(3, 4)))
</pre></div>

<p>オプション引数ありの<code>rreduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) rreduce (f, [1, 2, 3], 4);
(%o1)                  f(1, f(2, f(3, 4)))
</pre></div>

<p>組み込み二項演算子に適用された<code>rreduce</code>。
<code>/</code>は割り算演算子。
</p>
<div class="example">
<pre class="example">(%i1) rreduce (&quot;^&quot;, args ({a, b, c, d}));
                                 d
                                c
                               b
(%o1)                         a
(%i2) rreduce (&quot;/&quot;, args ({a, b, c, d}));
                               a c
(%o2)                          ---
                               b d
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="setdifference"></a><a name="Item_003a-nset_002fdeffn_002fsetdifference"></a><dl>
<dt><a name="index-setdifference"></a>関数: <strong>setdifference</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd>
<p>集合<var>a</var>の中の、集合<var>b</var>にない要素を含む集合を返します。
</p>
<p>もし<var>a</var>か<var>b</var>が集合リテラルでないなら、
<code>setdifference</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c, x, y, z};
(%o1)                  {a, b, c, x, y, z}
(%i2) S_2 : {aa, bb, c, x, y, zz};
(%o2)                 {aa, bb, c, x, y, zz}
(%i3) setdifference (S_1, S_2);
(%o3)                       {a, b, z}
(%i4) setdifference (S_2, S_1);
(%o4)                     {aa, bb, zz}
(%i5) setdifference (S_1, S_1);
(%o5)                          {}
(%i6) setdifference (S_1, {});
(%o6)                  {a, b, c, x, y, z}
(%i7) setdifference ({}, S_1);
(%o7)                          {}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="setequalp"></a><a name="Item_003a-nset_002fdeffn_002fsetequalp"></a><dl>
<dt><a name="index-setequalp"></a>関数: <strong>setequalp</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd>
<p>集合<var>a</var>と<var>b</var>が同じ要素数を持ち、
<code>listify</code>が決定した順序で考えて
<var>a</var>の要素の中の<code>x</code>と
<var>b</var>の要素の中の<code>y</code>に対して
<code>is(<var>x</var> = <var>y</var>)</code>が<code>true</code>なら、
<code>true</code>を返します。
そうでなければ、<code>setequalp</code>は<code>false</code>を返します。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) setequalp ({1, 2, 3}, {1, 2, 3});
(%o1)                         true
(%i2) setequalp ({a, b, c}, {1, 2, 3});
(%o2)                         false
(%i3) setequalp ({x^2 - y^2}, {(x + y) * (x - y)});
(%o3)                         false
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>

<a name="setify"></a><a name="Item_003a-nset_002fdeffn_002fsetify"></a><dl>
<dt><a name="index-setify"></a>関数: <strong>setify</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p>リスト<var>a</var>の要素から集合を構成します。
リスト<var>a</var>の重複した要素は削除され、
要素は、述語論理<code>orderlessp</code>に従って並び替えられます。
</p>
<p>もし<var>a</var>が集合リテラルでないなら、
<code>setify</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) setify ([1, 2, 3, a, b, c]);
(%o1)                  {1, 2, 3, a, b, c}
(%i2) setify ([a, b, c, a, b, c]);
(%o2)                       {a, b, c}
(%i3) setify ([7, 13, 11, 1, 3, 9, 5]);
(%o3)                {1, 3, 5, 7, 9, 11, 13}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="setp"></a><a name="Item_003a-nset_002fdeffn_002fsetp"></a><dl>
<dt><a name="index-setp"></a>関数: <strong>setp</strong> <em>(<var>a</var>)</em></dt>
<dd>
<p><var>a</var>がMaximaの集合の時だけ、<code>true</code>を返します。
</p>
<p><code>setp</code>は、
整理された集合はもちろん、未整理の集合(すなわち、冗長な元を持つ集合)に対して、
<code>true</code>を返します。
</p>
<p><code>setp</code>はMaxima関数
<code>setp(a) := not atom(a) and op(a) = 'set</code>
と同値です。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) simp : false;
(%o1)                         false
(%i2) {a, a, a};
(%o2)                       {a, a, a}
(%i3) setp (%);
(%o3)                         true
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>

<a name="set_005fpartitions"></a><a name="Item_003a-nset_002fdeffn_002fset_005fpartitions"></a><dl>
<dt><a name="index-set_005fpartitions"></a>関数: <strong>set_partitions</strong> <em>(<var>a</var>)</em></dt>
<dt><a name="index-set_005fpartitions-1"></a>関数: <strong>set_partitions</strong> <em>(<var>a</var>, <var>n</var>)</em></dt>
<dd>
<p><var>a</var>の分割すべての集合、または、その集合の部分集合を返します。
</p>
<p><code>set_partitions(<var>a</var>, <var>n</var>)</code>は
<var>n</var>個の空でないばらばらの部分集合への
<var>a</var>の分解すべての集合を返します。
</p>
<p><code>set_partitions(<var>a</var>)</code>は分割すべての集合を返します。
</p>
<p><code>stirling2</code>は集合の分割の集合の濃度を返します。
</p>
<p>集合の集合<em>P</em>は
</p>
<ol>
<li> <em>P</em>の元それぞれが空でない集合
</li><li> <em>P</em>の別の元はばらばらである。
</li><li> <em>P</em>の元の和集合が<em>S</em>に等しい
</li></ol>
<p>時、
集合<em>S</em>の分割です。
</p>
<p>例:
</p>
<p>条件1と2が空ゆえに真なので、空集合はそれ自身の分割です。
</p>
<div class="example">
<pre class="example">(%i1) set_partitions ({});
(%o1)                         {{}}
</pre></div>

<p>集合の分割の集合の濃度は、
<code>stirling2</code>を使って見つけられます。
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) cardinality(p) = stirling2 (6, 3);
(%o3)                        90 = 90
</pre></div>

<p><code>p</code>の元それぞれは
<var>n</var> = 3個の元を持たなければいけません;
チェックしましょう。
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) map (cardinality, p);
(%o3)                          {3}
</pre></div>

<p>最後に、
<code>p</code>の元それぞれに対して、
元の和集合は<code>s</code>に等しくなければいけません;
チェックしましょう。
</p>
<div class="example">
<pre class="example">(%i1) s: {0, 1, 2, 3, 4, 5}$
(%i2) p: set_partitions (s, 3)$ 
(%i3) map (lambda ([x], apply (union, listify (x))), p);
(%o3)                 {{0, 1, 2, 3, 4, 5}}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="some"></a><a name="Item_003a-nset_002fdeffn_002fsome"></a><dl>
<dt><a name="index-some"></a>関数: <strong>some</strong> <em>(<var>f</var>, <var>a</var>)</em></dt>
<dt><a name="index-some-1"></a>関数: <strong>some</strong> <em>(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</em></dt>
<dd>
<p>もし与えられた引数のうち１つ以上で述語論理<var>f</var>が<code>true</code>なら
<code>true</code>を返します。
</p>
<p>二番目の引数として集合１つが与えられたとして、
もし
<var>s</var>の中の１つ以上の<var>a_i</var>に対して
<code>is(<var>f</var>(<var>a_i</var>))</code>が<code>true</code>を返すなら、
<code>some(<var>f</var>, <var>s</var>)</code>は<code>true</code>を返します。
<code>some</code>は
<var>s</var>の中の<var>a_i</var>すべてに対して
<var>f</var>を評価するかどうかわかりません。
集合は順序がないので、
<code>some</code>は任意の順序で<code><var>f</var>(<var>a_i</var>)</code>評価するかもしれません。
</p>
<p>引数として２つ以上のリストが与えられたとして、
<code>some(<var>f</var>, <var>L_1</var>, ..., <var>L_n</var>)</code>は<code>true</code>を返します。
もし
<var>L_1</var>, ..., <var>L_n</var>それぞれの中の１つ以上の<var>x_1</var>, ..., <var>x_n</var>で
<code>is(<var>f</var>(<var>x_1</var>, ..., <var>x_n</var>))</code>が<code>true</code>を返すなら、
<code>some</code>は
いくつかの組み合わせ<var>x_1</var>, ..., <var>x_n</var>に対して
<var>f</var>を評価するかどうかわかりません。
<code>some</code>はインデックスを増加する順序でリストを評価します。
</p>
<p>引数として空集合<code>{}</code>または空のリスト<code>[]</code>が与えられたとして、
<code>some</code>は<code>false</code>を返します。
</p>
<p>グローバルフラグ<code>maperror</code>が<code>true</code>の時、
すべてのリスト<var>L_1</var>, ..., <var>L_n</var>は同じ長さを持たなければいけません。
<code>maperror</code>が<code>false</code>の時、
リスト引数は、最短のリストの長さに効果的に切り詰められます。
</p>
<p>(<code>is</code>を介して)<code>true</code>か<code>false</code>以外の何かに評価される
述語論理<var>f</var>の戻り値は、
グローバルフラグ<code>prederror</code>によって決定されます。
<code>prederror</code>が<code>true</code>の時、
そんな値は<code>false</code>として扱われます。
<code>prederror</code>が<code>false</code>の時、
そんな値は<code>unknown</code>として扱われます。
</p>
<p>例:
</p>
<p>集合１つに適用された<code>some</code>。
述語論理は引数１つの関数です。
</p>
<div class="example">
<pre class="example">(%i1) some (integerp, {1, 2, 3, 4, 5, 6});
(%o1)                         true
(%i2) some (atom, {1, 2, sin(3), 4, 5 + y, 6});
(%o2)                         true
</pre></div>

<p>２つのリストに適用された<code>some</code>。
述語論理は引数２つの関数です。
</p>
<div class="example">
<pre class="example">(%i1) some (&quot;=&quot;, [a, b, c], [a, b, c]);
(%o1)                         true
(%i2) some (&quot;#&quot;, [a, b, c], [a, b, c]);
(%o2)                         false
</pre></div>

<p><code>true</code>か<code>false</code>以外の何かに評価される述語論理<var>f</var>の戻り値は、
グローバルフラグ<code>prederror</code>によって決定されます。
</p>
<div class="example">
<pre class="example">(%i1) prederror : false;
(%o1)                         false
(%i2) map (lambda ([a, b], is (a &lt; b)), [x, y, z],
           [x^2, y^2, z^2]);
(%o2)              [unknown, unknown, unknown]
(%i3) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o3)                        unknown
(%i4) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z + 1]);
(%o4)                         true
(%i5) prederror : true;
(%o5)                         true
(%i6) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z^2]);
(%o6)                         false
(%i7) some (&quot;&lt;&quot;, [x, y, z], [x^2, y^2, z + 1]);
(%o7)                         true
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="stirling1"></a><a name="Item_003a-nset_002fdeffn_002fstirling1"></a><dl>
<dt><a name="index-stirling1"></a>関数: <strong>stirling1</strong> <em>(<var>n</var>, <var>m</var>)</em></dt>
<dd>
<p>第一種のスターリング数を表します。
</p>
<p><var>n</var>と<var>m</var>が非負の整数の時、
<code>stirling1 (<var>n</var>, <var>m</var>)</code>の大きさは
<var>m</var>個の巡回置換を持つ<var>n</var>個の元を持つ集合の順列の数です。
詳細はGraham, Knuth and Patashnik <i>Concrete Mathematics</i>を参照してください。
Maximaは、
0より小さい<var>m</var>に対して
<code>stirling1 (<var>n</var>, <var>m</var>)</code>を定義するために
再帰関係を使います;
0より小さい<var>n</var>と非整数引数に対して未定義です。
</p>
<p><code>stirling1</code>は整理関数です。
Maximaは以下の恒等式を知っています。
</p>
<ol>
<li> <em>stirling1(0, n) = kron_delta(0, n)</em> (Ref. [1])
</li><li> <em>stirling1(n, n) = 1</em> (Ref. [1])
</li><li> <em>stirling1(n, n - 1) = binomial(n, 2)</em> (Ref. [1])
</li><li> <em>stirling1(n + 1, 0) = 0</em> (Ref. [1])
</li><li> <em>stirling1(n + 1, 1) = n!</em> (Ref. [1])
</li><li> <em>stirling1(n + 1, 2) = 2^n  - 1</em> (Ref. [1])
</li></ol>

<p>これらの恒等式は
引数が、整数リテラルまたは整数と宣言されたシンボルで、かつ、
最初の引数が非負の時、
適用されます。
<code>stirling1</code>は、非整数引数に対して整理しません。
</p>
<p>参考文献:
</p>
<p>[1] Donald Knuth, <i>The Art of Computer Programming,</i>
third edition, Volume 1, Section 1.2.6, Equations 48, 49, and 50.
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling1 (n, n);
(%o3)                           1
</pre></div>

<p><code>stirling1</code>は非整数引数に対して整理しません。
</p>
<div class="example">
<pre class="example">(%i1) stirling1 (sqrt(2), sqrt(2));
(%o1)              stirling1(sqrt(2), sqrt(2))
</pre></div>

<p>Maximaは
<code>stirling1</code>に恒等式を適用します。
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling1 (n + 1, n);
                            n (n + 1)
(%o3)                       ---------
                                2
(%i4) stirling1 (n + 1, 1);
(%o4)                          n!
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="stirling2"></a><a name="Item_003a-nset_002fdeffn_002fstirling2"></a><dl>
<dt><a name="index-stirling2"></a>関数: <strong>stirling2</strong> <em>(<var>n</var>, <var>m</var>)</em></dt>
<dd>
<p>第二種スターリング数を表します。
</p>
<p><var>n</var>と<var>m</var>が非負の整数の時、
<code>stirling2 (<var>n</var>, <var>m</var>)</code>は、
濃度<var>n</var>の集合が<var>m</var>個のばらばらの部分集合に分割できる方法の数です。
Maximaは、
0より小さい<var>m</var>に対して
<code>stirling2 (<var>n</var>, <var>m</var>)</code>を定義するために
再帰関係を使います;
0より小さい<var>n</var>と非整数の引数に対して未定義です。
</p>
<p><code>stirling2</code>は整理関数です。
Maximaは以下の恒等式を知っています。
</p>
<ol>
<li> <em>stirling2(0, n) = kron_delta(0, n)</em> (Ref. [1])
</li><li> <em>stirling2(n, n) = 1</em> (Ref. [1])
</li><li> <em>stirling2(n, n - 1) = binomial(n, 2)</em> (Ref. [1])
</li><li> <em>stirling2(n + 1, 1) = 1</em> (Ref. [1])
</li><li> <em>stirling2(n + 1, 2) = 2^n  - 1</em> (Ref. [1])
</li><li> <em>stirling2(n, 0) = kron_delta(n, 0)</em> (Ref. [2])
</li><li> <em>stirling2(n, m) = 0</em> when <em>m &gt; n</em> (Ref. [2])
</li><li> <em>stirling2(n, m) = sum((-1)^(m - k) binomial(m k) k^n,i,1,m) / m!</em>
when <em>m</em> and <em>n</em> are integers, and <em>n</em> is nonnegative. (Ref. [3])
</li></ol>

<p>引数が整数リテラルまたは整数と宣言されたシンボルで、かつ、最初の引数が非負の時、
これらの恒等式が適用されます。
<code>stirling2</code>は非整数引数に対して整理されません。
</p>
<p>参考文献:
</p>
<p>[1] Donald Knuth. <i>The Art of Computer Programming</i>,
third edition, Volume 1, Section 1.2.6, Equations 48, 49, and 50.
</p>
<p>[2] Graham, Knuth, and Patashnik. <i>Concrete Mathematics</i>, Table 264.
</p>
<p>[3] Abramowitz and Stegun. <i>Handbook of Mathematical Functions</i>, Section 24.1.4.
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling2 (n, n);
(%o3)                           1
</pre></div>

<p><code>stirling2</code>は非整数引数に対して整理されません。
</p>
<div class="example">
<pre class="example">(%i1) stirling2 (%pi, %pi);
(%o1)                  stirling2(%pi, %pi)
</pre></div>

<p>Maximaは
<code>stirling2</code>に恒等式を適用します。
</p>
<div class="example">
<pre class="example">(%i1) declare (n, integer)$
(%i2) assume (n &gt;= 0)$
(%i3) stirling2 (n + 9, n + 8);
                         (n + 8) (n + 9)
(%o3)                    ---------------
                                2
(%i4) stirling2 (n + 1, 2);
                              n
(%o4)                        2  - 1
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Integers">Integers</a>
&middot;</div>
</dd></dl>

<a name="subset"></a><a name="Item_003a-nset_002fdeffn_002fsubset"></a><dl>
<dt><a name="index-subset"></a>関数: <strong>subset</strong> <em>(<var>a</var>, <var>f</var>)</em></dt>
<dd>
<p>述語論理<var>f</var>を満たす
集合<var>a</var>の部分集合を返します。
</p>
<p><code>subset</code>は、
<var>f</var>が<code>false</code>以外の何かを返す、<var>a</var>の要素から成る集合を返します。
<code>subset</code>は
<code>is</code>を<var>f</var>の戻り値に適用しません。
</p>
<p>もし<var>a</var>が集合リテラルでないなら
<code>subset</code>は文句を言います。
</p>
<p><code>partition_set</code>も参照してください。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) subset ({1, 2, x, x + y, z, x + y + z}, atom);
(%o1)                     {1, 2, x, z}
(%i2) subset ({1, 2, 7, 8, 9, 14}, evenp);
(%o2)                      {2, 8, 14}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="subsetp"></a><a name="Item_003a-nset_002fdeffn_002fsubsetp"></a><dl>
<dt><a name="index-subsetp"></a>関数: <strong>subsetp</strong> <em>(<var>a</var>, <var>b</var>)</em></dt>
<dd>
<p>集合<var>a</var>が<var>b</var>の部分集合の時だけ、
<code>true</code>を返します。
</p>
<p>もし<var>a</var>か<var>b</var>のいずれかが集合リテラルでないなら、
<code>subsetp</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) subsetp ({1, 2, 3}, {a, 1, b, 2, c, 3});
(%o1)                         true
(%i2) subsetp ({a, 1, b, 2, c, 3}, {1, 2, 3});
(%o2)                         false
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;</div>
</dd></dl>

<a name="symmdifference"></a><a name="Item_003a-nset_002fdeffn_002fsymmdifference"></a><dl>
<dt><a name="index-symmdifference"></a>関数: <strong>symmdifference</strong> <em>(<var>a_1</var>, &hellip;, <var>a_n</var>)</em></dt>
<dd>
<p>集合<var>a_1</var>, &hellip;, <var>a_n</var>の対称差を返します。
</p>
<p>２つの引数が与えられたとして、
<code>symmdifference ( <var>a</var>, <var>b</var>)</code>は
<code>union (setdifference ( <var>a</var>, <var>b</var>), setdifference (<var>b</var>, <var>a</var>))</code>と同じです。
</p>
<p>もし引数が集合リテラルでないなら、
<code>symmdifference</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c};
(%o1)                       {a, b, c}
(%i2) S_2 : {1, b, c};
(%o2)                       {1, b, c}
(%i3) S_3 : {a, b, z};
(%o3)                       {a, b, z}
(%i4) symmdifference ();
(%o4)                          {}
(%i5) symmdifference (S_1);
(%o5)                       {a, b, c}
(%i6) symmdifference (S_1, S_2);
(%o6)                        {1, a}
(%i7) symmdifference (S_1, S_2, S_3);
(%o7)                        {1, b, z}
(%i8) symmdifference ({}, S_1, S_2, S_3);
(%o8)                        {1,b, z}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="tree_005freduce"></a><a name="Item_003a-nset_002fdeffn_002ftree_005freduce"></a><dl>
<dt><a name="index-tree_005freduce"></a>関数: <strong>tree_reduce</strong> <em>(<var>F</var>, <var>s</var>)</em></dt>
<dt><a name="index-tree_005freduce-1"></a>関数: <strong>tree_reduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_0</var>)</em></dt>
<dd>
<p>合成によって二項関数<var>F</var>をn項関数に拡張します。
ここで<var>s</var>は集合かリストです。
</p>
<p><code>tree_reduce</code>は以下と同値です:
新しいリスト<code>[<var>F</var>(<var>s_1</var>, <var>s_2</var>), <var>F</var>(<var>s_3</var>, <var>s_4</var>), ...]</code>を形成するために
<var>F</var>を要素の連続する対に適用します。
もし奇数個の要素があるなら、
最後の要素は変化なしに通過させます。
そして、リストが１つの要素になるまで繰り返します。１つの要素になった時、それが戻り値です。
</p>
<p>オプションの引数<var>s_0</var>がある時，
結果は
<code>tree_reduce(<var>F</var>, cons(<var>s_0</var>, <var>s</var>)</code>と同値です。
</p>
<p>浮動小数点数の足し算に関して、
<code>tree_reduce</code>は、
<code>rreduce</code>や<code>lreduce</code>よりも小さな丸め誤差を持つ和を返します。
</p>
<p><var>s</var>の要素と部分的な結果は
最小深度の二項木の中に配列されます。
だから名前が&quot;tree_reduce&quot;です。
</p>
<p>例:
</p>
<p>偶数個の要素を持つリストに適用された<code>tree_reduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) tree_reduce (f, [a, b, c, d]);
(%o1)                  f(f(a, b), f(c, d))
</pre></div>

<p>奇数個の要素を持つリストに適用された<code>tree_reduce</code>。
</p>
<div class="example">
<pre class="example">(%i1) tree_reduce (f, [a, b, c, d, e]);
(%o1)               f(f(f(a, b), f(c, d)), e)
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<a name="union"></a><a name="Item_003a-nset_002fdeffn_002funion"></a><dl>
<dt><a name="index-union"></a>関数: <strong>union</strong> <em>(<var>a_1</var>, ..., <var>a_n</var>)</em></dt>
<dd><p>集合<var>a_1</var>から<var>a_n</var>の和集合を返します。
</p>
<p><code>union()</code> (引数なし)は空集合を返します。
</p>
<p>もし引数が集合リテラルでないなら、
<code>union</code>は文句を言います。
</p>
<p>例:
</p>
<div class="example">
<pre class="example">(%i1) S_1 : {a, b, c + d, %e};
(%o1)                   {%e, a, b, d + c}
(%i2) S_2 : {%pi, %i, %e, c + d};
(%o2)                 {%e, %i, %pi, d + c}
(%i3) S_3 : {17, 29, 1729, %pi, %i};
(%o3)                {17, 29, 1729, %i, %pi}
(%i4) union ();
(%o4)                          {}
(%i5) union (S_1);
(%o5)                   {%e, a, b, d + c}
(%i6) union (S_1, S_2);
(%o6)              {%e, %i, %pi, a, b, d + c}
(%i7) union (S_1, S_2, S_3);
(%o7)       {17, 29, 1729, %e, %i, %pi, a, b, d + c}
(%i8) union ({}, S_1, S_2, S_3);
(%o8)       {17, 29, 1729, %e, %i, %pi, a, b, d + c}
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;</div>
</dd></dl>

<a name="xreduce"></a><a name="Item_003a-nset_002fdeffn_002fxreduce"></a><dl>
<dt><a name="index-xreduce"></a>関数: <strong>xreduce</strong> <em>(<var>F</var>, <var>s</var>)</em></dt>
<dt><a name="index-xreduce-1"></a>関数: <strong>xreduce</strong> <em>(<var>F</var>, <var>s</var>, <var>s_0</var>)</em></dt>
<dd>
<p>合成によって関数<var>F</var>をn項関数に拡張します。
または、もし<var>F</var>が既にn項関数なら<var>F</var>を<var>s</var>に適用します。
<var>F</var>がn項関数でない時、
<code>xreduce</code>は<code>lreduce</code>と同じです。
引数<var>s</var>はリストです。
</p>
<p>n項関数として知られている関数は、
足し算<code>+</code>, 掛け算<code>*</code>, <code>and</code>, <code>or</code>, <code>max</code>,
<code>min</code>, <code>append</code>を含みます。
関数は、
<code>declare(<var>F</var>, nary)</code>によってもn項と宣言されるかもしれません。
これらの関数に対して、
<code>xreduce</code>は
<code>rreduce</code>や<code>lreduce</code>よりも速いことが期待されます。
</p>
<p>オプション引数<var>s_0</var>がある時、
結果は、<code>xreduce(<var>s</var>, cons(<var>s_0</var>, <var>s</var>))</code>と同値です。
</p>
<p>浮動小数点の足し算は、厳密には結合的ではありません;
そうはそうかもしれませんが、
<var>s</var>が浮動小数点を含む時、
<code>xreduce</code>はMaximaのn項足し算を適用します。
</p>
<p>例:
</p>
<p>n項と知られている関数に適用された<code>xreduce</code>。
<code>F</code>は引数すべてで、一度コールされます。
</p>
<div class="example">
<pre class="example">(%i1) declare (F, nary);
(%o1)                         done
(%i2) F ([L]) := L;
(%o2)                      F([L]) := L
(%i3) xreduce (F, [a, b, c, d, e]);
(%o3)         [[[[[(&quot;[&quot;, simp), a], b], c], d], e]
</pre></div>

<p>n項とわかっていない関数に適用された<code>xreduce</code>。
<code>G</code>は、
毎回２つの引数で複数回コールされます。
</p>
<div class="example">
<pre class="example">(%i1) G ([L]) := L;
(%o1)                      G([L]) := L
(%i2) xreduce (G, [a, b, c, d, e]);
(%o2)         [[[[[(&quot;[&quot;, simp), a], b], c], d], e]
(%i3) lreduce (G, [a, b, c, d, e]);
(%o3)                 [[[[a, b], c], d], e]
</pre></div>

<div class=categorybox>
<a href="maxima_311.html#Category_003a-Sets">Sets</a>
&middot;<a href="maxima_311.html#Category_003a-Lists">Lists</a>
&middot;</div>
</dd></dl>

<hr>
<div class="header">
<p>
Previous: <a href="maxima_149.html#Introduction-to-Sets" accesskey="p" rel="previous">Introduction to Sets</a>, Up: <a href="maxima_148.html#Sets" accesskey="u" rel="up">Sets</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="maxima_307.html#Function-and-Variable-Index" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
