<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on April, 4 2011 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 17. Polynome</title>

<meta name="description" content="Maxima Manual: 17. Polynome">
<meta name="keywords" content="Maxima Manual: 17. Polynome">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Polynome"></a>
<a name="SEC111"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_16.html#SEC110" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC112" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC114" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_75.html#SEC385" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 17. Polynome </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC112">17.1 Introduction to Polynomials</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC113">17.2 Functions and Variables for Polynomials</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introduction-to-Polynomials"></a>
<a name="SEC112"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC111" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC113" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC111" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC111" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC114" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_75.html#SEC385" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 17.1 Introduction to Polynomials </h2>

<p>Polynome werden in einer allgemeinen Darstellung oder in einer kanonischen
Darstellung (CRE - Cannonical Rational Expressions) gespeichert.  Die 
CRE-Darstellung ist die Standardform f&uuml;r Operationen mit Polynomen und wird 
intern von Funktionen wie <code><a href="#factor">factor</a></code>
 oder <code><a href="#ratsimp">ratsimp</a></code>
 verwendet.
</p>
<p>Ausdr&uuml;cke in einer CRE-Form sind besonders f&uuml;r die Darstellung von Polynomen
und rationalen Funktionen geeignet.  Die CRE-Form nimmt eine Ordnung der
Variablen an.  Polynome werden rekursiv als eine Liste definiert, die als
ersten Eintrag den Namen der Variablen und als n&auml;chste Eintr&auml;ge die 
Exponenten und Koeffizienten der Variablen enthalten.  Der Koeffizient kann
eine Zahl oder wiederum ein Polynom sein.  Zum Beispiel hat das Polynom
<code>3*x^2-1</code> die Darstellung <code>(X 2 3 0 -1)</code> und das Polynom 
<code>2*x*y+x-3</code> die Darstellung <code>(Y 1 (X 1 2) 0 (X 1 1 0 -3))</code>, wenn 
<code>y</code> die Hauptvariable des Polynoms ist.  Ist <var>x</var> die Hauptvariable des
Polynoms, dann ist die Darstellung <code>(X 1 (Y 1 2 0 1) 0 -3)</code>.
</p>
<p>Die Ordnung der Variablen ist in der Regel umgekehrt alphabetisch.  Die
Variablen m&uuml;ssen keine Atome sein.  Alle Ausdr&uuml;cke, die nicht die Operatoren
<code>+</code>, <code>-</code>, <code>*</code>, <code>/</code> oder <code>^</code> enthalten, werden in einer
CRE-Darstellung als &quot;Variable&quot; angenommen.  Zum Beispiel sind <code>x</code>, 
<code>sqrt(x)</code> und <code>sin(x+1)</code> die CRE-Variablen des Ausdrucks
<code>x+sin(x+1)+2*SQRT(x)+1</code>.  Wird vom Nutzer keine abweichende Ordnung der 
Variablen mit der Funktion <code><a href="#ratvars">ratvars</a></code>
 definiert, nimmt Maxima eine 
alphabetische Ordnung der Variablen an.
</p>
<p>Im Allgemeinen werden rationale Funktionen in einer CRE-Form dargestellt, die
keinen gemeinsamen Faktor im Z&auml;hler und Nenner haben.  Die interne Darstellung
ist ein Paar von Polynomen, die jeweils den Z&auml;hler und den Nenner darstellen.
Diesem Paar geht eine Liste mit der Ordnung der Variablen im Ausdruck voraus.
Ein Ausdruck in einer CRE-Form oder der CRE-Formen enth&auml;lt, wird in der 
Ausgabe mit dem Symbol <code>/R/</code> gekennzeichnet.  Mit der Funktion
<code><a href="#rat">rat</a></code>
 k&ouml;nnen allgemeine Ausdr&uuml;cke in eine CRE-Form transformiert
werden.
</p>
<p>F&uuml;r die Darstellung von Taylor-Polynomen der Funktion <code><a href="maxima_15.html#taylor">taylor</a></code>
 wird eine
erweiterte CRE-Form verwendet.  In dieser Darstellung k&ouml;nnen die Exponenten
von Polynomen auch rationale Zahlen sein.  Weiterhin k&ouml;nnen die Koeffizienten
rationale Funktionen sein.  Die erweiterte CRE-Form enth&auml;lt auch Informationen
&uuml;ber den Grad des Polynoms.  In der Ausgabe wird die erweiterte CRE-Form mit
dem Symbol <code>/T/</code> bezeichnet.
</p>
<hr size="6">
<a name="Functions-and-Variables-for-Polynomials"></a>
<a name="SEC113"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC112" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC114" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC111" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC111" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC114" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_75.html#SEC385" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 17.2 Functions and Variables for Polynomials </h2>

<p><a name="algebraic"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>algebraic</b>
<a name="IDX786"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p><code>algebraic</code> muss den Wert <code>true</code> haben, damit algebraische ganze
Zahlen vereinfacht werden.
</p></dd></dl>

<p><a name="berlefact"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>berlefact</b>
<a name="IDX787"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>berlefact</code> den Wert <code>false</code>, dann wird der Kronecker-Algorithmus
f&uuml;r die Faktorisierung genutzt.  Ansonsten wird der Berlekamp-Algorithmus 
genutzt.  Das ist der Standard.
</p></dd></dl>

<p><a name="bezout"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bezout</b><i> (<var>p1</var>, <var>p2</var>, <var>x</var>)</i>
<a name="IDX788"></a>
</dt>
<dd><p>Die R&uuml;ckgabe ist die Sylvestermatrix der zwei Polynome <var>p1</var> und <var>p2</var>
mit der unabh&auml;ngigen Variablen <var>x</var>.  Die Determinante der Sylvestermatrix
ist die Resultante der Polynome.  Die Resultante kann auch sofort mit der
Funktion <code><a href="#resultant">resultant</a></code>
 berechnet werden.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) bezout(a*x+b, c*x^2+d, x);
                         [ b c  - a d ]
(%o1)                    [            ]
                         [  a     b   ]
(%i2) determinant(%);
                            2      2
(%o2)                      a  d + b  c
(%i3) resultant(a*x+b, c*x^2+d, x);
                            2      2
(%o3)                      a  d + b  c
</pre></dd></dl>

<p><a name="bothcoef"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bothcoef</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX789"></a>
</dt>
<dd><p>Gibt eine Liste zur&uuml;ck, deren erstes Element der Koeffizient der Variablen
<var>x</var> im Ausdruck <var>expr</var> und deren zweites Element der verbleibende
Teil des Ausdrucks <var>expr</var> ist.  Das Ergebnis ist also <code>[A,B]</code> und es
gilt <code><var>expr</var> = A * <var>x</var> + B</code>.
</p>
<p>Siehe auch die Funktion <code><a href="#coeff">coeff</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) bothcoeff(a*x+2,x);
(%o1)                        [a, 2]
(%i2) bothcoeff(x^2+a*x+2,x);
                                2
(%o2)                      [a, x  + 2]
</pre>
<p>Definition einer Funktion <code>islinear</code>, die die Funktion <code>bothcoeff</code>
nutzt, um den linearen Anteil eines Ausdrucks zu ermitteln.
</p>
<pre class="example">(%i1) islinear (expr, x) := block ([c],
        c: bothcoef (rat (expr, x), x),
        is (freeof (x, c) and c[1] # 0))$
(%i2) islinear ((r^2 - (x - r)^2)/x, x);
(%o2)                         true
</pre></dd></dl>

<p><a name="coeff"></a>
</p><dl>
<dt><u>Funktion:</u> <b>coeff</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX790"></a>
</dt>
<dt><u>Funktion:</u> <b>coeff</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX791"></a>
</dt>
<dd><p>Gibt den Koeffizienten von <code><var>x</var>^<var>n</var></code> im Ausdruck <var>expr</var>
zur&uuml;ck, wobei <var>expr</var> ein Polynom ist.
</p>
<p>Das Kommando <code>coeff(<var>expr</var>, <var>x</var>^<var>n</var>)</code> ist &auml;quivalent zu
<code>coeff(<var>expr</var>, <var>x</var>, <var>n</var>)</code>.  Das Kommando
<code>coeff(<var>expr</var>, <var>x</var>, 0)</code> gibt den Rest des Ausdrucks <var>expr</var>
zur&uuml;ck, der frei von der Variablen <var>x</var> ist.  Wenn nicht angegeben, wird
<var>n</var> als 1 angenommen.
</p>
<p><var>x</var> kann auch eine indizierte Variable oder ein Teilausdruck von <var>expr</var>
sein.
</p>
<p><code>coeff</code> wendet weder die Funktion <code>expand</code> noch die Funktion 
<code>factor</code> an, um einen Ausdruck zu expandieren oder zu faktorisieren.  Daher
kann es zu anderen Ergebnissen kommen, wenn zuvor diese Funktionen angewendet 
werden.
</p>
<p>Wird <code>coeff</code> auf Listen, Matrizen oder Gleichungen angewendet, wird die
Funktion auf die Elemente bzw. beide Seiten der Gleichung angewendet.
</p>
<p>Siehe auch die Funktion <code><a href="#bothcoef">bothcoef</a></code>.
</p>

<p>Beispiele:
</p>
<p><code>coeff</code> gibt den Koeffizient <code><var>x</var>^<var>n</var></code> des Ausdruckes 
<var>expr</var> zur&uuml;ck.
</p>
<pre class="example">(%i1) coeff (b^3*a^3 + b^2*a^2 + b*a + 1, a^3);
                                3
(%o1)                          b
</pre>
<p><code>coeff(<var>expr</var>, <var>x</var>^<var>n</var>)</code> ist &auml;quivalent zu
<code>coeff(<var>expr</var>, <var>x</var>, <var>n</var>)</code>.
</p>
<pre class="example">(%i1) coeff (c[4]*z^4 - c[3]*z^3 - c[2]*z^2 + c[1]*z, z, 3);
(%o1)                         - c
                                 3
(%i2) coeff (c[4]*z^4 - c[3]*z^3 - c[2]*z^2 + c[1]*z, z^3);
(%o2)                         - c
                                 3
</pre>
<p><code>coeff(<var>expr</var>, <var>x</var>, 0)</code> gibt den Rest des Ausdrucksw <var>expr</var>
zur&uuml;ck, der frei von der Variablen <var>x</var> ist.
</p>
<pre class="example">(%i1) coeff (a*u + b^2*u^2 + c^3*u^3, b, 0);
                            3  3
(%o1)                      c  u  + a u
</pre>
<p><var>x</var> kann eine einfache Variable, eine indizierte Variable oder ein 
Teilausdruck des Ausdrucks <var>expr</var> sein.
</p>
<pre class="example">(%i1) coeff (h^4 - 2*%pi*h^2 + 1, h, 2);
(%o1)                        - 2 %pi
(%i2) coeff (v[1]^4 - 2*%pi*v[1]^2 + 1, v[1], 2);
(%o2)                        - 2 %pi
(%i3) coeff (sin(1+x)*sin(x) + sin(1+x)^3*sin(x)^3, sin(1+x)^3);
                                3
(%o3)                        sin (x)
(%i4) coeff ((d - a)^2*(b + c)^3 + (a + b)^4*(c - d), a + b, 4);
(%o4)                         c - d
</pre>
<p><code>coeff</code> wendet die Funktionen <code>expand</code> und <code>factor</code> nicht an.
</p>
<pre class="example">(%i1) coeff (c*(a + b)^3, a);
(%o1)                           0
(%i2) expand (c*(a + b)^3);
                 3          2        2        3
(%o2)           b  c + 3 a b  c + 3 a  b c + a  c
(%i3) coeff (%, a);
                                2
(%o3)                        3 b  c
(%i4) coeff (b^3*c + 3*a*b^2*c + 3*a^2*b*c + a^3*c, (a + b)^3);
(%o4)                           0
(%i5) factor (b^3*c + 3*a*b^2*c + 3*a^2*b*c + a^3*c);
                                  3
(%o5)                      (b + a)  c
(%i6) coeff (%, (a + b)^3);
(%o6)                           c
</pre>
<p><code>coeff</code> wird bei Listen und Matrizen auf die Elemente und bei Gleichungen
auf die beiden Seiten angewendet.
</p>
<pre class="example">(%i1) coeff ([4*a, -3*a, 2*a], a);
(%o1)                      [4, - 3, 2]
(%i2) coeff (matrix ([a*x, b*x], [-c*x, -d*x]), x);
                          [  a    b  ]
(%o2)                     [          ]
                          [ - c  - d ]
(%i3) coeff (a*u - b*v = 7*u + 3*v, u);
(%o3)                         a = 7
</pre>
<p>Maxima kennt keine Funktion, um eine Liste der Koeffizienten eines Polynoms
zur&uuml;ckzugeben.  Die folgende Definition der Funktion <code>coeff_list</code> liefert
das gew&uuml;nschte Ergebnis.  Neben der Funktion <code>coeff</code> kommt die
Funktion <code><a href="#hipow">hipow</a></code>
 zum Einsatz, um den höchsten Koeffizienten zu ermitteln.
Die Funktionen <code><a href="maxima_5.html#cons">cons</a></code>
 und <code><a href="maxima_5.html#reverse">reverse</a></code>
 werden verwendet, um die
Koeffizienten einer Liste hinzuf&uuml;gen und um die Liste zu invertieren.
</p>
<pre class="example">coeff_list(a,x) := 
   block([liste],
      liste:[],
      for i:0 thru hipow(a,x) do 
      (
        liste : cons(coeff(a,x,i),liste)
      ),
      reverse(liste)
   )$
</pre>
<pre class="example">(%i1) coeff_list(2*x^4+3*x^2+1,x);
(%o1)                    [1, 0, 3, 0, 2]
</pre></dd></dl>

<p><a name="content"></a>
</p><dl>
<dt><u>Funktion:</u> <b>content</b><i> (<var>p_1</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX792"></a>
</dt>
<dd><p>Gibt eine Liste zur&uuml;ck, deren erstes Element der gr&ouml;&szlig;te gemeinsame 
Teiler der Koeffizienten des Polynoms <var>p_1</var> in der Variablen <var>x_n</var> ist 
und dessen zweites Element das durch den gr&ouml;&szlig;ten gemeinsamen Teiler 
dividierte Polynom ist.  Die anderen Variablen <var>x_1</var>, &hellip;, <var>x_n-1</var>
haben dieselbe Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) content (2*x*y + 4*x^2*y^2, y);
                                   2
(%o1)                   [2 x, 2 x y  + y]
</pre></dd></dl>

<p><a name="denom"></a>
</p><dl>
<dt><u>Funktion:</u> <b>denom</b><i> (<var>expr</var>)</i>
<a name="IDX793"></a>
</dt>
<dd><p>Gibt den Nenner des rationalen Ausdrucks <var>expr</var> zur&uuml;ck.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) denom(x^2/(x+1));
(%o1)                         x + 1
</pre></dd></dl>

<p><a name="divide"></a>
</p><dl>
<dt><u>Funktion:</u> <b>divide</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX794"></a>
</dt>
<dd><p>Berechnet den Quotienten und den Rest der Division des Polynom <var>p_1</var> durch
das Polynom <var>p_2</var> f&uuml;r die Variable <var>x_n</var>.  Die anderen Variablen
<var>x_1</var>, &hellip;, <var>x_n-1</var> haben dieselbe Bedeutung wie f&uuml;r die Funktion
<code><a href="#ratvars">ratvars</a></code>.
  Das Ergebnis ist eine Liste, wobei das erste Element der
Quotient und das zweite Element der Rest ist.
</p>
<p>Siehe auch die Funktionen <code><a href="#quotient">quotient</a></code>
 und <code><a href="#remainder">remainder</a></code>,
 die jeweils
den Quotienten und den Rest der Polynomdivision zur&uuml;ckgegeben.
</p>
<p>Beispiele:
</p>
<p>Im zweiten Beispiel ist <code>y</code> die Hauptvariable des Ausdrucks.
</p>
<pre class="example">(%i1) divide (x + y, x - y, x);
(%o1)                       [1, 2 y]
(%i2) divide (x + y, x - y);
(%o2)                      [- 1, 2 x]
</pre>
<p>Ein Beispiel f&uuml;r zwei Polynome in zwei Variablen.
</p>
<pre class="example">(%i1) poly1 : sum(x^k*y^(6-k), k, 1, 5);
                  5    2  4    3  3    4  2    5
(%o1)          x y  + x  y  + x  y  + x  y  + x  y
(%i2) poly2 : sum(2*k*x^k*y^(3-k), k, 1, 3);
                          2      2        3
(%o2)                2 x y  + 4 x  y + 6 x
(%i3) divide(poly1, poly2, x);
              3        2      2          5       2  4
           4 y  + 3 x y  + 9 x  y  23 x y  + 16 x  y
(%o3)     [----------------------, ------------------]
                     54                    27
(%i4) expand(first(%)*poly2 + second(%));
                  5    2  4    3  3    4  2    5
(%o4)          x y  + x  y  + x  y  + x  y  + x  y
</pre></dd></dl>

<p><a name="dontfactor"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>dontfactor</b>
<a name="IDX795"></a>
</dt>
<dd><p>Standardwert: <code>[]</code>
</p>

<p>Der Optionsvariablen <code>dontfactor</code> kann eine Liste mit den Variablen
zugewiesen werden, bez&uuml;glich der ein Ausdruck nicht faktorisiert werden soll.
Weiterhin wird nicht bez&uuml;glich von Variablen faktorisiert, die gem&auml;&szlig;
der kanonischen Ordnung der Variablen von geringerer Bedeutung sind, als die
Variablen in der Liste <code>dontfactor</code>.
</p></dd></dl>

<p><a name="eliminate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>eliminate</b><i> ([<var>eqn_1</var>, &hellip;, <var>eqn_n</var>], [<var>x_1</var>, &hellip;, <var>x_k</var>])</i>
<a name="IDX796"></a>
</dt>
<dd><p>Wendet ein Subresultanten-Verfahren an, um die Variablen <var>x_1</var>, &hellip;, 
<var>x_k</var> aus den Gleichungen <var>eqn_1</var>, &hellip;, <var>eqn_n</var> zu eliminieren.
Die R&uuml;ckgabe ist ein Gleichungssystem mit <code><var>n</var> - <var>k</var></code>
Gleichungen, wobei die <var>k</var>-Variablen <var>x_1</var>, &hellip;, <var>x_k</var>
eliminiert sind.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) eqn1: 2*x^2 + y*x + z;
                                      2
(%o1)                    z + x y + 2 x
(%i2) eqn2: 3*x + 5*y - z - 1;
(%o2)                  - z + 5 y + 3 x - 1
(%i3) eqn3: z^2 + x - y^2 + 5;
                          2    2
(%o3)                    z  - y  + x + 5
(%i4) eliminate([eqn1, eqn2, eqn3], [y,z]);
              2      4      3       2
(%o4)       [x  (45 x  + 3 x  + 11 x  + 81 x + 124)]
</pre></dd></dl>

<p><a name="ezgcd"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ezgcd</b><i> (<var>p_1</var>, <var>p_2</var>, <var>p_3</var>, &hellip;)</i>
<a name="IDX797"></a>
</dt>
<dd><p>Gibt eine Liste zur&uuml;ck, deren erstes Element der gr&ouml;&szlig;te gemeinsame
Teiler der Polynome <var>p_1</var>, &hellip;, <var>p_n</var> ist und deren weitere Elemente
die durch den gr&ouml;&szlig;ten gemeinsamen Teiler dividierten Polynome sind.  Der
gr&ouml;&szlig;te gemeinsame Teiler wird immer mit dem <code>ezgcd</code>-Algorithmus 
bestimmt.
</p>
<p>Siehe auch die Funktionen <code><a href="#gcd">gcd</a></code>,
 <code><a href="#gcdex">gcdex</a></code>
 und <code><a href="maxima_66.html#gcdivide">gcdivide</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) poly1 : 6*x^3-17*x^2+14*x-3;
                        3       2
(%o1)                6 x  - 17 x  + 14 x - 3
(%i2) poly2 : 4*x^4-14*x^3+12*x^2+2*x-3;
                    4       3       2
(%o2)            4 x  - 14 x  + 12 x  + 2 x - 3
(%i3) poly3 : -8*x^3+14*x^2-x-3;
                          3       2
(%o3)                - 8 x  + 14 x  - x - 3
(%i4) ezgcd(poly1, poly2, poly3);
                   2               3      2           2
(%o4) [2 x - 3, 3 x  - 4 x + 1, 2 x  - 4 x  + 1, - 4 x  + x + 1]
</pre></dd></dl>

<p><a name="facexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>facexpand</b>
<a name="IDX798"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p><code>facexpand</code> kontrolliert, ob die irreduziblen Faktoren der Faktorisierung
mit <code><a href="#factor">factor</a></code>
 in einer expandierten oder in einer rekursiven (CRE-Form) 
vorliegen.  Der Standard ist, das die Faktoren expandiert werden.
</p></dd></dl>

<p><a name="factor"></a>
</p><dl>
<dt><u>Funktion:</u> <b>factor</b><i> (<var>expr</var>)</i>
<a name="IDX799"></a>
</dt>
<dt><u>Funktion:</u> <b>factor</b><i> (<var>expr</var>, <var>p</var>)</i>
<a name="IDX800"></a>
</dt>
<dd><p>Factors the expression <var>expr</var>, containing any number of variables or 
functions, into factors irreducible over the integers.
<code>factor (<var>expr</var>, <var>p</var>)</code> factors <var>expr</var> over the field of 
rationals with an element adjoined whose minimum polynomial is <var>p</var>.
</p>

<p><code>factor</code> uses <code>ifactors</code> function for factoring integers.
</p>
<p><code>factorflag</code> if <code>false</code> suppresses the factoring of integer factors
of rational expressions.
</p>
<p><code>dontfactor</code> may be set to a list of variables with respect to which
factoring is not to occur.  (It is initially empty).  Factoring also
will not take place with respect to any variables which are less
important (using the variable ordering assumed for CRE form) than
those on the <code>dontfactor</code> list.
</p>
<p><code>savefactors</code> if <code>true</code> causes the factors of an expression which
is a product of factors to be saved by certain functions in order to
speed up later factorizations of expressions containing some of the
same factors.
</p>
<p><code>berlefact</code> if <code>false</code> then the Kronecker factoring algorithm will
be used otherwise the Berlekamp algorithm, which is the default, will
be used.
</p>
<p><code>intfaclim</code> if <code>true</code> maxima will give up factorization of
integers if no factor is found after trial divisions and Pollard's rho
method.  If set to <code>false</code> (this is the case when the user calls
<code>factor</code> explicitly), complete factorization of the integer will be
attempted.  The user's setting of <code>intfaclim</code> is used for internal
calls to <code>factor</code>.  Thus, <code>intfaclim</code> may be reset to prevent
Maxima from taking an inordinately long time factoring large integers.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) factor (2^63 - 1);
                    2
(%o1)              7  73 127 337 92737 649657
(%i2) factor (-8*y - 4*x + z^2*(2*y + x));
(%o2)               (2 y + x) (z - 2) (z + 2)
(%i3) -1 - 2*x - x^2 + y^2 + 2*x*y^2 + x^2*y^2;
                2  2        2    2    2
(%o3)          x  y  + 2 x y  + y  - x  - 2 x - 1
(%i4) block ([dontfactor: [x]], factor (%/36/(1 + 2*y + y^2)));
                       2
                     (x  + 2 x + 1) (y - 1)
(%o4)                ----------------------
                           36 (y + 1)
(%i5) factor (1 + %e^(3*x));
                      x         2 x     x
(%o5)              (%e  + 1) (%e    - %e  + 1)
(%i6) factor (1 + x^4, a^2 - 2);
                    2              2
(%o6)             (x  - a x + 1) (x  + a x + 1)
(%i7) factor (-y^2*z^2 - x*z^2 + x^2*y^2 + x^3);
                       2
(%o7)              - (y  + x) (z - x) (z + x)
(%i8) (2 + x)/(3 + x)/(b + x)/(c + x)^2;
                             x + 2
(%o8)               ------------------------
                                           2
                    (x + 3) (x + b) (x + c)
(%i9) ratsimp (%);
                4                  3
(%o9) (x + 2)/(x  + (2 c + b + 3) x

     2                       2             2                   2
 + (c  + (2 b + 6) c + 3 b) x  + ((b + 3) c  + 6 b c) x + 3 b c )
(%i10) partfrac (%, x);
           2                   4                3
(%o10) - (c  - 4 c - b + 6)/((c  + (- 2 b - 6) c

     2              2         2                2
 + (b  + 12 b + 9) c  + (- 6 b  - 18 b) c + 9 b ) (x + c))

                 c - 2
 - ---------------------------------
     2                             2
   (c  + (- b - 3) c + 3 b) (x + c)

                         b - 2
 + -------------------------------------------------
             2             2       3      2
   ((b - 3) c  + (6 b - 2 b ) c + b  - 3 b ) (x + b)

                         1
 - ----------------------------------------------
             2
   ((b - 3) c  + (18 - 6 b) c + 9 b - 27) (x + 3)
(%i11) map ('factor, %);
              2
             c  - 4 c - b + 6                 c - 2
(%o11) - ------------------------- - ------------------------
                2        2                                  2
         (c - 3)  (c - b)  (x + c)   (c - 3) (c - b) (x + c)

                       b - 2                        1
            + ------------------------ - ------------------------
                             2                          2
              (b - 3) (c - b)  (x + b)   (b - 3) (c - 3)  (x + 3)
(%i12) ratsimp ((x^5 - 1)/(x - 1));
                       4    3    2
(%o12)                x  + x  + x  + x + 1
(%i13) subst (a, x, %);
                       4    3    2
(%o13)                a  + a  + a  + a + 1
(%i14) factor (%th(2), %);
                       2        3        3    2
(%o14)   (x - a) (x - a ) (x - a ) (x + a  + a  + a + 1)
(%i15) factor (1 + x^12);
                       4        8    4
(%o15)               (x  + 1) (x  - x  + 1)
(%i16) factor (1 + x^99);
                 2            6    3
(%o16) (x + 1) (x  - x + 1) (x  - x  + 1)

   10    9    8    7    6    5    4    3    2
 (x   - x  + x  - x  + x  - x  + x  - x  + x  - x + 1)

   20    19    17    16    14    13    11    10    9    7    6
 (x   + x   - x   - x   + x   + x   - x   - x   - x  + x  + x

    4    3            60    57    51    48    42    39    33
 - x  - x  + x + 1) (x   + x   - x   - x   + x   + x   - x

    30    27    21    18    12    9    3
 - x   - x   + x   + x   - x   - x  + x  + 1)
</pre></dd></dl>

<p><a name="factorflag"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>factorflag</b>
<a name="IDX801"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>factorflag</code> den Wert <code>false</code>, wird die Faktorisierung von ganzen
Zahlen unterdr&uuml;ckt, die im Nenner auftreten.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) factorflag:false;
(%o1)                         false
(%i2) factor(1/6*(x^2+2*x+1));
                                   2
                            (x + 1)
(%o2)                       --------
                               6
(%i3) factorflag:true;
(%o3)                         true
(%i4) factor(1/6*(x^2+2*x+1));
                                   2
                            (x + 1)
(%o4)                       --------
                              2 3
</pre></dd></dl>

<p><a name="factorout"></a>
</p><dl>
<dt><u>Funktion:</u> <b>factorout</b><i> (<var>expr</var>, <var>x_1</var>, <var>x_2</var>, &hellip;)</i>
<a name="IDX802"></a>
</dt>
<dd><p> Rearranges the sum <var>expr</var> into a sum of terms of the form 
 <code>f (<var>x_1</var>, <var>x_2</var>, ...)*g</code> where <code>g</code> is a product of 
 expressions not containing any <var>x_i</var> and <code>f</code> is factored.
   </p></dd></dl>

<p><a name="factorsum"></a>
</p><dl>
<dt><u>Function:</u> <b>factorsum</b><i> (<var>expr</var>)</i>
<a name="IDX803"></a>
</dt>
<dd><p> Tries to group terms in factors of <var>expr</var> which are sums into groups of 
 terms such that their sum is factorable.  <code>factorsum</code> can recover the 
 result of <code>expand ((x + y)^2 + (z + w)^2)</code> but it can't recover
 <code>expand ((x + 1)^2 + (x + y)^2)</code> because the terms have variables in 
 common.
</p>
<p> Example:
</p>
<pre class="example">(%i1) expand ((x + 1)*((u + v)^2 + a*(w + z)^2));
           2      2                            2      2
(%o1) a x z  + a z  + 2 a w x z + 2 a w z + a w  x + v  x

                                     2        2    2            2
                        + 2 u v x + u  x + a w  + v  + 2 u v + u
(%i2) factorsum (%);
                                   2          2
(%o2)            (x + 1) (a (z + w)  + (v + u) )
</pre></dd></dl>

<p><a name="fasttimes"></a>
</p><dl>
<dt><u>Function:</u> <b>fasttimes</b><i> (<var>p_1</var>, <var>p_2</var>)</i>
<a name="IDX804"></a>
</dt>
<dd><p> Returns the product of the polynomials <var>p_1</var> and <var>p_2</var> by using a 
 special algorithm for multiplication of polynomials.  <code>p_1</code> and 
 <code>p_2</code> should be multivariate, dense, and nearly the same size.
 Classical multiplication is of order <code>n_1 n_2</code> where <code>n_1</code> is the 
 degree of <code>p_1</code> and <code>n_2</code> is the degree of <code>p_2</code>.
 <code>fasttimes</code> is of order <code>max (n_1, n_2)^1.585</code>.
</p></dd></dl>

<p><a name="fullratsimp"></a>
</p><dl>
<dt><u>Function:</u> <b>fullratsimp</b><i> (<var>expr</var>)</i>
<a name="IDX805"></a>
</dt>
<dd><p> <code>fullratsimp</code> repeatedly applies <code>ratsimp</code> followed by non-rational
 simplification to an expression until no further change occurs, and returns 
 the result.
</p>
<p> When non-rational expressions are involved, one call to <code>ratsimp</code> 
 followed as is usual by non-rational (&quot;general&quot;) simplification may not be 
 sufficient to return a simplified result.  Sometimes, more than one such call 
 may be necessary.  <code>fullratsimp</code> makes this process convenient.
</p>
<p> <code>fullratsimp (<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</code> takes one or more 
 arguments similar to <code>ratsimp</code> and <code>rat</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) expr: (x^(a/2) + 1)^2*(x^(a/2) - 1)^2/(x^a - 1);
                       a/2     2   a/2     2
                     (x    - 1)  (x    + 1)
(%o1)                -----------------------
                              a
                             x  - 1
(%i2) ratsimp (expr);
                          2 a      a
                         x    - 2 x  + 1
(%o2)                    ---------------
                              a
                             x  - 1
(%i3) fullratsimp (expr);
                              a
(%o3)                        x  - 1
(%i4) rat (expr);
                       a/2 4       a/2 2
                     (x   )  - 2 (x   )  + 1
(%o4)/R/             -----------------------
                              a
                             x  - 1
</pre></dd></dl>


<p><a name="fullratsubst"></a>
</p><dl>
<dt><u>Function:</u> <b>fullratsubst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX806"></a>
</dt>
<dd><p> is the same as <code>ratsubst</code> except that it calls itself recursively on its
 result until that result stops changing.  This function is useful when the 
 replacement expression and the replaced expression have one or more variables
 in common.
</p>
<p> <code>fullratsubst</code> will also accept its arguments in the format of
 <code>lratsubst</code>.  That is, the first argument may be a single substitution
 equation or a list of such equations, while the second argument is the
 expression being processed.
</p>
<p> <code>load (&quot;lrats&quot;)</code> loads <code>fullratsubst</code> and <code>lratsubst</code>.
</p>
<p> Examples:
</p>
<pre class="example">(%i1) load (&quot;lrats&quot;)$
</pre>
<p><code>subst</code> can carry out multiple substitutions.
<code>lratsubst</code> is analogous to <code>subst</code>.
</p>
<pre class="example">(%i2) subst ([a = b, c = d], a + c);
(%o2)                         d + b
(%i3) lratsubst ([a^2 = b, c^2 = d], (a + e)*c*(a + c));
(%o3)                (d + a c) e + a d + b c
</pre>
<p>If only one substitution is desired, then a single
equation may be given as first argument.
</p>
<pre class="example">(%i4) lratsubst (a^2 = b, a^3);
(%o4)                          a b
</pre>
<p><code>fullratsubst</code> is equivalent to <code>ratsubst</code>
except that it recurses until its result stops changing.
</p>
<pre class="example">(%i5) ratsubst (b*a, a^2, a^3);
                               2
(%o5)                         a  b
(%i6) fullratsubst (b*a, a^2, a^3);
                                 2
(%o6)                         a b
</pre>
<p><code>fullratsubst</code> also accepts a list of equations or a single
equation as first argument.
</p>
<pre class="example">(%i7) fullratsubst ([a^2 = b, b^2 = c, c^2 = a], a^3*b*c);
(%o7)                           b
(%i8) fullratsubst (a^2 = b*a, a^3);
                                 2
(%o8)                         a b
</pre>
<p><code>fullratsubst</code> may cause an indefinite recursion.
</p>
<pre class="example">(%i9) errcatch (fullratsubst (b*a^2, a^2, a^3));

*** - Lisp stack overflow. RESET
</pre></dd></dl>

<p><a name="gcd"></a>
</p><dl>
<dt><u>Funktion:</u> <b>gcd</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;)</i>
<a name="IDX807"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>gcd</b>
<a name="IDX808"></a>
</dt>
<dd>
<p>Gibt den gr&ouml;&szlig;ten gemeinsamen Teiler der Polynome <var>p_1</var> und <var>p_2</var>
zur&uuml;ck.  Die Argumente <var>x_1</var>, &hellip; sind optional und haben dieselbe
Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
  Die Optionsvariable 
<code>gcd</code> kontrolliert, welcher Algorithmus verwendet wird und kann die
folgenden Werte annehmen:
</p>
<dl compact="compact">
<dt> <code>ez</code></dt>
<dd><p>ezgcd-Alogrithmus
</p></dd>
<dt> <code>subres</code></dt>
<dd><p>Subresultanten-Algorithmus
</p></dd>
<dt> <code>red</code></dt>
<dd><p>Reduzierter modularer Algorithmus
</p></dd>
<dt> <code>spmod</code></dt>
<dd><p>Modularer Algorithmus
</p></dd>
<dt> <code>false</code></dt>
<dd><p>kein Algorithmus, die R&uuml;ckgabe ist immer 1
</p></dd>
</dl>

<p>Siehe auch die Funktionen <code><a href="#ezgcd">ezgcd</a></code>,
 <code><a href="#gcdex">gcdex</a></code>
 und <code><a href="maxima_66.html#gcdivide">gcdivide</a></code>.
</p>

</dd></dl>

<p><a name="gcdex"></a>
</p><dl>
<dt><u>Funktion:</u> <b>gcdex</b><i> (<var>p_1</var>, <var>p_2</var>)</i>
<a name="IDX809"></a>
</dt>
<dt><u>Funktion:</u> <b>gcdex</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x</var>)</i>
<a name="IDX810"></a>
</dt>
<dd>
<p>Wendet den erweiterten Euklidischen Algorithmus f&uuml;r die beiden Polynome
<var>p_1</var> und <var>p_2</var> an und gibt eine Liste <code>[s, t, u]</code> mit den
Parametern <var>u</var>, <var>s</var> und <var>t</var> als Ergebnis zur&uuml;ck.  Der Parameter
<var>u</var> ist der gr&ouml;&szlig;te gemeinsame Teiler der Polynome.  Die Parameter
<var>s</var> und <var>t</var> sind die Bezoutkoeffizienten, so dass gilt
<code>u = s * p_1 + t * p_2</code>.
</p>
<p>Die R&uuml;ckgabe der Funktion <code>gcdex</code> ist in der CRE-Form.
</p>

<p>Siehe auch die Funktionen <code><a href="#ezgcd">ezgcd</a></code>,
 <code><a href="#gcd">gcd</a></code>
 und <code><a href="maxima_66.html#gcdivide">gcdivide</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) gcdex (x^2 + 1, x^3 + 4);
                       2
                      x  + 4 x - 1  x + 4
(%o1)/R/           [- ------------, -----, 1]
                           17        17
(%i2) % . [x^2 + 1, x^3 + 4, -1];
(%o2)/R/                        0
</pre>
<p>Im folgenden Beispiel ist die unabh&auml;ngige Variable explizit als <var>x</var>
angegeben.  Ohne diese Angabe ist <var>y</var> die unabh&auml;ngige Variable.
</p>
<pre class="example">(%i1) gcdex (x*(y + 1), y^2 - 1, x);
                               1
(%o1)/R/                 [0, ------, 1]
                              2
                             y  - 1
</pre></dd></dl>


<p><a name="gcfactor"></a>
</p><dl>
<dt><u>Function:</u> <b>gcfactor</b><i> (<var>n</var>)</i>
<a name="IDX811"></a>
</dt>
<dd><p> Factors the Gaussian integer <var>n</var> over the Gaussian integers, i.e.,
 numbers of the form <code><var>a</var> + <var>b</var> <code>%i</code></code> where <var>a</var> and 
 <var>b</var> are rational integers (i.e.,  ordinary integers).  Factors are 
 normalized by making <var>a</var> and <var>b</var> non-negative.
</p>
</dd></dl>


<p><a name="gfactor"></a>
</p><dl>
<dt><u>Function:</u> <b>gfactor</b><i> (<var>expr</var>)</i>
<a name="IDX812"></a>
</dt>
<dd><p>Factors the polynomial <var>expr</var> over the Gaussian integers
(that is, the integers with the imaginary unit <code>%i</code> adjoined).
This is like <code>factor (<var>expr</var>, <var>a</var>^2+1)</code> where <var>a</var> is <code>%i</code>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) gfactor (x^4 - 1);
(%o1)           (x - 1) (x + 1) (x - %i) (x + %i)
</pre></dd></dl>


<p><a name="gfactorsum"></a>
</p><dl>
<dt><u>Function:</u> <b>gfactorsum</b><i> (<var>expr</var>)</i>
<a name="IDX813"></a>
</dt>
<dd><p>is similar to <code>factorsum</code> but applies <code>gfactor</code> instead
of <code>factor</code>.
</p></dd></dl>

<p><a name="hipow"></a>
</p><dl>
<dt><u>Function:</u> <b>hipow</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX814"></a>
</dt>
<dd>

<p>Gibt den gr&ouml;&szlig;ten Exponenten des Arguments <var>x</var> zur&uuml;ck, der im
Ausdruck <var>expr</var> auftritt.  Treten symbolische Exponenten auf, wird ein
Ausdruck mit <code>max</code> zur&uuml;ckgegeben.  Ist das Argument <var>x</var> nicht im
Ausdruck vorhanden, ist die R&uuml;ckgabe 0.
</p>
<p>Die Funktion <code>hipow</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Daher
k&ouml;nnen die Ausdr&uuml;cke <code>expand(<var>expr</var>)</code> und <var>expr</var> ein
verschiedenes Ergebnis haben.
</p>
<p>Siehe auch die Funktionen <code><a href="#lopow">lopow</a></code>
 und <code><a href="#coeff">coeff</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) hipow (y^3 * x^2 + x * y^4, x);
(%o1)                           2
(%i2) hipow ((x + y)^5, x);
(%o2)                           1
(%i3) hipow (expand ((x + y)^5), x);
(%o3)                           5
(%i4) hipow ((x + y)^5, x + y);
(%o4)                           5
(%i5) hipow (expand ((x + y)^5), x + y);
(%o5)                           0
(%i1) hipow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       max(2, a)
</pre></dd></dl>


<p><a name="intfaclim"></a>
</p><dl>
<dt><u>Option variable:</u> <b>intfaclim</b>
<a name="IDX815"></a>
</dt>
<dd><p>Default value: true
</p>
<p>If <code>true</code>, maxima will give up factorization of
integers if no factor is found after trial divisions and Pollard's rho
method and factorization will not be complete.
</p>
<p>When <code>intfaclim</code> is <code>false</code> (this is the case when the user
calls <code>factor</code> explicitly), complete factorization will be
attempted.  <code>intfaclim</code> is set to <code>false</code> when factors are
computed in <code>divisors</code>, <code>divsum</code> and <code>totient</code>.
</p>
<p>Internal calls to <code>factor</code> respect the user-specified value of
<code>intfaclim</code>.  Setting <code>intfaclim</code> to <code>true</code> may reduce
the time spent factoring large integers.
</p></dd></dl>

<p><a name="keepfloat"></a>
</p><dl>
<dt><u>Option variable:</u> <b>keepfloat</b>
<a name="IDX816"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>keepfloat</code> is <code>true</code>, prevents floating
point numbers from being rationalized when expressions which contain
them are converted to canonical rational expression (CRE) form.
</p>
<p>Note that the function <code>solve</code> and those functions calling it 
(<code>eigenvalues</code>, for example) currently ignore this flag, converting 
floating point numbers anyway.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) rat(x/2.0);

`rat' replaced 0.5 by 1/2 = 0.5
                                       x
(%o1)/R/                               -
                                       2
(%i2) rat(x/2.0), keepfloat;

(%o2)/R/                             0.5 x
</pre>
<p><code>solve</code> ignores <code>keepfloat</code>:
</p>
<pre class="example">(%i3) solve(1.0-x,x), keepfloat;

`rat' replaced 1.0 by 1/1 = 1.0
(%o3)                               [x = 1]
</pre></dd></dl>

<p><a name="lopow"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lopow</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX817"></a>
</dt>
<dd>
<p>Gibt den kleinsten Exponenten von <var>x</var> zur&uuml;ck, der im Ausdruck <var>expr</var>
auftritt.  Treten symbolische Exponententen auf, wird ein Ausdruck mit 
<code>min</code> zur&uuml;ckgegeben.  Ist das Argument <var>x</var> nicht im
Ausdruck enthalten, ist die R&uuml;ckgabe 0.
</p>
<p>Die Funktion <code>lopow</code> betrachtet keine &auml;quivalenten Ausdr&uuml;cke.  Daher
k&ouml;nnen die Ausdr&uuml;cke <code>expand(<var>expr</var>)</code> und <var>expr</var> ein
verschiedenes Ergebnis haben.
</p>
<p>Siehe auch die Funktionen <code><a href="#hipow">hipow</a></code>
 und <code><a href="#coeff">coeff</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) lopow ((x+y)^2 + (x+y)^a, x+y);
(%o1)                       min(a, 2)
</pre></dd></dl>


<p><a name="lratsubst"></a>
</p><dl>
<dt><u>Function:</u> <b>lratsubst</b><i> (<var>L</var>, <var>expr</var>)</i>
<a name="IDX818"></a>
</dt>
<dd><p>is analogous to <code>subst (<var>L</var>, <var>expr</var>)</code>
except that it uses <code>ratsubst</code> instead of <code>subst</code>.
</p>
<p>The first argument of
<code>lratsubst</code> is an equation or a list of equations identical in
format to that accepted by <code>subst</code>.  The
substitutions are made in the order given by the list of equations,
that is, from left to right.
</p>
<p><code>load (&quot;lrats&quot;)</code> loads <code>fullratsubst</code> and <code>lratsubst</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) load (&quot;lrats&quot;)$
</pre>
<p><code>subst</code> can carry out multiple substitutions.
<code>lratsubst</code> is analogous to <code>subst</code>.
</p>
<pre class="example">(%i2) subst ([a = b, c = d], a + c);
(%o2)                         d + b
(%i3) lratsubst ([a^2 = b, c^2 = d], (a + e)*c*(a + c));
(%o3)                (d + a c) e + a d + b c
</pre>
<p>If only one substitution is desired, then a single
equation may be given as first argument.
</p>
<pre class="example">(%i4) lratsubst (a^2 = b, a^3);
(%o4)                          a b
</pre></dd></dl>

<p><a name="modulus"></a>
</p><dl>
<dt><u>Option variable:</u> <b>modulus</b>
<a name="IDX819"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>modulus</code> is a positive number <var>p</var>,
operations on rational numbers (as returned by <code>rat</code> and related functions)
are carried out modulo <var>p</var>,
using the so-called &quot;balanced&quot; modulus system
in which <code><var>n</var> modulo <var>p</var></code> is defined as 
an integer <var>k</var> in <code>[-(<var>p</var>-1)/2, ..., 0, ..., (<var>p</var>-1)/2]</code>
when <var>p</var> is odd, or <code>[-(<var>p</var>/2 - 1), ..., 0, ...., <var>p</var>/2]</code> when <var>p</var> is even,
such that <code><var>a</var> <var>p</var> + <var>k</var></code> equals <var>n</var> for some integer <var>a</var>.
</p>
<p>If <var>expr</var> is already in canonical rational expression (CRE) form when <code>modulus</code> is reset,
then you may need to re-rat <var>expr</var>, e.g., <code>expr: rat (ratdisrep (expr))</code>,
in order to get correct results.
</p>
<p>Typically <code>modulus</code> is set to a prime number.
If <code>modulus</code> is set to a positive non-prime integer,
this setting is accepted, but a warning message is displayed.
Maxima will allow zero or a negative integer to be assigned to <code>modulus</code>,
although it is not clear if that has any useful consequences.
</p></dd></dl>


<p><a name="num"></a>
</p><dl>
<dt><u>Function:</u> <b>num</b><i> (<var>expr</var>)</i>
<a name="IDX820"></a>
</dt>
<dd><p>Returns the numerator of <var>expr</var> if it is a ratio.
If <var>expr</var> is not a ratio, <var>expr</var> is returned.
</p>
<p><code>num</code> evaluates its argument.
</p>
</dd></dl>

<p><a name="partfrac"></a>
</p><dl>
<dt><u>Function:</u> <b>partfrac</b><i> (<var>expr</var>, <var>var</var>)</i>
<a name="IDX821"></a>
</dt>
<dd><p>Expands the expression <var>expr</var> in partial fractions
with respect to the main variable <var>var</var>.  <code>partfrac</code> does a complete
partial fraction decomposition.  The algorithm employed is based on
the fact that the denominators of the partial fraction expansion (the
factors of the original denominator) are relatively prime.  The
numerators can be written as linear combinations of denominators, and
the expansion falls out.
</p>
<pre class="example">(%i1) 1/(1+x)^2 - 2/(1+x) + 2/(2+x);
                      2       2        1
(%o1)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
(%i2) ratsimp (%);
                                 x
(%o2)                 - -------------------
                         3      2
                        x  + 4 x  + 5 x + 2
(%i3) partfrac (%, x);
                      2       2        1
(%o3)               ----- - ----- + --------
                    x + 2   x + 1          2
                                    (x + 1)
</pre></dd></dl>

<p><a name="polydecomp"></a>
</p><dl>
<dt><u>Function:</u> <b>polydecomp</b><i> (<var>p</var>, <var>x</var>)</i>
<a name="IDX822"></a>
</dt>
<dd><p>Decomposes the polynomial <var>p</var> in the variable <var>x</var>
into the functional composition of polynomials in <var>x</var>.
<code>polydecomp</code> returns a list <code>[<var>p_1</var>, ..., <var>p_n</var>]</code> such that
</p>
<pre class="example">lambda ([x], p_1) (lambda ([x], p_2) (... (lambda ([x], p_n) (x))
  ...))
</pre>
<p>is equal to <var>p</var>.
The degree of <var>p_i</var> is greater than 1 for <var>i</var> less than <var>n</var>.
</p>
<p>Such a decomposition is not unique.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) polydecomp (x^210, x);
                          7   5   3   2
(%o1)                   [x , x , x , x ]
(%i2) p : expand (subst (x^3 - x - 1, x, x^2 - a));
                6      4      3    2
(%o2)          x  - 2 x  - 2 x  + x  + 2 x - a + 1
(%i3) polydecomp (p, x);
                        2       3
(%o3)                 [x  - a, x  - x - 1]
</pre>
<p>The following function composes <code>L = [e_1, ..., e_n]</code> as functions in <code>x</code>;
it is the inverse of polydecomp:
</p>
<pre class="example">compose (L, x) :=
  block ([r : x], for e in L do r : subst (e, x, r), r) $
</pre>
<p>Re-express above example using <code>compose</code>:
</p>
<pre class="example">(%i3) polydecomp (compose ([x^2 - a, x^3 - x - 1], x), x);
                        2       3
(%o3)                 [x  - a, x  - x - 1]
</pre>
<p>Note that though <code>compose (polydecomp (<var>p</var>, <var>x</var>), <var>x</var>)</code>
always returns <var>p</var> (unexpanded),
<code>polydecomp (compose ([<var>p_1</var>, ..., <var>p_n</var>], <var>x</var>), <var>x</var>)</code> does <i>not</i>
necessarily return <code>[<var>p_1</var>, ..., <var>p_n</var>]</code>:
</p>
<pre class="example">(%i4) polydecomp (compose ([x^2 + 2*x + 3, x^2], x), x);
                          2       2
(%o4)                   [x  + 2, x  + 1]
(%i5) polydecomp (compose ([x^2 + x + 1, x^2 + x + 1], x), x);
                      2       2
                     x  + 3  x  + 5
(%o5)               [------, ------, 2 x + 1]
                       4       2
</pre></dd></dl>

<p><a name="polymod"></a>
</p><dl>
<dt><u>Funktion:</u> <b>polymod</b><i> (<var>p</var>)</i>
<a name="IDX823"></a>
</dt>
<dt><u>Function:</u> <b>polymod</b><i> (<var>p</var>, <var>m</var>)</i>
<a name="IDX824"></a>
</dt>
<dd>
<p>Konvertiert das Polynom <var>p</var> in eine modulare Darstellung bez&uuml;glich dem
aktuellen Modul.  Das Modul ist der Wert der Variablen <code>modulus</code>.
</p>

<p><code>polymod(<var>p</var>, <var>m</var></code> konvertiert das Polynom bez&uuml;glich dem Modul 
<var>m</var>, anstatt dem aktuellen Modul <code>modulus</code>.
</p>

<p>Siehe <code>modulus</code>.
</p></dd></dl>

<p><a name="powers"></a>
</p><dl>
<dt><u>Function:</u> <b>powers</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX825"></a>
</dt>
<dd><p>Gives the powers of <var>x</var> occuring in <var>expr</var>.
</p>
<p><code>load (powers)</code> loads this function.
</p>
</dd></dl>

<p><a name="quotient"></a>
</p><dl>
<dt><u>Funktion:</u> <b>quotient</b><i> (<var>p_1</var>, <var>p_2</var>)</i>
<a name="IDX826"></a>
</dt>
<dt><u>Funktion:</u> <b>quotient</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX827"></a>
</dt>
<dd><p>Berechnet den Quotienten der Polynome <var>p_1</var> und <var>p_2</var> f&uuml;r die Variable
<var>x_n</var>.  Die anderen Variablen <var>x_1</var>, &hellip;, <var>x_n-1</var> haben dieselbe
Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>

<p><code>quotient</code> gibt das erste Element des Ergebnisses der Funktion
<code><a href="#divide">divide</a></code>
 zur&uuml;ck.
</p>
<p>Siehe auch die Funktion <code><a href="#remainder">remainder</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) poly1 : x^3-2*x^2-5*x+7;
                        3      2
(%o1)                  x  - 2 x  - 5 x + 7
(%i2) poly2 : x-1;
(%o2)                         x - 1
(%i3) quotient(poly1, poly2, x);
                            2
(%o3)                      x  - x - 6
</pre></dd></dl>


<p><a name="rat"></a>
</p><dl>
<dt><u>Function:</u> <b>rat</b><i> (<var>expr</var>)</i>
<a name="IDX828"></a>
</dt>
<dt><u>Function:</u> <b>rat</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX829"></a>
</dt>
<dd><p>Converts <var>expr</var> to canonical rational expression (CRE) form by expanding and
combining all terms over a common denominator and cancelling out the
greatest common divisor of the numerator and denominator, as well as
converting floating point numbers to rational numbers within a
tolerance of <code>ratepsilon</code>.
The variables are ordered according
to the <var>x_1</var>, ..., <var>x_n</var>, if specified, as in <code>ratvars</code>.
</p>
<p><code>rat</code> does not generally simplify functions other than
addition <code>+</code>, subtraction <code>-</code>, multiplication <code>*</code>, division <code>/</code>, and
exponentiation to an integer power,
whereas <code>ratsimp</code> does handle those cases.
Note that atoms (numbers and variables) in CRE form are not the
same as they are in the general form.
For example, <code>rat(x)- x</code> yields 
<code>rat(0)</code> which has a different internal representation than 0.
</p>
<p>When <code>ratfac</code> is <code>true</code>, <code>rat</code> yields a partially factored form for CRE.
During rational operations the expression is
maintained as fully factored as possible without an actual call to the
factor package.  This should always save space and may save some time
in some computations.  The numerator and denominator are still made
relatively prime
(e.g.  <code>rat ((x^2 - 1)^4/(x + 1)^2)</code> yields <code>(x - 1)^4 (x + 1)^2)</code>,
but the factors within each part may not be relatively prime.
</p>
<p><code>ratprint</code> if <code>false</code> suppresses the printout of the message
informing the user of the conversion of floating point numbers to
rational numbers.
</p>
<p><code>keepfloat</code> if <code>true</code> prevents floating point numbers from being
converted to rational numbers.
</p>
<p>See also <code>ratexpand</code> and  <code>ratsimp</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) ((x - 2*y)^4/(x^2 - 4*y^2)^2 + 1)*(y + a)*(2*y + x) /
      (4*y^2 + x^2);
                                           4
                                  (x - 2 y)
              (y + a) (2 y + x) (------------ + 1)
                                   2      2 2
                                 (x  - 4 y )
(%o1)         ------------------------------------
                              2    2
                           4 y  + x
(%i2) rat (%, y, a, x);
                            2 a + 2 y
(%o2)/R/                    ---------
                             x + 2 y
</pre></dd></dl>

<p><a name="ratalgdenom"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratalgdenom</b>
<a name="IDX830"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>ratalgdenom</code> is <code>true</code>, allows rationalization of
denominators with respect to radicals to take effect.
<code>ratalgdenom</code> has an effect only when canonical rational expressions (CRE) are used in algebraic mode.
</p></dd></dl>


<p><a name="ratcoef"></a>
</p><dl>
<dt><u>Function:</u> <b>ratcoef</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX831"></a>
</dt>
<dt><u>Function:</u> <b>ratcoef</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX832"></a>
</dt>
<dd><p>Returns the coefficient of the expression <code><var>x</var>^<var>n</var></code>
in the expression <var>expr</var>.
If omitted, <var>n</var> is assumed to be 1.
</p>
<p>The return value is free
(except possibly in a non-rational sense) of the variables in <var>x</var>.
If no coefficient of this type exists, 0 is returned.
</p>
<p><code>ratcoef</code>
expands and rationally simplifies its first argument and thus it may
produce answers different from those of <code>coeff</code> which is purely
syntactic.
Thus <code>ratcoef ((x + 1)/y + x, x)</code> returns <code>(y + 1)/y</code> whereas <code>coeff</code> returns 1.
</p>
<p><code>ratcoef (<var>expr</var>, <var>x</var>, 0)</code>, viewing <var>expr</var> as a sum,
returns a sum of those terms which do not contain <var>x</var>.
Therefore if <var>x</var> occurs to any negative powers, <code>ratcoef</code> should not be used.
</p>
<p>Since <var>expr</var> is rationally
simplified before it is examined, coefficients may not appear quite
the way they were envisioned.
</p>
<p>Example:
</p>
<pre class="example">(%i1) s: a*x + b*x + 5$
(%i2) ratcoef (s, a + b);
(%o2)                           x
</pre></dd></dl>

<p><a name="ratdenom"></a>
</p><dl>
<dt><u>Function:</u> <b>ratdenom</b><i> (<var>expr</var>)</i>
<a name="IDX833"></a>
</dt>
<dd><p>Returns the denominator of <var>expr</var>,
after coercing <var>expr</var> to a canonical rational expression (CRE).
The return value is a CRE.
</p>
<p><var>expr</var> is coerced to a CRE by <code>rat</code>
if it is not already a CRE.
This conversion may change the form of <var>expr</var> by putting all terms
over a common denominator.
</p>
<p><code>denom</code> is similar, but returns an ordinary expression instead of a CRE.
Also, <code>denom</code> does not attempt to place all terms over a common denominator,
and thus some expressions which are considered ratios by <code>ratdenom</code>
are not considered ratios by <code>denom</code>.
</p>
</dd></dl>

<p><a name="ratdenomdivide"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratdenomdivide</b>
<a name="IDX834"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>ratdenomdivide</code> is <code>true</code>,
<code>ratexpand</code> expands a ratio in which the numerator is a sum 
into a sum of ratios,
all having a common denominator.
Otherwise, <code>ratexpand</code> collapses a sum of ratios into a single ratio,
the numerator of which is the sum of the numerators of each ratio.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) expr: (x^2 + x + 1)/(y^2 + 7);
                            2
                           x  + x + 1
(%o1)                      ----------
                              2
                             y  + 7
(%i2) ratdenomdivide: true$
(%i3) ratexpand (expr);
                       2
                      x        x        1
(%o3)               ------ + ------ + ------
                     2        2        2
                    y  + 7   y  + 7   y  + 7
(%i4) ratdenomdivide: false$
(%i5) ratexpand (expr);
                            2
                           x  + x + 1
(%o5)                      ----------
                              2
                             y  + 7
(%i6) expr2: a^2/(b^2 + 3) + b/(b^2 + 3);
                                     2
                           b        a
(%o6)                    ------ + ------
                          2        2
                         b  + 3   b  + 3
(%i7) ratexpand (expr2);
                                  2
                             b + a
(%o7)                        ------
                              2
                             b  + 3
</pre></dd></dl>

<p><a name="ratdiff"></a>
</p><dl>
<dt><u>Function:</u> <b>ratdiff</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX835"></a>
</dt>
<dd><p>Differentiates the rational expression <var>expr</var> with respect to <var>x</var>.
<var>expr</var> must be a ratio of polynomials or a polynomial in <var>x</var>.
The argument <var>x</var> may be a variable or a subexpression of <var>expr</var>.
</p>
<p>The result is equivalent to <code>diff</code>, although perhaps in a different form.
<code>ratdiff</code> may be faster than <code>diff</code>, for rational expressions.
</p>
<p><code>ratdiff</code> returns a canonical rational expression (CRE) if <code>expr</code> is a CRE.
Otherwise, <code>ratdiff</code> returns a general expression.
</p>
<p><code>ratdiff</code> considers only the dependence of <var>expr</var> on <var>x</var>,
and ignores any dependencies established by <code>depends</code>.
</p>

<p>Example:
</p>
<pre class="example">(%i1) expr: (4*x^3 + 10*x - 11)/(x^5 + 5);
                           3
                        4 x  + 10 x - 11
(%o1)                   ----------------
                              5
                             x  + 5
(%i2) ratdiff (expr, x);
                    7       5       4       2
                 8 x  + 40 x  - 55 x  - 60 x  - 50
(%o2)          - ---------------------------------
                          10       5
                         x   + 10 x  + 25
(%i3) expr: f(x)^3 - f(x)^2 + 7;
                         3       2
(%o3)                   f (x) - f (x) + 7
(%i4) ratdiff (expr, f(x));
                           2
(%o4)                   3 f (x) - 2 f(x)
(%i5) expr: (a + b)^3 + (a + b)^2;
                              3          2
(%o5)                  (b + a)  + (b + a)
(%i6) ratdiff (expr, a + b);
                    2                    2
(%o6)            3 b  + (6 a + 2) b + 3 a  + 2 a
</pre></dd></dl>

<p><a name="ratdisrep"></a>
</p><dl>
<dt><u>Function:</u> <b>ratdisrep</b><i> (<var>expr</var>)</i>
<a name="IDX836"></a>
</dt>
<dd><p>Returns its argument as a general expression.
If <var>expr</var> is a general expression, it is returned unchanged.
</p>
<p>Typically <code>ratdisrep</code> is called to convert a canonical rational expression (CRE)
into a general expression.
This is sometimes convenient if one wishes to stop the &quot;contagion&quot;, or
use rational functions in non-rational contexts.
</p>
<p>See also <code>totaldisrep</code>.
</p></dd></dl>

<p><a name="ratexpand"></a>
</p><dl>
<dt><u>Function:</u> <b>ratexpand</b><i> (<var>expr</var>)</i>
<a name="IDX837"></a>
</dt>
<dt><u>Option variable:</u> <b>ratexpand</b>
<a name="IDX838"></a>
</dt>
<dd><p>Expands <var>expr</var> by multiplying out products of sums and
exponentiated sums, combining fractions over a common denominator,
cancelling the greatest common divisor of the numerator and
denominator, then splitting the numerator (if a sum) into its
respective terms divided by the denominator.
</p>
<p>The return value of <code>ratexpand</code> is a general expression,
even if <var>expr</var> is a canonical rational expression (CRE).
</p>
<p>The switch <code>ratexpand</code> if <code>true</code> will cause CRE
expressions to be fully expanded when they are converted back to
general form or displayed, while if it is <code>false</code> then they will be put
into a recursive form.
See also <code>ratsimp</code>.
</p>
<p>When <code>ratdenomdivide</code> is <code>true</code>,
<code>ratexpand</code> expands a ratio in which the numerator is a sum 
into a sum of ratios,
all having a common denominator.
Otherwise, <code>ratexpand</code> collapses a sum of ratios into a single ratio,
the numerator of which is the sum of the numerators of each ratio.
</p>
<p>When <code>keepfloat</code> is <code>true</code>, prevents floating
point numbers from being rationalized when expressions which contain
them are converted to canonical rational expression (CRE) form.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) ratexpand ((2*x - 3*y)^3);
                     3         2       2        3
(%o1)          - 27 y  + 54 x y  - 36 x  y + 8 x
(%i2) expr: (x - 1)/(x + 1)^2 + 1/(x - 1);
                         x - 1       1
(%o2)                   -------- + -----
                               2   x - 1
                        (x + 1)
(%i3) expand (expr);
                    x              1           1
(%o3)          ------------ - ------------ + -----
                2              2             x - 1
               x  + 2 x + 1   x  + 2 x + 1
(%i4) ratexpand (expr);
                        2
                     2 x                 2
(%o4)           --------------- + ---------------
                 3    2            3    2
                x  + x  - x - 1   x  + x  - x - 1
</pre></dd></dl>

<p><a name="ratfac"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratfac</b>
<a name="IDX839"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>ratfac</code> is <code>true</code>,
canonical rational expressions (CRE) are manipulated in a partially factored form.
</p>
<p>During rational operations the
expression is maintained as fully factored as possible without calling <code>factor</code>.
This should always save space and may save time in some computations.
The numerator and denominator are made relatively prime, for example
<code>rat ((x^2 - 1)^4/(x + 1)^2)</code> yields <code>(x - 1)^4 (x + 1)^2)</code>,
but the factors within each part may not be relatively prime.
</p>
<p>In the <code>ctensr</code> (Component Tensor Manipulation) package,
Ricci, Einstein, Riemann, and Weyl tensors and the scalar curvature 
are factored automatically when <code>ratfac</code> is <code>true</code>.
<i><code>ratfac</code> should only be
set for cases where the tensorial components are known to consist of
few terms.</i>
</p>
<p>The <code>ratfac</code> and <code>ratweight</code> schemes are incompatible and may not
both be used at the same time.
</p>
</dd></dl>

<p><a name="ratnumer"></a>
</p><dl>
<dt><u>Function:</u> <b>ratnumer</b><i> (<var>expr</var>)</i>
<a name="IDX840"></a>
</dt>
<dd><p>Returns the numerator of <var>expr</var>,
after coercing <var>expr</var> to a canonical rational expression (CRE).
The return value is a CRE.
</p>
<p><var>expr</var> is coerced to a CRE by <code>rat</code>
if it is not already a CRE.
This conversion may change the form of <var>expr</var> by putting all terms
over a common denominator.
</p>
<p><code>num</code> is similar, but returns an ordinary expression instead of a CRE.
Also, <code>num</code> does not attempt to place all terms over a common denominator,
and thus some expressions which are considered ratios by <code>ratnumer</code>
are not considered ratios by <code>num</code>.
</p>
</dd></dl>

<p><a name="ratp"></a>
</p><dl>
<dt><u>Function:</u> <b>ratp</b><i> (<var>expr</var>)</i>
<a name="IDX841"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>expr</var> is a canonical rational expression (CRE) or extended CRE,
otherwise <code>false</code>.
</p>
<p>CRE are created by <code>rat</code> and related functions.
Extended CRE are created by <code>taylor</code> and related functions.
</p></dd></dl>

<p><a name="ratprint"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratprint</b>
<a name="IDX842"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>ratprint</code> is <code>true</code>,
a message informing the user of the conversion of floating point numbers
to rational numbers is displayed.
</p></dd></dl>

<p><a name="ratsimp"></a>
</p><dl>
<dt><u>Function:</u> <b>ratsimp</b><i> (<var>expr</var>)</i>
<a name="IDX843"></a>
</dt>
<dt><u>Function:</u> <b>ratsimp</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX844"></a>
</dt>
<dd><p>Simplifies the expression <var>expr</var> and all of its subexpressions,
including the arguments to non-rational functions.
The result is returned as the quotient of two polynomials in a recursive form,
that is, the coefficients of the main variable are polynomials in the other variables.
Variables may include non-rational functions (e.g., <code>sin (x^2 + 1)</code>)
and the arguments to any such functions are also rationally simplified.
</p>
<p><code>ratsimp (<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</code>
enables rational simplification with the
specification of variable ordering as in <code>ratvars</code>.
</p>
<p>When <code>ratsimpexpons</code> is <code>true</code>,
<code>ratsimp</code> is applied to the exponents of expressions during simplification.
</p>
<p>See also <code>ratexpand</code>.
Note that <code>ratsimp</code> is affected by some of the
flags which affect <code>ratexpand</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) sin (x/(x^2 + x)) = exp ((log(x) + 1)^2 - log(x)^2);
                                         2      2
                   x         (log(x) + 1)  - log (x)
(%o1)        sin(------) = %e
                  2
                 x  + x
(%i2) ratsimp (%);
                             1          2
(%o2)                  sin(-----) = %e x
                           x + 1
(%i3) ((x - 1)^(3/2) - (x + 1)*sqrt(x - 1))/sqrt((x - 1)*(x + 1));
                       3/2
                (x - 1)    - sqrt(x - 1) (x + 1)
(%o3)           --------------------------------
                     sqrt((x - 1) (x + 1))
(%i4) ratsimp (%);
                           2 sqrt(x - 1)
(%o4)                    - -------------
                                 2
                           sqrt(x  - 1)
(%i5) x^(a + 1/a), ratsimpexpons: true;
                               2
                              a  + 1
                              ------
                                a
(%o5)                        x
</pre></dd></dl>

<p><a name="ratsimpexpons"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratsimpexpons</b>
<a name="IDX845"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>ratsimpexpons</code> is <code>true</code>,
<code>ratsimp</code> is applied to the exponents of expressions during simplification.
</p>
</dd></dl>

<p><a name="radsubstflag"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>radsubstflag</b>
<a name="IDX846"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>

<p>Hat <code>radsubstflag</code> den Wert <code>true</code>, wird verhindert, dass die Funktion
<code>ratsubst</code> zum Beispiel <code>u</code> f&uuml;r <code>sqrt(x)</code> in <code>x</code> 
substituiert.
</p></dd></dl>

<p><a name="ratsubst"></a>
</p><dl>
<dt><u>Function:</u> <b>ratsubst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX847"></a>
</dt>
<dd><p>Substitutes <var>a</var> for <var>b</var> in <var>c</var> and returns the resulting expression.
<var>b</var> may be a sum, product, power, etc.
</p>
<p><code>ratsubst</code> knows something of the meaning of expressions
whereas <code>subst</code> does a purely syntactic substitution.
Thus <code>subst (a, x + y, x + y + z)</code> returns <code>x + y + z</code>
whereas <code>ratsubst</code> returns <code>z + a</code>.
</p>
<p>When <code>radsubstflag</code> is <code>true</code>,
<code>ratsubst</code> makes substitutions for radicals in expressions
which don't explicitly contain them.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) ratsubst (a, x*y^2, x^4*y^3 + x^4*y^8);
                              3      4
(%o1)                      a x  y + a
(%i2) cos(x)^4 + cos(x)^3 + cos(x)^2 + cos(x) + 1;
               4         3         2
(%o2)       cos (x) + cos (x) + cos (x) + cos(x) + 1
(%i3) ratsubst (1 - sin(x)^2, cos(x)^2, %);
            4           2                     2
(%o3)    sin (x) - 3 sin (x) + cos(x) (2 - sin (x)) + 3
(%i4) ratsubst (1 - cos(x)^2, sin(x)^2, sin(x)^4);
                        4           2
(%o4)                cos (x) - 2 cos (x) + 1
(%i5) radsubstflag: false$
(%i6) ratsubst (u, sqrt(x), x);
(%o6)                           x
(%i7) radsubstflag: true$
(%i8) ratsubst (u, sqrt(x), x);
                                2
(%o8)                          u
</pre></dd></dl>

<p><a name="ratvars"></a>
</p><dl>
<dt><u>Function:</u> <b>ratvars</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX848"></a>
</dt>
<dt><u>Function:</u> <b>ratvars</b><i> ()</i>
<a name="IDX849"></a>
</dt>
<dt><u>System variable:</u> <b>ratvars</b>
<a name="IDX850"></a>
</dt>
<dd><p>Declares main variables <var>x_1</var>, ..., <var>x_n</var> for rational expressions.
<var>x_n</var>, if present in a rational expression, is considered the main variable.
Otherwise, <var>x_[n-1]</var> is considered the main variable if present,
and so on through the preceding variables to <var>x_1</var>,
which is considered the main variable only if none of the succeeding variables are present.
</p>
<p>If a variable in a rational expression is not present in the <code>ratvars</code> list,
it is given a lower priority than <var>x_1</var>.
</p>
<p>The arguments to <code>ratvars</code> can be either variables or non-rational functions
such as <code>sin(x)</code>.
</p>
<p>The variable <code>ratvars</code> is a list of the arguments of 
the function <code>ratvars</code> when it was called most recently.
Each call to the function <code>ratvars</code> resets the list.
<code>ratvars ()</code> clears the list.
</p></dd></dl>

<p><a name="ratweight"></a>
</p><dl>
<dt><u>Function:</u> <b>ratweight</b><i> (<var>x_1</var>, <var>w_1</var>, &hellip;, <var>x_n</var>, <var>w_n</var>)</i>
<a name="IDX851"></a>
</dt>
<dt><u>Function:</u> <b>ratweight</b><i> ()</i>
<a name="IDX852"></a>
</dt>
<dd><p>Assigns a weight <var>w_i</var> to the variable <var>x_i</var>.
This causes a term to be replaced by 0 if its weight exceeds the
value of the variable <code>ratwtlvl</code> (default yields no truncation).
The weight of a term is the sum of the products of the
weight of a variable in the term times its power.
For example, the weight of <code>3 x_1^2 x_2</code> is <code>2 w_1 + w_2</code>.
Truncation according to <code>ratwtlvl</code> is carried out only when multiplying
or exponentiating canonical rational expressions (CRE).
</p>
<p><code>ratweight ()</code> returns the cumulative list of weight assignments.
</p>
<p>Note: The <code>ratfac</code> and <code>ratweight</code> schemes are incompatible and may not
both be used at the same time.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) ratweight (a, 1, b, 1);
(%o1)                     [a, 1, b, 1]
(%i2) expr1: rat(a + b + 1)$
(%i3) expr1^2;
                  2                  2
(%o3)/R/         b  + (2 a + 2) b + a  + 2 a + 1
(%i4) ratwtlvl: 1$
(%i5) expr1^2;
(%o5)/R/                  2 b + 2 a + 1
</pre></dd></dl>

<p><a name="ratweights"></a>
</p><dl>
<dt><u>System variable:</u> <b>ratweights</b>
<a name="IDX853"></a>
</dt>
<dd><p>Default value: <code>[]</code>
</p>
<p><code>ratweights</code> is the list of weights assigned by <code>ratweight</code>.
The list is cumulative:
each call to <code>ratweight</code> places additional items in the list.
</p>
<p><code>kill (ratweights)</code> and <code>save (ratweights)</code> both work as expected.
</p></dd></dl>

<p><a name="ratwtlvl"></a>
</p><dl>
<dt><u>Option variable:</u> <b>ratwtlvl</b>
<a name="IDX854"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>ratwtlvl</code> is used in combination with the <code>ratweight</code>
function to control the truncation of canonical rational expressions (CRE).
For the default value of <code>false</code>, no truncation occurs.
</p></dd></dl>

<p><a name="remainder"></a>
</p><dl>
<dt><u>Funktion:</u> <b>remainder</b><i> (<var>p_1</var>, <var>p_2</var>)</i>
<a name="IDX855"></a>
</dt>
<dt><u>Funktion:</u> <b>remainder</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX856"></a>
</dt>
<dd><p>Berechnet den Rest der Polynomdivision von <var>p_1</var> und <var>p_2</var> f&uuml;r die
Variable <var>x_n</var>.  Die anderen Variablen <var>x_1</var>, &hellip;, <var>x_n-1</var> haben
dieselbe Bedeutung wie f&uuml;r die Funktion <code><a href="#ratvars">ratvars</a></code>.
</p>

<p><code>remainder</code> gibt das zweite Element des Ergebnisses der Funktion
<code><a href="#divide">divide</a></code>
 zur&uuml;ck.
</p>
<p>Siehe auch die Funktion <code><a href="#quotient">quotient</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) poly1 : x^3-2*x^2-5*x+7;
                        3      2
(%o1)                  x  - 2 x  - 5 x + 7
(%i2) poly2 : x^2+1;
                              2
(%o2)                        x  + 1
(%i3) remainder(poly1, poly2, x);
(%o3)                        9 - 6 x
</pre></dd></dl>

<p><a name="resultant"></a>
</p><dl>
<dt><u>Funktion:</u> <b>resultant</b><i> (<var>p_1</var>, <var>p_2</var>, <var>x</var>)</i>
<a name="IDX857"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>resultant</b>
<a name="IDX858"></a>
</dt>
<dd>
<p>Berechnet die Resultante der Polynome <var>p_1</var> und <var>p_2</var> und eliminiert die
unabh&auml;ngige Variable <var>x</var>.  Die Resultante ist die Determinate der 
Sylvestermatrix f&uuml;r die beiden Polynome.  Das Ergebnis ist Null, wenn die
beiden Polynome <var>p_1</var> und <var>p_2</var> einen gemeinsamen Faktor haben.
</p>

<p>K&ouml;nnen die Polynome <var>p_1</var> oder <var>p_2</var> faktorisiert werden, kann es
von Vorteil sein, die Faktorisierung zuvor auszuf&uuml;hren.
</p>

<p>Die Optionsvariable <code>resultant</code> kontrolliert, welcher Algorithmus für die
Berechnung der Resultante von Maxima genutzt wird.  Die m&ouml;glichen Werte sind:
</p>
<dl compact="compact">
<dt> <code>subres</code></dt>
<dd><p>Subresultanten-Algorithmus
</p></dd>
<dt> <code>mod</code></dt>
<dd><p>Modularer Resultanten-Algorithmus
</p></dd>
<dt> <code>red</code></dt>
<dd><p>Reduzierter Subresultanten-Algorithmus
</p></dd>
</dl>


<p>Die Funktion <code><a href="#bezout">bezout</a></code>
 berechnet die Sylvestermatrix der Polynome
<var>p_1</var> und <var>p_2</var>.  Die Determinate der Sylvestermatrix ist die
Resultante.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) resultant(2*x^2+3*x+1, 2*x^2+x+1, x);
(%o1)                           8
(%i2) resultant(x+1, x+1, x);
(%o2)                           0
(%i3) resultant((x+1)*x, (x+1), x);
(%o3)                           0
(%i4) resultant(a*x^2+b*x+1, c*x + 2, x);
                         2
(%o4)                   c  - 2 b c + 4 a

(%i5) bezout(a*x^2+b*x+1, c*x+2, x);
                        [ 2 a  2 b - c ]
(%o5)                   [              ]
                        [  c      2    ]
(%i6) determinant(%);
(%o6)                   4 a - (2 b - c) c
</pre></dd></dl>

<p><a name="savefactors"></a>
</p><dl>
<dt><u>Option variable:</u> <b>savefactors</b>
<a name="IDX859"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>savefactors</code> is <code>true</code>, causes the factors of an
expression which is a product of factors to be saved by certain
functions in order to speed up later factorizations of expressions
containing some of the same factors.
</p></dd></dl>

<p><a name="showratvars"></a>
</p><dl>
<dt><u>Function:</u> <b>showratvars</b><i> (<var>expr</var>)</i>
<a name="IDX860"></a>
</dt>
<dd><p>Returns a list of the canonical rational expression (CRE) variables in 
expression <code>expr</code>.
</p>
<p>See also <code>ratvars</code>.
</p></dd></dl>


<p><a name="sqfr"></a>
</p><dl>
<dt><u>Function:</u> <b>sqfr</b><i> (<var>expr</var>)</i>
<a name="IDX861"></a>
</dt>
<dd><p>is similar to <code>factor</code> except that the polynomial factors are &quot;square-free.&quot;
That is, they have factors only of degree one.
This algorithm, which is also used by the first stage of <code>factor</code>, utilizes
the fact that a polynomial has in common with its n'th derivative all
its factors of degree greater than n.  Thus by taking greatest common divisors
with the polynomial of
the derivatives with respect to each variable in the polynomial, all
factors of degree greater than 1 can be found.
</p>
<p>Example:
</p>
<pre class="example">(%i1) sqfr (4*x^4 + 4*x^3 - 3*x^2 - 4*x - 1);
                                2   2
(%o1)                  (2 x + 1)  (x  - 1)
</pre></dd></dl>


<p><a name="tellrat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>tellrat</b><i> (<var>p_1</var>, &hellip;, <var>p_n</var>)</i>
<a name="IDX862"></a>
</dt>
<dt><u>Funktion:</u> <b>tellrat</b><i> ()</i>
<a name="IDX863"></a>
</dt>
<dd><p> Adds to the ring of algebraic integers known to Maxima the elements which are 
 the solutions of the polynomials <var>p_1</var>, ..., <var>p_n</var>.  Each argument 
 <var>p_i</var> is a polynomial with integer coefficients.
</p>
<p> <code>tellrat (<var>x</var>)</code> effectively means substitute 0 for <var>x</var> in 
 rational functions.
</p>
<p> <code>tellrat ()</code> returns a list of the current substitutions.
</p>
<p> <code>algebraic</code> must be set to <code>true</code> in order for the simplification 
 of algebraic integers to take effect.
</p>
<p> Maxima initially knows about the imaginary unit <code>%i</code> and all roots of 
 integers.
</p>
<p> There is a command <code>untellrat</code> which takes kernels and removes 
 <code>tellrat</code> properties.
</p>
<p> When <code>tellrat</code>'ing a multivariate polynomial, e.g., 
 <code>tellrat (x^2 - y^2)</code>, there would be an ambiguity as to whether to 
 substitute <code><var>y</var>^2</code> for <code><var>x</var>^2</code> or vice versa.  Maxima 
 picks a particular ordering, but if the user wants to specify which, e.g.
 <code>tellrat (y^2 = x^2)</code> provides a syntax which says replace
 <code><var>y</var>^2</code> by <code><var>x</var>^2</code>.
</p>


<p>Beispiele:
</p>
<pre class="example">(%i1) 10*(%i + 1)/(%i + 3^(1/3));
                           10 (%i + 1)
(%o1)                      -----------
                                  1/3
                            %i + 3
(%i2) ev (ratdisrep (rat(%)), algebraic);
             2/3      1/3              2/3      1/3
(%o2)    (4 3    - 2 3    - 4) %i + 2 3    + 4 3    - 2
(%i3) tellrat (1 + a + a^2);
                            2
(%o3)                     [a  + a + 1]
(%i4) 1/(a*sqrt(2) - 1) + a/(sqrt(3) + sqrt(2));
                      1                 a
(%o4)           ------------- + -----------------
                sqrt(2) a - 1   sqrt(3) + sqrt(2)
(%i5) ev (ratdisrep (rat(%)), algebraic);
         (7 sqrt(3) - 10 sqrt(2) + 2) a - 2 sqrt(2) - 1
(%o5)    ----------------------------------------------
                               7
(%i6) tellrat (y^2 = x^2);
                        2    2   2
(%o6)                 [y  - x , a  + a + 1]
</pre></dd></dl>

<p><a name="totaldisrep"></a>
</p><dl>
<dt><u>Funktion:</u> <b>totaldisrep</b><i> (<var>expr</var>)</i>
<a name="IDX864"></a>
</dt>
<dd>
<p>Konvertiert alle Teilausdr&uuml;cke im Ausdruck <var>expr</var> von der CRE-Form in die
allgemeine Form und gibt das Ergebnis zur&uuml;ck.  Ist <var>expr</var> selbst eine
CRE-Form, dann entspricht <code>totaldisrep</code> der Funktion <code>ratdisrep</code>.
</p>

<p><code>totaldisrep</code> ist insbesondere hilfreich, wenn Gleichungen, Listen oder
Matrizen in eine allgmeine Form zu konvertieren sind.
</p>
</dd></dl>

<p><a name="untellrat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>untellrat</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX865"></a>
</dt>
<dd>
<p>Entfernt Eigenschaften von den Symbolen <var>x_1</var>, &hellip;, <var>x_n</var>, die mit
der Funktion <code>tellrat</code> zugewiesen wurden.
</p>
</dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC111" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_18.html#SEC114" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_75.html#SEC385" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>April, 4 2011</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
