<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 2 2008 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 48. draw</title>

<meta name="description" content="Manual de Maxima: 48. draw">
<meta name="keywords" content="Manual de Maxima: 48. draw">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="draw"></a>
<a name="SEC185"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_47.html#SEC184" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC186" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_47.html#SEC181" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 48. draw </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC186">48.1 Introducci&oacute;n a draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC187">48.2 Funciones y variables para draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC188">48.3 Funciones y variables para picture</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC189">48.4 Funciones y variables para worldmap</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>





<hr size="6">
<a name="Introducci_00f3n-a-draw"></a>
<a name="SEC186"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC185" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC187" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC185" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.1 Introducci&oacute;n a draw </h2>


<p><code>draw</code> es un interfaz para comunicar Maxima con Gnuplot.
</p>
<p>Tres son las funciones principales a utilizar a nivel de Maxima: 
<code>draw2d</code>, <code>draw3d</code> y <code>draw</code>.
</p>
<p>S&iacute;gase este enlace para ver ejemplos m&aacute;s elaborados
de este paquete:
</p>
<p><a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw">http://www.telefonica.net/web2/biomates/maxima/gpdraw</a>
</p>
<p>Se necesita tener instalado Gnuplot 4.2 para ejecutar este paquete.
</p>




<hr size="6">
<a name="Funciones-y-variables-para-draw"></a>
<a name="SEC187"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC186" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC188" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC185" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.2 Funciones y variables para draw </h2>




<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xrange</b>
<a name="IDX1753"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>xrange</code> vale <code>auto</code>, el rango de la coordenada <var>x</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>x</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>xrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [-3,5],
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>yrange</code> y <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yrange</b>
<a name="IDX1754"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>yrange</code> vale <code>auto</code>, el rango de la coordenada <var>y</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>y</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>yrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [-2,3],
             explicit(x^2,x,-1,1),
             xrange = [-3,3])$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xrange</code> y <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zrange</b>
<a name="IDX1755"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Cuando <code>zrange</code> vale <code>auto</code>, el rango de la coordenada <var>z</var>
se calcula de forma autom&aacute;tica.
</p>
<p>Si el usuario quiere especificar un intervalo para <var>z</var>, &eacute;ste debe
expresarse como una lista de Maxima, como en <code>zrange=[-2, 3]</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(yrange = [-3,3],
             zrange = [-2,5],
             explicit(x^2+y^2,x,-1,1,y,-1,1),
             xrange = [-3,3])$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xrange</code> y <code>yrange</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logx</b>
<a name="IDX1756"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logx</code> vale <code>true</code>, el eje <var>x</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(log(x),x,0.01,5),
             logx = true)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>logy</code> y <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logy</b>
<a name="IDX1757"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logy</code> vale <code>true</code>, el eje <var>y</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(logy = true,
             explicit(exp(x),x,0,5))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>logx</code> y <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>logz</b>
<a name="IDX1758"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>logz</code> vale <code>true</code>, el eje <var>z</var> se dibujar&aacute;
en la escala logar&iacute;tmica.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(logz = true,
             explicit(exp(u^2+v^2),u,-2,2,v,-2,2))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>logx</code> y <code>logy</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>terminal</b>
<a name="IDX1759"></a>
</dt>
<dd><p>Valor por defecto: <code>screen</code>
</p>
<p>Selecciona el terminal a utilizar por Gnuplot; valores posibles son:
<code>screen</code> (por defecto), <code>png</code>, <code>jpg</code>, <code>eps</code>, <code>eps_color</code>,
<code>pdf</code>, <code>pdfcairo</code>, <code>gif</code>, <code>animated_gif</code>, <code>wxt</code> y <code>aquaterm</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>pdfcairo necesita Gnuplot 4.3. Actualmente (Nov 2008) Gnuplot 4.3 es una versi&oacute;n en desarrollo.
pdf necesita que Gnuplot 4.2/4.3 haya sido compilado con la opci&oacute;n <code>--enable-pdf</code> y libpdf debe
estar instalado (<a href="http://www.pdflib.com/en/download/pdflib-family/pdflib-lite/">http://www.pdflib.com/en/download/pdflib-family/pdflib-lite/</a>).
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) /* screen terminal (default) */
      draw2d(explicit(x^2,x,-1,1))$
(%i3) /* png file */
      draw2d(terminal  = 'png,
             pic_width = 300,
             explicit(x^2,x,-1,1))$
(%i4) /* jpg file */
      draw2d(terminal   = 'jpg,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
(%i5) /* eps file */
      draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'eps)$
(%i6) /* pdf file */
      draw2d(file_name = &quot;mypdf&quot;,
             pdf_width = 12.0,
             pdf_height = 8.0,
             explicit(x^2,x,-1,1),
             terminal  = 'pdf)$
(%i7) /* wxwidgets window */
      draw2d(explicit(x^2,x,-1,1),
             terminal  = 'wxt)$
</pre>
<p>Un fichero gif animado,
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>La opci&oacute;n <code>delay</code> s&oacute;lo se activa en caso de gifs animados; se ignora en
cualquier otro caso.
</p>
<p>V&eacute;anse tambi&eacute;n <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code> y <code>delay</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>font</b>
<a name="IDX1760"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>Esta opci&oacute;n permite seleccionar el tipo de fuente a utilizar por el
terminal. S&oacute;lo se puede utilizar un tipo de fuente y tama&ntilde;o por
gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>V&eacute;ase tambi&eacute;n <code>font_size</code>.
</p>
<p>Gnuplot no puede gestionar por s&iacute; mismo las fuentes,
dejando esta tarea a las librer&iacute;as que dan soporte a los
diferentes terminales, cada uno con su propia manera de controlar
la tipograf&iacute;a. A continuaci&oacute;n un breve resumen:
</p>
<ul>
<li>
<i>x11</i>:
Utiliza el mecanismo habitual para suministrar las fuentes en x11.

<p>Ejemplo:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(font      = &quot;Arial&quot;, 
             font_size = 20,
             label([&quot;Arial font, size 20&quot;,1,1]))$
</pre>
</li><li>
<i>windows</i>:
El terminal de windows no permite cambiar fuentes desde dentro
del gr&aacute;fico. Una vez se ha creado el gr&aacute;fico, se pueden cambiar las
fuentes haciendo clic derecho en el men&uacute; de la ventana gr&aacute;fica.

</li><li>
<i>png, jpeg, gif</i>:
La librer&iacute;a <i>libgd</i> utiliza la ruta a las fuentes
almacenada en la variable de entorno <code>GDFONTPATH</code>; en tal caso
s&oacute;lo es necesario darle a la opci&oacute;n <code>font</code> el nombre de la
fuente. Tambi&eacute;n es posible darle la ruta completa al fichero de la fuente.

<p>Ejemplos:
</p>
<p>A la opci&oacute;n <code>font</code> se le puede dar la ruta completa al fichero de la fuente:
</p><pre class="example">(%i1) load(draw)$
(%i2) path: &quot;/usr/share/fonts/truetype/freefont/&quot; $
(%i3) file: &quot;FreeSerifBoldItalic.ttf&quot; $
(%i4) draw2d(
        font      = concat(path, file), 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre>
<p>Si la variable de entorno <code>GDFONTPATH</code> almacena la ruta
a la carpeta donde se alojan las fuentes, es posible darle a la
opci&oacute;n <code>font</code> s&oacute;lo el nombre de la fuente:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        font      = &quot;FreeSerifBoldItalic&quot;, 
        font_size = 20,
        color     = red,
        label([&quot;FreeSerifBoldItalic font, size 20&quot;,1,1]),
        terminal  = png)$
</pre>
</li><li>
<i>Postscript</i>:
Las fuentes est&aacute;ndar de Postscript son: <code>&quot;Times-Roman&quot;</code>, <code>&quot;Times-Italic&quot;</code>, <code>&quot;Times-Bold&quot;</code>, <code>&quot;Times-BoldItalic&quot;</code>, <code>&quot;Helvetica&quot;</code>, <code>&quot;Helvetica-Oblique&quot;</code>, <code>&quot;Helvetica-Bold&quot;</code>, <code>&quot;Helvetic-BoldOblique&quot;</code>, <code>&quot;Courier&quot;</code>, <code>&quot;Courier-Oblique&quot;</code>, <code>&quot;Courier-Bold&quot;</code> y <code>&quot;Courier-BoldOblique&quot;</code>.
  
<p>Ejemplo:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        font      = &quot;Courier-Oblique&quot;, 
        font_size = 15,
        label([&quot;Courier-Oblique font, size 15&quot;,1,1]),
        terminal = eps)$
</pre>
</li><li>
<i>pdf</i>:
Utiliza las mismas fuentes que <i>Postscript</i>.

</li><li>
<i>pdfcairo</i>:
Utiliza las mismas fuentes que <i>wxt</i>.

</li><li>
<i>wxt</i>:
La librer&iacute;a <i>pango</i> encuentra las fuentes por medio de la utilidad <code>fontconfig</code>.

</li><li>
<i>aqua</i>:
La fuente por defecto es <code>&quot;Times-Roman&quot;</code>.
</li></ul>

<p>La documentaci&oacute;n de gnuplot es una importante fuente de informaci&oacute;n sobre terminales y fuentes.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>font_size</b>
<a name="IDX1761"></a>
</dt>
<dd><p>Valor por defecto: 12
</p>
<p>Esta opci&oacute;n permite seleccionar el tama&ntilde;o de la fuente a utilizar por el
terminal. S&oacute;lo se puede utilizar un tipo de fuente y tama&ntilde;o por
gr&aacute;fico. <code>font_size</code> s&oacute;lo se activa cuando la opci&oacute;n <code>font</code>
tiene un valor diferente de la cadena vac&iacute;a.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>V&eacute;ase tambi&eacute;n <code>font</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>grid</b>
<a name="IDX1762"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>grid</code> vale <code>true</code>, se dibujar&aacute; una rejilla sobre el
plano <var>xy</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(grid = true,
             explicit(exp(u),u,-2,2))$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>title</b>
<a name="IDX1763"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>title</code> almacena una cadena con el 
t&iacute;tulo de la escena. Por defecto, no se escribe
t&iacute;tulo alguno.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(u),u,-2,2),
             title = &quot;Exponential function&quot;)$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xlabel</b>
<a name="IDX1764"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>xlabel</code> almacena una cadena con la
etiqueta del eje <var>x</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             explicit(exp(u),u,-2,2),
             ylabel = &quot;Population&quot;)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>ylabel</code> y <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ylabel</b>
<a name="IDX1765"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>ylabel</code> almacena una cadena con la
etiqueta del eje <var>y</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             ylabel = &quot;Population&quot;,
             explicit(exp(u),u,-2,2) )$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xlabel</code> y <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zlabel</b>
<a name="IDX1766"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>La opci&oacute;n <code>zlabel</code> almacena una cadena con la
etiqueta del eje <var>z</var>. Por defecto, el eje no tiene etiqueta.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(zlabel = &quot;Z variable&quot;,
             ylabel = &quot;Y variable&quot;,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2),
             xlabel = &quot;X variable&quot; )$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xlabel</code> y <code>ylabel</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xtics</b>
<a name="IDX1767"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opci&oacute;n gr&aacute;fica controla la forma en la que se dibujar&aacute;n las marcas
del eje <var>x</var>.
</p>
<ul>
<li>
Cuando a <code>xtics</code> se le da el valor <var>auto</var>, las marcas se dibujar&aacute;n de
forma autom&aacute;tica.

</li><li>
Cuando a <code>xtics</code> se le da el valor <var>none</var>, no habr&aacute; marcas en los ejes.

</li><li>
Cuando a <code>xtics</code> se le da un valor num&eacute;rico positivo, se interpretar&aacute; como la
distancia entre dos marcas consecutivas.

</li><li>
Cuando a <code>xtics</code> se le da una lista de longitud tres de la forma 
<code>[start,incr,end]</code>, las marcas se dibujar&aacute;n desde <code>start</code> 
hasta <code>end</code> a intervalos de longitud <code>incr</code>.

</li><li>
Cuando a <code>xtics</code> se le da un conjunto de n&uacute;meros de la forma
<code>{n1, n2, ...}</code>, las marcas se dibujar&aacute;n exactamente en los valores
<code>n1</code>, <code>n2</code>, ...

</li><li>
Cuando a <code>xtics</code> se le da un conjunto de pares de la forma
<code>{[&quot;label1&quot;, n1], [&quot;label2&quot;, n2], ...}</code>, las marcas correspondientes a los valores
<code>n1</code>, <code>n2</code>, ... se etiquetar&aacute;n con <code>&quot;label1&quot;</code>, <code>&quot;label2&quot;</code>, ..., respectivamente.
</li></ul>

<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<p>Marcas desactivadas.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = 'none,
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Marcas cada 1/4 unidades.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = 1/4,
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Marcas desde -3/4 hasta 3/4 en saltos de 1/8.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = [-3/4,1/8,3/4],
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Marcas en los puntos -1/2, -1/4 y 3/4.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = {-1/2,-1/4,3/4},
             explicit(x^3,x,-1,1)  )$
</pre>
<p>Marcas etiquetadas.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xtics = {[&quot;High&quot;,0.75],[&quot;Medium&quot;,0],[&quot;Low&quot;,-0.75]},
             explicit(x^3,x,-1,1)  )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ytics</b>
<a name="IDX1768"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opci&oacute;n gr&aacute;fica controla la forma en la que se dibujar&aacute;n las marcas
del eje <var>y</var>.
</p>
<p>V&eacute;ase <code>xtics</code> para una descripci&oacute;n completa.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ztics</b>
<a name="IDX1769"></a>
</dt>
<dd><p>Valor por defecto: <code>auto</code>
</p>
<p>Esta opci&oacute;n gr&aacute;fica controla la forma en la que se dibujar&aacute;n las marcas
del eje <var>z</var>.
</p>
<p>V&eacute;ase <code>xtics</code> para una descripci&oacute;n completa.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xtics_rotate</b>
<a name="IDX1770"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_rotate</code> vale <code>true</code>, las marcas del eje <var>x</var> se giran 
90 grados.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ytics_rotate</b>
<a name="IDX1771"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_rotate</code> vale <code>true</code>, las marcas del eje <var>y</var> se giran 
90 grados.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ztics_rotate</b>
<a name="IDX1772"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ztics_rotate</code> vale <code>true</code>, las marcas del eje <var>z</var> se giran 
90 grados.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xtics_axis</b>
<a name="IDX1773"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xtics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>x</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ytics_axis</b>
<a name="IDX1774"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ytics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>y</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ztics_axis</b>
<a name="IDX1775"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>ztics_axis</code> vale <code>true</code>, las marcas y sus etiquetas se dibujan sobre
el propio eje <var>z</var>, si vale <code>false</code> las marcas se colocan a lo largo del borde
del gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xaxis</b>
<a name="IDX1776"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>xaxis</code> vale <code>true</code>, se dibujar&aacute; el eje <var>x</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = blue)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xaxis_width</code>, <code>xaxis_type</code> y <code>xaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xaxis_width</b>
<a name="IDX1777"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>xaxis_width</code> es el ancho del eje <var>x</var>.
Su valor debe ser un n&uacute;mero positivo.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_width = 3)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xaxis</code>, <code>xaxis_type</code> y <code>xaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xaxis_type</b>
<a name="IDX1778"></a>
</dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>xaxis_type</code> indica c&oacute;mo se debe dibujar el eje <var>x</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_type  = solid)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xaxis</code>, <code>xaxis_width</code> y <code>xaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xaxis_color</b>
<a name="IDX1779"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>xaxis_color</code> especifica el color para el eje <var>x</var>. V&eacute;ase
<code>color</code> para ver c&oacute;mo se definen los colores.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             xaxis       = true,
             xaxis_color = red)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>xaxis</code>, <code>xaxis_width</code> y <code>xaxis_type</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yaxis</b>
<a name="IDX1780"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>yaxis</code> vale <code>true</code>, se dibujar&aacute; el eje <var>y</var>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = blue)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>yaxis_width</code>, <code>yaxis_type</code> y <code>yaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yaxis_width</b>
<a name="IDX1781"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>yaxis_width</code> es el ancho del eje <var>y</var>.
Su valor debe ser un n&uacute;mero positivo.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_width = 3)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>yaxis</code>, <code>yaxis_type</code> y <code>yaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yaxis_type</b>
<a name="IDX1782"></a>
</dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>yaxis_type</code> indica c&oacute;mo se debe dibujar el eje <var>y</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_type  = solid)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>yaxis</code>, <code>yaxis_width</code> y <code>yaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yaxis_color</b>
<a name="IDX1783"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>yaxis_color</code> especifica el color para el eje <var>y</var>. V&eacute;ase
<code>color</code> para ver c&oacute;mo se definen los colores.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^3,x,-1,1),
             yaxis       = true,
             yaxis_color = red)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>yaxis</code>, <code>yaxis_width</code> y <code>yaxis_type</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zaxis</b>
<a name="IDX1784"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>zaxis</code> vale <code>true</code>, se dibujar&aacute; el eje <var>z</var> en
escenas 3D. Esta opci&oacute;n no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = blue)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>zaxis_width</code>, <code>zaxis_type</code> y <code>zaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zaxis_width</b>
<a name="IDX1785"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>zaxis_width</code> es el ancho del eje <var>z</var>.
Su valor debe ser un n&uacute;mero positivo. Esta opci&oacute;n no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_width = 3)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>zaxis</code>, <code>zaxis_type</code> y <code>zaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zaxis_type</b>
<a name="IDX1786"></a>
</dt>
<dd><p>Valor por defecto: <code>dots</code>
</p>
<p><code>zaxis_type</code> indica c&oacute;mo se debe dibujar el eje <var>z</var>; 
valores admisibles son <code>solid</code> y <code>dots</code>.
Esta opci&oacute;n no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>zaxis</code>, <code>zaxis_width</code> y <code>zaxis_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>zaxis_color</b>
<a name="IDX1787"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>zaxis_color</code> especifica el color para el eje <var>z</var>. V&eacute;ase
<code>color</code> para ver c&oacute;mo se definen los colores.
Esta opci&oacute;n no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1),
             zaxis       = true,
             zaxis_type  = solid,
             zaxis_color = red)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>zaxis</code>, <code>zaxis_width</code> y <code>zaxis_type</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>xyplane</b>
<a name="IDX1788"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Coloca el plano-xy en escenas 3D. Si <code>xyplane</code> vale <code>false</code>,
el plano-xy se coloca autom&aacute;ticamente; en cambio, si toma un
valor real, el plano-xy intersectar&aacute; con el eje <var>z</var> a ese nivel.
Esta opci&oacute;n no tiene efecto alguno en escenas 2D.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xyplane = %e-2,
             explicit(x^2+y^2,x,-1,1,y,-1,1))$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>rot_vertical</b>
<a name="IDX1789"></a>
</dt>
<dd><p>Valor por defecto: 60
</p>
<p><code>rot_vertical</code> es el &aacute;ngulo (en grados) de la rotaci&oacute;n vertical
(alrededor del eje <var>x</var>) para situar el punto del observador en las
escenas 3d.
</p>
<p>El &aacute;ngulo debe pertenecer al intervalo <em>[0, 180]</em>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>rot_horizontal</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>rot_horizontal</b>
<a name="IDX1790"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>rot_horizontal</code> es el &aacute;ngulo (en grados) de la rotaci&oacute;n horizontal
(alrededor del eje <var>z</var>) para situar el punto del observador en las
escenas 3d.
</p>
<p>El &aacute;ngulo debe pertenecer al intervalo <em>[0, 360]</em>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             rot_horizontal = 360,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>rot_vertical</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xy_file</b>
<a name="IDX1791"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p><code>xy_file</code> es el nombre del fichero donde se almacenar&aacute;n las
coordenadas despu&eacute;s de hacer clic con el bot&oacute;n del rat&oacute;n en un
punto de la imagen y pulsado la tecla 'x'. Por defecto, las 
coordenadas no se almacenan.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>user_preamble</b>
<a name="IDX1792"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p>Usuarios expertos en Gnuplot pueden hacer uso de esta opci&oacute;n para
afinar el comportamiento de Gnuplot escribiendo c&oacute;digo que ser&aacute;
enviado justo antes de la instrucci&oacute;n <code>plot</code> o <code>splot</code>.
</p>
<p>El valor dado a esta opci&oacute;n debe ser una cadena alfanum&eacute;rica o
una lista de cadenas (una por l&iacute;nea).
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<p>El terminal <i>dumb</i> no est&aacute; soportado por el paquete <code>draw</code>,
pero es posible activarlo haciendo uso de la opci&oacute;n <code>user_preamble</code>,
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x)-1,x,-1,1),
             parametric(cos(u),sin(u),u,0,2*%pi),
             user_preamble=&quot;set terminal dumb&quot;)$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>file_name</b>
<a name="IDX1793"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;maxima_out&quot;</code>
</p>
<p><code>file_name</code> es el nombre del fichero en el que los terminales <code>png</code>, 
<code>jpg</code>, <code>eps</code>, <code>pdf</code> and <code>pdfcairo</code> y <code>eps_color</code>
guardar&aacute;n el gr&aacute;fico.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'png)$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>pic_width</code> y <code>pic_height</code>.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>delay</b>
<a name="IDX1794"></a>
</dt>
<dd><p>Valor por defecto: 5
</p>
<p>Este es el retraso en cent&eacute;simas de segundo entre im&aacute;genes
en los ficheros gif animados.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>La opci&oacute;b <code>delay</code> s&oacute;lo se activa en caso de gifs animados; se ignora en
cualquier otro caso.
</p>
<p>See also <code>terminal</code>, <code>pic_width</code>, and <code>pic_height</code>.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pic_width</b>
<a name="IDX1795"></a>
</dt>
<dd><p>Valor por defecto: 640
</p>
<p><code>pic_width</code> es la anchura del fichero de imagen de bits generado por
los terminales <code>png</code> y <code>jpg</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pic_height</b>
<a name="IDX1796"></a>
</dt>
<dd><p>Valor por defecto: 640
</p>
<p><code>pic_height</code> es la altura del fichero de imagen de bits generado por
los terminales <code>png</code> y <code>jpg</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pic_width</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>eps_width</b>
<a name="IDX1797"></a>
</dt>
<dd><p>Valor por defecto: 12
</p>
<p><code>eps_width</code> es el ancho (medido en cm) del archivo Postscript
generado por los terminales <code>eps</code> y <code>eps_color</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>eps_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>eps_height</b>
<a name="IDX1798"></a>
</dt>
<dd><p>Valor por defecto: 8
</p>
<p><code>eps_height</code> es la altura (medida en cm) del archivo Postscript
generado por los terminales <code>eps</code> y <code>eps_color</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>eps_width</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pdf_width</b>
<a name="IDX1799"></a>
</dt>
<dd><p>Valor por defecto: 21.0 (ancho A4)
</p>
<p>Es el ancho (medida en cm) del documento PDF generado por los
terminales <code>pdf</code> y <code>pdfcairo</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'pdf,
             pdf_width  = 3.0,
             pdf_height = 3.0,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pdf_height</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>pdf_height</b>
<a name="IDX1800"></a>
</dt>
<dd><p>Valor por defecto: 29.7 (alto A4)
</p>
<p>Es el alto (medida en cm) del documento PDF generado por los
terminales <code>pdf</code> y <code>pdfcairo</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'pdf,
             pdf_width  = 3.0,
             pdf_height = 3.0,
             explicit(x^2,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>terminal</code>, <code>file_name</code> y <code>pdf_width</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_bottom</b>
<a name="IDX1801"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_bottom</code> vale <code>true</code>, el eje inferior permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_bottom = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>axis_left</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_left</b>
<a name="IDX1802"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_left</code> vale <code>true</code>, el eje izquierdo permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_left = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_top</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_top</b>
<a name="IDX1803"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_top</code> vale <code>true</code>, el eje superior permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_top = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_right</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_right</b>
<a name="IDX1804"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_right</code> vale <code>true</code>, el eje derecho permanece visible en las escenas 2d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_right = false,
             explicit(x^3,x,-1,1))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>axis_3d</b>
<a name="IDX1805"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>axis_3d</code> vale <code>true</code>, los ejes <var>x</var>, <var>y</var> y <var>z</var>
permanecen visibles en las escenas 3d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(axis_3d = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code> y <code>axis_right</code> for axis in 2d.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>palette</b>
<a name="IDX1806"></a>
</dt>
<dd><p>Valor por defecto: <code>color</code>
</p>
<p><code>palette</code> indica c&oacute;mo transformar los valores reales de una
matriz pasada al objeto <code>image</code> en componentes crom&aacute;ticas.
</p>
<p><code>palette</code> es un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
&iacute;ndice para seleccionar una f&oacute;rmula que transforma los niveles
num&eacute;ricos en las componentes crom&aacute;ticas rojo, verde y azul:
</p><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre><p>los n&uacute;meros negativos se interpretan como colores invertidos
de las componentes crom&aacute;ticas.
</p>
<p><code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>colorbox</code>.
</p></dd></dl>




<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>colorbox</b>
<a name="IDX1807"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>colorbox</code> vale <code>true</code>, se dibuja una escala de color al
lado de los objetos <code>image</code>.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) im: apply('matrix,
                 makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
(%i4) draw2d(colorbox=false, image(im,0,0,30,30))$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>palette</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>enhanced3d</b>
<a name="IDX1808"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>enhanced3d</code> vale <code>false</code>, no se colorear&aacute;n las superficies
de los gr&aacute;ficos tridimensionales. Si <code>enhanced3d</code> vale <code>true</code>,
las superficies se colorear&aacute;n activando el modo pm3d de Gnuplot.
Si se da una expresi&oacute;n a <code>enhanced3d</code>, &eacute;sta se utilizar&aacute;
para asignar colores de acuerdo con el valor de la opci&oacute;n <code>palette</code>;
las variables de esta expresi&oacute;n deben ser las mismas que luego se
utilicen para la descripci&oacute;n de la superficie.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(
         surface_hide = true,
         enhanced3d   = true,
         palette      = gray,
         explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
(%i3) draw3d(
         surface_hide = true,
         /* mismas variables x e y que */
         /* en explicit mas abajo:     */
         enhanced3d   = sin(x*y),
         explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>meshed_surface</b>
<a name="IDX1809"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La opci&oacute;n <code>meshed_surface</code> s&oacute;lo tiene efecto cuando la opci&oacute;n
<code>enhanced3d</code> no es <code>false</code>. En tal caso, si <code>meshed_surface</code> 
vale tambi&eacute;n <code>false</code>, solamente se dibujar&aacute; la superficie coloreada. Si su
valor es <code>true</code>, entonces se dibujar&aacute;n tanto la superficie coloreada
como las l&iacute;neas de la malla.
</p>
<p>Solamente las funciones <code>explicit</code> en 3d y los objetos <code>parametric_surface</code>
se ven afectados por esta opci&oacute;n.
</p>
<p>V&eacute;ase tambi&eacute;n <code>enhanced3d</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d (
         enhanced3d     = true,
         color          = green,
         meshed_surface = true,
         explicit(x^2+y^2, x,-2,2,y,-2,2)) $
(%i3) draw3d (
         enhanced3d     = true,
         surface_hide   = true,
         color          = green,
         meshed_surface = true,
         parametric_surface(x^2,y,x+y, x,-2,2,y,-2,2)) $
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>point_size</b>
<a name="IDX1810"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_size</code> establece el tama&ntilde;o de los puntos dibujados. Debe
ser un n&uacute;mero no negativo.
</p>
<p>Esta opci&oacute;n no tiene efecto alguno cuando a la opci&oacute;n gr&aacute;fica
<code>point_type</code> se le ha dado el valor <code>dot</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        points(makelist([random(20),random(50)],k,1,10)),
        point_size = 5,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>point_type</b>
<a name="IDX1811"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>point_type</code> indica c&oacute;mo se van a dibujar los puntos aislados. Los valores
para esta opci&oacute;n pueden ser &iacute;ndices enteros mayores o iguales que -1,
o tambi&eacute;n nombres de estilos: <code>$none</code> (-1), <code>dot</code> (0), <code>plus</code> (1),
<code>multiply</code> (2), <code>asterisk</code> (3), <code>square</code> (4), <code>filled_square</code> (5),
<code>circle</code> (6), <code>filled_circle</code> (7), <code>up_triangle</code> (8), 
<code>filled_up_triangle</code> (9), <code>down_triangle</code> (10), 
<code>filled_down_triangle</code> (11), <code>diamant</code> (12) y <code>filled_diamant</code> (13).
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [0,10],
             yrange = [0,10],
             point_size = 3,
             point_type = diamant,
             points([[1,1],[5,1],[9,1]]),
             point_type = filled_down_triangle,
             points([[1,2],[5,2],[9,2]]),
             point_type = asterisk,
             points([[1,3],[5,3],[9,3]]),
             point_type = filled_diamant,
             points([[1,4],[5,4],[9,4]]),
             point_type = 5,
             points([[1,5],[5,5],[9,5]]),
             point_type = 6,
             points([[1,6],[5,6],[9,6]]),
             point_type = filled_circle,
             points([[1,7],[5,7],[9,7]]),
             point_type = 8,
             points([[1,8],[5,8],[9,8]]),
             point_type = filled_diamant,
             points([[1,9],[5,9],[9,9]]) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>points_joined</b>
<a name="IDX1812"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>points_joined</code> vale <code>true</code>, los puntos se unen con segmentos;
si vale <code>false</code>, se dibujar&aacute;n puntos aislados. Un tercer valor posible
para esta opci&oacute;n gr&aacute;fica es <code>impulses</code>; en tal caso, se dibujar&aacute;n
segmentos verticales desde los puntos hasta el eje-x (2D) o hasta el plano-xy (3D).
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange        = [0,10],
             yrange        = [0,4],
             point_size    = 3,
             point_type    = up_triangle,
             color         = blue,
             points([[1,1],[5,1],[9,1]]),
             points_joined = true,
             point_type    = square,
             line_type     = dots,
             points([[1,2],[5,2],[9,2]]),
             point_type    = circle,
             color         = red,
             line_width    = 7,
             points([[1,3],[5,3],[9,3]]) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>filled_func</b>
<a name="IDX1813"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La opci&oacute;n <code>filled_func</code> establece c&oacute;mo se van a rellenar las regiones
limitadas por funciones. Si <code>filled_func</code> vale <code>true</code>, la
regi&oacute;n limitada por la funci&oacute;n definida en el objeto <code>explicit</code>
y el borde inferior del la ventana gr&aacute;fica se rellena con <code>fill_color</code>.
Si <code>filled_func</code> guarda la expresi&oacute;n de una funci&oacute;n, entonces la
regi&oacute;n limitada por esta funci&oacute;n y la definida en el objeto <code>explicit</code>
ser&aacute; la que se rellene. Por defecto, las funciones expl&iacute;citas
no se rellenan.
</p>
<p>Esta opci&oacute;n s&oacute;lo afecta al objeto gr&aacute;fico bidimensional <code>explicit</code>.
</p>
<p>Ejemplo:
</p>
<p>Regi&oacute;n limitada por un objeto <code>explicit</code> y el borde inferior
de la ventana gr&aacute;fica.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             filled_func = true,
             explicit(sin(x),x,0,10) )$
</pre>
<p>Regi&oacute;n limitada por un objeto <code>explicit</code> y la funci&oacute;n
definida en la opci&oacute;n <code>filled_func</code>. N&oacute;tese que la 
variable en <code>filled_func</code> debe ser la misma que la utilizada en 
<code>explicit</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = grey,
             filled_func = sin(x),
             explicit(-sin(x),x,0,%pi));
</pre>
<p>V&eacute;anse tambi&eacute;n <code>fill_color</code> y <code>explicit</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>transparent</b>
<a name="IDX1814"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>transparent</code> vale <code>true</code>, las regiones internas de 
los pol&iacute;gonos se rellenan de acuerdo con <code>fill_color</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(polygon([[3,2],[7,2],[5,5]]),
             transparent = true,
             color       = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>border</b>
<a name="IDX1815"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>border</code> vale <code>true</code>, los bordes de los
pol&iacute;gonos se dibujan de acuerdo con <code>line_type</code> y
<code>line_width</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code> y <code>ellipse</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(color       = brown,
             line_width  = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_both</b>
<a name="IDX1816"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>head_both</code> vale <code>true</code>, los vectores se dibujan bidireccionales.
Si vale <code>false</code>, se dibujan unidireccionales.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,8],
             yrange      = [0,8],
             head_length = 0.7,
             vector([1,1],[6,0]),
             head_both   = true,
             vector([1,7],[6,0]) )$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>head_length</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_length</b>
<a name="IDX1817"></a>
</dt>
<dd><p>Valor por defecto: 2
</p>
<p><code>head_length</code> indica, en las unidades del eje <var>x</var>, la
longitud de las flechas de los vectores.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,8],
             vector([0,1],[5,5]),
             head_length = 1,
             vector([2,1],[5,5]),
             head_length = 0.5,
             vector([4,1],[5,5]),
             head_length = 0.25,
             vector([6,1],[5,5]))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_angle</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_angle</b>
<a name="IDX1818"></a>
</dt>
<dd><p>Valor por defecto: 45
</p>
<p><code>head_angle</code> indica el &aacute;ngulo, en grados, entre la flecha y el
segmento del vector.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,10],
             yrange      = [0,9],
             head_length = 0.7,
             head_angle  = 10,
             vector([1,1],[0,6]),
             head_angle  = 20,
             vector([2,1],[0,6]),
             head_angle  = 30,
             vector([3,1],[0,6]),
             head_angle  = 40,
             vector([4,1],[0,6]),
             head_angle  = 60,
             vector([5,1],[0,6]),
             head_angle  = 90,
             vector([6,1],[0,6]),
             head_angle  = 120,
             vector([7,1],[0,6]),
             head_angle  = 160,
             vector([8,1],[0,6]),
             head_angle  = 180,
             vector([9,1],[0,6]) )$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_length</code> y <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>head_type</b>
<a name="IDX1819"></a>
</dt>
<dd><p>Valor por defecto: <code>filled</code>
</p>
<p><code>head_type</code> se utiliza para especificar c&oacute;mo se habr&aacute;n de
dibujar las flechas de los vectores. Los valores posibles para
esta opci&oacute;n son: <code>filled</code> (flechas cerradas y rellenas),
<code>empty</code> (flechas cerradas pero no rellenas) y <code>nofilled</code>
(flechas abiertas).
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_type = 'nofilled,
             vector([6,1],[5,5]))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>head_both</code>, <code>head_angle</code> y <code>head_length</code>. 
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>unit_vectors</b>
<a name="IDX1820"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>unit_vectors</code> vale <code>true</code>, los vectores se dibujan con m&oacute;dulo unidad.
Esta opci&oacute;n es &uacute;til para representar campos vectoriales. Cuando <code>unit_vectors</code> vale <code>false</code>,
los vectores se dibujan con su longitud original.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>vector</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [-1,6],
             yrange      = [-1,6],
             head_length = 0.1,
             vector([0,0],[5,2]),
             unit_vectors = true,
             color        = red,
             vector([0,3],[5,2]))$
</pre></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>label_alignment</b>
<a name="IDX1821"></a>
</dt>
<dd><p>Valor por defecto: <code>center</code>
</p>
<p><code>label_alignment</code> se utiliza para especificar d&oacute;nde se escribir&aacute;n
las etiquetas con respecto a las coordenadas de referencia. Los valores posibles para
esta opci&oacute;n son: <code>center</code>, <code>left</code> y <code>right</code>.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange          = [0,10],
             yrange          = [0,10],
             points_joined   = true,
             points([[5,0],[5,10]]),
             color           = blue,
             label([&quot;Centered alignment (default)&quot;,5,2]),
             label_alignment = 'left,
             label([&quot;Left alignment&quot;,5,5]),
             label_alignment = 'right,
             label([&quot;Right alignment&quot;,5,8]))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>label_orientation</code> y <code>color</code>. 
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>label_orientation</b>
<a name="IDX1822"></a>
</dt>
<dd><p>Valor por defecto: <code>horizontal</code>
</p>
<p><code>label_orientation</code> se utiliza para especificar la orientaci&oacute;n
de las etiquetas. Los valores posibles para esta opci&oacute;n son:
<code>horizontal</code> y <code>vertical</code>.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para objetos de tipo <code>label</code>.
</p>
<p>Ejemplo:
</p>
<p>En este ejemplo, el punto ficticio que se a&ntilde;ade sirve para obtener
la imagen, ya que el paquete <code>draw</code> necesita siempre de datos para
construir la escena.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange     = [0,10],
             yrange     = [0,10],
             point_size = 0,
             points([[5,5]]),
             color      = navy,
             label([&quot;Horizontal orientation (default)&quot;,5,2]),
             label_orientation = 'vertical,
             color             = &quot;#654321&quot;,
             label([&quot;Vertical orientation&quot;,1,5]))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>label_alignment</code> y <code>color</code>. 
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>color</b>
<a name="IDX1823"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;black&quot;</code>
</p>
<p><code>color</code> especifica el color para dibujar l&iacute;neas,
puntos, bordes de pol&iacute;gonos y etiquetas.
</p>
<p>Los colores se pueden dar a partir de sus nombres o en
c&oacute;digo hexadecimal <i>rgb</i>.
</p>
<p>Los nombres de colores disponibles son: 
<code>&quot;white&quot;</code>, <code>&quot;black&quot;</code>, <code>&quot;gray0&quot;</code>, <code>&quot;grey0&quot;</code>, <code>&quot;gray10&quot;</code>,
<code>&quot;grey10&quot;</code>, <code>&quot;gray20&quot;</code>, <code>&quot;grey20&quot;</code>, <code>&quot;gray30&quot;</code>, <code>&quot;grey30&quot;</code>,
<code>&quot;gray40&quot;</code>, <code>&quot;grey40&quot;</code>, <code>&quot;gray50&quot;</code>, <code>&quot;grey50&quot;</code>, <code>&quot;gray60&quot;</code>,
<code>&quot;grey60&quot;</code>, <code>&quot;gray70&quot;</code>, <code>&quot;grey70&quot;</code>, <code>&quot;gray80&quot;</code>, <code>&quot;grey80&quot;</code>,
<code>&quot;gray90&quot;</code>, <code>&quot;grey90&quot;</code>, <code>&quot;gray100&quot;</code>, <code>&quot;grey100&quot;</code>, <code>&quot;gray&quot;</code>,
<code>&quot;grey&quot;</code>, <code>&quot;light-gray&quot;</code>, <code>&quot;light-grey&quot;</code>, <code>&quot;dark-gray&quot;</code>,
<code>&quot;dark-grey&quot;</code>, <code>&quot;red&quot;</code>, <code>&quot;light-red&quot;</code>, <code>&quot;dark-red&quot;</code>, <code>&quot;yellow&quot;</code>,
<code>&quot;light-yellow&quot;</code>, <code>&quot;dark-yellow&quot;</code>, <code>&quot;green&quot;</code>, <code>&quot;light-green&quot;</code>,
<code>&quot;dark-green&quot;</code>, <code>&quot;spring-green&quot;</code>, <code>&quot;forest-green&quot;</code>, <code>&quot;sea-green&quot;</code>,
<code>&quot;blue&quot;</code>, <code>&quot;light-blue&quot;</code>, <code>&quot;dark-blue&quot;</code>, <code>&quot;midnight-blue&quot;</code>, 
<code>&quot;navy&quot;</code>, <code>&quot;medium-blue&quot;</code>, <code>&quot;royalblue&quot;</code>, <code>&quot;skyblue&quot;</code>, 
<code>&quot;cyan&quot;</code>, <code>&quot;light-cyan&quot;</code>, <code>&quot;dark-cyan&quot;</code>, <code>&quot;magenta&quot;</code>, 
<code>&quot;light-magenta&quot;</code>, <code>&quot;dark-magenta&quot;</code>, <code>&quot;turquoise&quot;</code>, 
<code>&quot;light-turquoise&quot;</code>, <code>&quot;dark-turquoise&quot;</code>, <code>&quot;pink&quot;</code>, <code>&quot;light-pink&quot;</code>,
<code>&quot;dark-pink&quot;</code>, <code>&quot;coral&quot;</code>, <code>&quot;light-coral&quot;</code>, <code>&quot;orange-red&quot;</code>,
<code>&quot;salmon&quot;</code>, <code>&quot;light-salmon&quot;</code>, <code>&quot;dark-salmon&quot;</code>, <code>&quot;aquamarine&quot;</code>,
<code>&quot;khaki&quot;</code>, <code>&quot;dark-khaki&quot;</code>, <code>&quot;goldenrod&quot;</code>, <code>&quot;light-goldenrod&quot;</code>,
<code>&quot;dark-goldenrod&quot;</code>, <code>&quot;gold&quot;</code>, <code>&quot;beige&quot;</code>, <code>&quot;brown&quot;</code>, <code>&quot;orange&quot;</code>,
<code>&quot;dark-orange&quot;</code>, <code>&quot;violet&quot;</code>, <code>&quot;dark-violet&quot;</code>, <code>&quot;plum&quot;</code> y <code>&quot;purple&quot;</code>.
</p>
<p>Las componentes crom&aacute;ticas en c&oacute;digo hexadecimal se introducen 
en el formato <code>&quot;#rrggbb&quot;</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default is black */
             color = &quot;red&quot;,
             explicit(0.5 + x^2,x,-1,1),
             color = blue,
             explicit(1 + x^2,x,-1,1),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             explicit(1.5 + x^2,x,-1,1),
             color = &quot;#23ab0f&quot;,
             label([&quot;This is a label&quot;,0,1.2])  )$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>fill_color</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>fill_color</b>
<a name="IDX1824"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;red&quot;</code>
</p>
<p><code>fill_color</code> especifica el color para rellenar pol&iacute;gonos
y funciones expl&iacute;citas bidimensionales.
</p>
<p>V&eacute;ase <code>color</code> para m&aacute;s informaci&oacute;n sobre c&oacute;mo definir 
colores.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>fill_density</b>
<a name="IDX1825"></a>
</dt>
<dd><p>Valor por defecto: 0
</p>
<p><code>fill_density</code> es un n&uacute;mero entre 0 y 1 que especifica
la intensidad del color de relleno (dado por <code>fill_color</code>)
en los objetos <code>bars</code>.
</p>
<p>V&eacute;ase <code>bars</code> para ejemplos.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>line_width</b>
<a name="IDX1826"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>line_width</code> es el ancho de las l&iacute;neas a dibujar.
Su valor debe ser un n&uacute;mero positivo.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code> y <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default width */
             line_width = 5.5,
             explicit(1 + x^2,x,-1,1),
             line_width = 10,
             explicit(2 + x^2,x,-1,1))$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>line_type</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>line_type</b>
<a name="IDX1827"></a>
</dt>
<dd><p>Valor por defecto: <code>solid</code>
</p>
<p><code>line_type</code> indica c&oacute;mo se van a dibujar las l&iacute;neas;
valores posibles son <code>solid</code> y <code>dots</code>.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_type = dots,
             explicit(1 + x^2,x,-1,1),
             line_type = solid, /* default */
             explicit(2 + x^2,x,-1,1))$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>line_width</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>nticks</b>
<a name="IDX1828"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p>En 2d, <code>nticks</code> es el n&uacute;mero de puntos a utilizar por el programa
adaptativo que genera las funciones expl&iacute;citas. Tambi&eacute;n es el n&uacute;mero de
puntos que se representan en las curvas param&eacute;tricas y polares.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>ellipse</code>, <code>explicit</code>, <code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>parametric</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = true,
             ellipse(0,0,4,2,0,180),
             nticks = 5,
             ellipse(0,0,4,2,180,180) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>adapt_depth</b>
<a name="IDX1829"></a>
</dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>adapt_depth</code> es el n&uacute;mero m&aacute;ximo de particiones utilizadas por
la rutina gr&aacute;fica adaptativa.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>explicit</code> en 2d.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>key</b>
<a name="IDX1830"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;&quot;</code> (cadena vac&iacute;a)
</p>
<p><code>key</code> es la clave de una funci&oacute;n en la leyenda. Si <code>key</code>
es una cadena vac&iacute;a, las funciones no tendr&aacute;n clave
asociada en la leyenda.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>,
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code> y <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code>,
y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(key   = &quot;Sinus&quot;,
             explicit(sin(x),x,0,10),
             key   = &quot;Cosinus&quot;,
             color = red,
             explicit(cos(x),x,0,10) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>xu_grid</b>
<a name="IDX1831"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>xu_grid</code> es el n&uacute;mero de coordenadas de la primera variable
(<code>x</code> en superficies explc&iacute;tas y <code>u</code> en las
param&eacute;tricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>yv_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>yv_grid</b>
<a name="IDX1832"></a>
</dt>
<dd><p>Valor por defecto: 30
</p>
<p><code>yv_grid</code> es el n&uacute;mero de coordenadas de la segunda variable
(<code>y</code> en superficies explc&iacute;tas y <code>v</code> en las
param&eacute;tricas) para formar la rejilla de puntos muestrales.
</p>
<p>Esta opci&oacute;n afecta a los siguientes objetos gr&aacute;ficos:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> y <code>parametric_surface</code>.
</li></ul>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>xu_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>surface_hide</b>
<a name="IDX1833"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando <code>surface_hide</code> vale <code>true</code>, las partes ocultas no
se muestran en las superficies de las escenas 3d.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw(columns=2,
           gr3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)),
           gr3d(surface_hide = true,
                explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)) )$
</pre></dd></dl>



<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>contour</b>
<a name="IDX1834"></a>
</dt>
<dd><p>Valor por defecto: <code>none</code>
</p>
<p>La opci&oacute;n <code>contour</code> permite al usuario decidir d&oacute;nde colocar
las l&iacute;neas de nivel.
Valores posibles son:
</p>
<ul>
<li>
<code>none</code>:
no se dibujan l&iacute;neas de nivel.

</li><li>
<code>base</code>:
las l&iacute;neas de nivel se proyectan sobre el plano xy.

</li><li>
<code>surface</code>:
las l&iacute;neas de nivel se dibujan sobre la propia superficie.

</li><li>
<code>both</code>:
se dibujan dos conjuntos de l&iacute;neas de nivel: sobre
la superficie y las que se proyectan sobre el plano xy.

</li><li>
<code>map</code>:
las l&iacute;neas de nivel se proyectan sobre el plano xy
y el punto de vista del observador se coloca perpendicularmente a &eacute;l.

</li></ul>

<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre>
<p>V&eacute;ase tambi&eacute;n <code>contour_levels</code>.
</p></dd></dl>


<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>contour_levels</b>
<a name="IDX1835"></a>
</dt>
<dd><p>Valor por defecto: 5
</p>
<p>Esta opci&oacute;n gr&aacute;fica controla c&oacute;mo se dibujar&aacute;n las l&iacute;neas
de nivel. A <code>contour_levels</code> se le puede asignar un n&uacute;mero entero
positivo, una lista de tres n&uacute;meros o un conjunto num&eacute;rico arbitrario:
</p>
<ul>
<li>
Si a <code>contour_levels</code> se le asigna un entero positivo <var>n</var>,
entonces se dibujar&aacute;n <var>n</var> l&iacute;neas de nivel a intervalos
iguales. Por defecto, se dibuja&aacute;n cinco isol&iacute;neas.

</li><li>
Si a <code>contour_levels</code> se le asigna una lista de tres n&uacute;meros de la
forma <code>[inf,p,sup]</code>, las isol&iacute;neas se dibujar&aacute;n
desde <code>inf</code> hasta <code>sup</code> en pasos de amplitud <code>p</code>.

</li><li>
Si a <code>contour_levels</code> se le asigna un conjunto de n&uacute;meros de la
forma <code>{n1, n2, ...}</code>, entonces se dibujar&aacute;n las
isol&iacute;neas correspondientes a los niveles <code>n1</code>,
<code>n2</code>, ...
</li></ul>

<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. 
</p>
<p>Ejemplos:
</p>
<p>Diez isol&iacute;neas igualmente espaciadas. El n&uacute;mero
real puede ajustarse a fin de poder conseguir etiquetas m&aacute;s
sencillas.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 10,
             contour        = both,
             surface_hide   = true) $
</pre>

<p>Desde -8 hasta 8 en pasos de amplitud 4.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = [-8,4,8],
             contour        = both,
             surface_hide   = true) $
</pre>
<p>L&iacute;neas correspondientes a los niveles -7, -6, 0.8 y 5.
</p><pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = green,
             explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = {-7, -6, 0.8, 5},
             contour        = both,
             surface_hide   = true) $
</pre>
<p>V&eacute;ase tambi&eacute;n <code>contour</code>.
</p></dd></dl>






<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>columns</b>
<a name="IDX1836"></a>
</dt>
<dd><p>Valor por defecto: 1
</p>
<p><code>columns</code> es el n&uacute;mero de columnas en gr&aacute;ficos m&uacute;ltiples.
</p>
<p>Puesto que &eacute;sta es una opci&oacute;n global, su posici&oacute;n dentro de la
descripci&oacute;n de la escena no reviste importancia. Tambi&eacute;n puede
usarse como argumento de la funci&oacute;n <code>draw</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre>
</dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ip_grid</b>
<a name="IDX1837"></a>
</dt>
<dd><p>Valor por defecto: <code>[50, 50]</code>
</p>
<p><code>ip_grid</code> establece la rejilla del primer muestreo para los
gr&aacute;ficos de funciones impl&iacute;citas.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>ip_grid_in</b>
<a name="IDX1838"></a>
</dt>
<dd><p>Valor por defecto: <code>[5, 5]</code>
</p>
<p><code>ip_grid_in</code> establece la rejilla del segundo muestreo para los
gr&aacute;ficos de funciones impl&iacute;citas.
</p>
<p>Esta opci&oacute;n s&oacute;lo es relevante para funciones de tipo <code>implicit</code>.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>x_voxel</b>
<a name="IDX1839"></a>
</dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>x_voxel</code> es el n&uacute;mero de voxels en la direcci&oacute;n x a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>y_voxel</b>
<a name="IDX1840"></a>
</dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>y_voxel</code> es el n&uacute;mero de voxels en la direcci&oacute;n y a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional.
</p></dd></dl>

<dl>
<dt><u>Opci&oacute;n gr&aacute;fica:</u> <b>z_voxel</b>
<a name="IDX1841"></a>
</dt>
<dd><p>Valor por defecto: 10
</p>
<p><code>z_voxel</code> es el n&uacute;mero de voxels en la direcci&oacute;n z a utilizar
por el algoritmo <i>marching cubes</i> implementado por el objeto 
<code>implicit</code> tridimensional.
</p></dd></dl>







<dl>
<dt><u>Constructor de escena:</u> <b>gr2d</b><i> (<var>Opci&oacute;n gr&aacute;fica</var>, ..., <var>graphic_object</var>, ...)</i>
<a name="IDX1842"></a>
</dt>
<dd><p>La funci&oacute;n <code>gr2d</code> construye un objeto que describe una escena 2d. Los
argumentos son <i>opciones gr&aacute;ficas</i> y <i>objetos gr&aacute;ficos</i>. Esta escena
se interpreta secuencialmente: las <i>opciones gr&aacute;ficas</i> afectan a aquellos
<i>objetos gr&aacute;ficos</i> colocados a su derecha. Algunas <i>opciones gr&aacute;ficas</i>
afectan al aspecto global de la escena.
</p>
<p>La lista de <i>objetos gr&aacute;ficos</i> disponibles para escenas en dos
dimensiones: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, <code>ellipse</code>, <code>label</code>,
<code>vector</code>, <code>explicit</code>, <code>implicit</code>, <code>polar</code>, <code>parametric</code>,
<code>image</code> y <code>geomap</code>.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>V&eacute;anse tambi&eacute;n las siguientes <i>opciones gr&aacute;ficas</i>: <code>xrange</code>, <code>yrange</code>, 
<code>logx</code>, <code>logy</code>, <code>terminal</code>, <code>grid</code>, <code>title</code>, 
<code>xlabel</code>, <code>ylabel</code>, <code>xtics</code>, <code>ytics</code>, <code>xtics_rotate</code>, 
<code>ytics_rotate</code>, <code>xtics_axis</code>, <code>ytics_axis</code>, <code>xaxis</code>, <code>yaxis</code>, 
<code>xaxis_width</code>, <code>yaxis_width</code>, 
<code>xaxis_type</code>, <code>yaxis_type</code>, 
<code>xaxis_color</code>, <code>yaxis_color</code>, <code>xy_file</code>, 
<code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, <code>axis_top</code> 
y <code>axis_right</code>.
</p></dd></dl>


<dl>
<dt><u>Constructor de escena:</u> <b>gr3d</b><i> (<var>Opci&oacute;n gr&aacute;fica</var>, ..., <var>graphic_object</var>, ...)</i>
<a name="IDX1843"></a>
</dt>
<dd><p>La funci&oacute;n <code>gr3d</code> construye un objeto que describe una escena 3d. Los
argumentos son <i>opciones gr&aacute;ficas</i> y <i>objetos gr&aacute;ficos</i>. Esta escena
se interpreta secuencialmente: las <i>opciones gr&aacute;ficas</i> afectan a aquellos
<i>objetos gr&aacute;ficos</i> colocados a su derecha. Algunas <i>opciones gr&aacute;ficas</i>
afectan al aspecto global de la escena.
</p>
<p>La lista de <i>objetos gr&aacute;ficos</i> disponibles para escenas en tres
dimensiones: <code>points</code>, <code>label</code>, <code>vector</code>, <code>explicit</code>, 
<code>implicit</code>, <code>parametric</code>, <code>parametric_surface</code> y <code>geomap</code>.
</p>

<p>V&eacute;anse tambi&eacute;n las siguientes <i>opciones gr&aacute;ficas</i>: <code>xrange</code>, <code>yrange</code>, 
<code>zrange</code>, <code>logx</code>, <code>logy</code>, <code>logz</code>, <code>terminal</code>, 
<code>grid</code>, <code>title</code>, <code>xlabel</code>, <code>ylabel</code>, <code>zlabel</code>, 
<code>xtics</code>, <code>ytics</code>, <code>ztics</code>, <code>xtics_rotate</code>, 
<code>ytics_rotate</code>, <code>ztics_rotate</code>, <code>xtics_axis</code>, <code>ytics_axis</code>, 
<code>ztics_axis</code>, <code>xaxis</code>, <code>yaxis</code>, <code>zaxis</code>, 
<code>xaxis_width</code>, <code>yaxis_width</code>, <code>zaxis_width</code>, 
<code>xaxis_type</code>, <code>yaxis_type</code>, <code>zaxis_type</code>,
<code>xaxis_color</code>, <code>yaxis_color</code>, <code>zaxis_color</code>, <code>xy_file</code>, 
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, 
<code>axis_top</code>, <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>axis_right</code>, <code>rot_vertical</code>, <code>rot_horizontal</code>, 
<code>axis_3d</code>, <code>xu_grid</code>, <code>yv_grid</code>, <code>surface_hide</code>, 
<code>contour</code>, <code>contour_levels</code>, <code>palette</code>, <code>colorbox</code>
y <code>enhanced3d</code>.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p></dd></dl>








<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</i>
<a name="IDX1844"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1845"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> ([<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1846"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> ([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</i>
<a name="IDX1847"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</i>
<a name="IDX1848"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>points</b><i> (<var>matrix</var>)</i>
<a name="IDX1849"></a>
</dt>
<dd><p>Dibuja puntos en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> o 
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>
dibuja los puntos <code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code>, etc. Si no se dan las abscisas,
&eacute;stas se asignan autom&aacute;ticamente a enteros positivos consecutivos, de forma que
<code>points([<var>y1</var>,<var>y2</var>,...])</code> dibuja los puntos <code>[1,<var>y1</var>]</code>, <code>[2,<var>y2</var>]</code>, etc.
Si <var>matrix</var> es una matriz de dos columnas o de dos filas, <code>points (<var>matrix</var>)</code>
dibuja los puntos asociados.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        key = &quot;Small points&quot;,
        points(makelist([random(20),random(50)],k,1,10)),
        point_type    = circle,
        point_size    = 3,
        points_joined = true,
        key           = &quot;Great points&quot;,
        points(makelist(k,k,1,20),makelist(random(30),k,1,20)),
        point_type    = filled_down_triangle,
        key           = &quot;Automatic abscissas&quot;,
        color         = red,
        points([2,12,8]))$
</pre>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
        points_joined = impulses,
        line_width    = 2,
        color         = red,
        points(makelist([random(20),random(50)],k,1,10)))$
</pre>
<p><b>3D</b>
</p>
<p><code>points ([[<var>x1</var>,<var>y1</var>,<var>z1</var>], [<var>x2</var>,<var>y2</var>,<var>z2</var>],...])</code> o 
<code>points ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...], [<var>z1</var>,<var>z2</var>,...])</code>
dibuja los puntos <code>[<var>x1</var>,<var>y1</var>,<var>z1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>,<var>z2</var>]</code>, etc.
Si <var>matrix</var> es una matriz de tres columnas o de tres filas, <code>points (<var>matrix</var>)</code>
dibuja los puntos asociados. Si <var>matrix</var> es una matriz columna o fila, las abscisas 
se asignan autom&aacute;ticamente. 
</p>
<p>Ejemplo:
</p>
<p>Una muestra tridimensional,
</p><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title = &quot;Daily average wind speeds&quot;,
             point_size = 2,
             points(args(submatrix (s2, 4, 5))) )$
</pre>
<p>Dos muestras tridimensionales,
</p><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(
         title = &quot;Daily average wind speeds. Two data sets&quot;,
         point_size = 2,
         key        = &quot;Sample from stations 1, 2 and 3&quot;,
         points(args(submatrix (s2, 4, 5))),
         point_type = 4,
         key        = &quot;Sample from stations 1, 4 and 5&quot;,
         points(args(submatrix (s2, 2, 3))) )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>polygon</b><i> ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</i>
<a name="IDX1850"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>polygon</b><i> ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</i>
<a name="IDX1851"></a>
</dt>
<dd><p>Dibuja pol&iacute;gonos en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>polygon ([[<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>],...])</code> o 
<code>polygon ([<var>x1</var>,<var>x2</var>,...], [<var>y1</var>,<var>y2</var>,...])</code>:
dibuja en el plano un pol&iacute;gono de v&eacute;rtices 
<code>[<var>x1</var>,<var>y1</var>]</code>, <code>[<var>x2</var>,<var>y2</var>]</code>, etc..
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
 <code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(color      = &quot;#e245f0&quot;,
             line_width = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = yellow,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>rectangle</b><i> ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</i>
<a name="IDX1852"></a>
</dt>
<dd><p>Dibuja rect&aacute;ngulos en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>rectangle ([<var>x1</var>,<var>y1</var>], [<var>x2</var>,<var>y2</var>])</code> dibuja un rect&aacute;ngulo de v&eacute;rtices opuestos
<code>[<var>x1</var>,<var>y1</var>]</code> y <code>[<var>x2</var>,<var>y2</var>]</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             line_width  = 6,
             line_type   = dots,
             transparent = false,
             fill_color  = blue,
             rectangle([-2,-2],[8,-1]), /* opposite vertices */
             transparent = true,
             line_type   = solid,
             line_width  = 1,
             rectangle([9,4],[2,-1.5]),
             xrange      = [-3,10],
             yrange      = [-3,4.5] )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>bars</b><i> ([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</i>
<a name="IDX1853"></a>
</dt>
<dd><p>Dibuja barras verticales en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>bars ([<var>x1</var>,<var>h1</var>,<var>w1</var>], [<var>x2</var>,<var>h2</var>,<var>w2</var>, ...])</code> 
dibuja barras centradas en los valores <var>x1</var>, <var>x2</var>, ... de alturas <var>h1</var>, <var>h2</var>, ...
y anchos <var>w1</var>, <var>w2</var>, ...
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>key</code>, 
<code>fill_color</code>, <code>fill_density</code> y <code>line_width</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(
       key          = &quot;Grupo A&quot;,
       fill_color   = blue,
       fill_density = 0.2,
       bars([0.8,5,0.4],[1.8,7,0.4],[2.8,-4,0.4]),
       key          = &quot;Grupo B&quot;,
       fill_color   = red,
       fill_density = 0.6,
       line_width   = 4,
       bars([1.2,4,0.4],[2.2,-2,0.4],[3.2,5,0.4]),
       xaxis = true);
</pre></dd></dl>



<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>ellipse</b><i> (<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</i>
<a name="IDX1854"></a>
</dt>
<dd><p>Dibuja elipses y c&iacute;rculos en 2D.
</p>

<p><b>2D</b>
</p>
<p><code>ellipse (<var>xc</var>, <var>yc</var>, <var>a</var>, <var>b</var>, <var>ang1</var>, <var>ang2</var>)</code>
dibuja una elipse de centro <code>[<var>xc</var>, <var>yc</var>]</code> con semiejes horizontal y vertical
<var>a</var> y <var>b</var>, respectivamente, comenzando en el &aacute;ngulo <var>ang1</var> y trazando un arco
de amplitud igual al &aacute;ngulo <var>ang2</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>transparent</code>, <code>fill_color</code>, <code>border</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = false,
             fill_color  = red,
             color       = gray30,
             transparent = false,
             line_width  = 5,
             ellipse(0,6,3,2,270,-270),
             /* center (x,y), a, b, start &amp; end in degrees */
             transparent = true,
             color       = blue,
             line_width  = 3,
             ellipse(2.5,6,2,3,30,-90),
             xrange      = [-3,6],
             yrange      = [2,9] )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>label</b><i> ([<var>string</var>,<var>x</var>,<var>y</var>],...)</i>
<a name="IDX1855"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>label</b><i> ([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>],...)</i>
<a name="IDX1856"></a>
</dt>
<dd><p>Escribe etiquetas en 2D y 3D.
</p>
<p>Las etiquetas coloreadas s&oacute;lo trabajan con Gnuplot 4.3. Este es un fallo conocido del
paquete <code>draw</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>label_alignment</code>, 
<code>label_orientation</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>])</code> escribe la cadena de caracteres <var>string</var> 
en el punto <code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [0.1,1.4],
             color = &quot;red&quot;,
             label([&quot;Label in red&quot;,0,0.3]),
             color = &quot;#0000ff&quot;,
             label([&quot;Label in blue&quot;,0,0.6]),
             color = &quot;light-blue&quot;,
             label([&quot;Label in light-blue&quot;,0,0.9],
                   [&quot;Another light-blue&quot;,0,1.2])  )$
</pre>
<p><b>3D</b>
</p>
<p><code>label([<var>string</var>,<var>x</var>,<var>y</var>,<var>z</var>])</code> escribe la cadena de caracteres <var>string</var>
en el punto <code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = red,
             label([&quot;UP 1&quot;,-2,0,3], [&quot;UP 2&quot;,1.5,0,4]),
             color = blue,
             label([&quot;DOWN 1&quot;,2,0,-3]) )$
</pre></dd></dl>



<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>vector</b><i> ([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</i>
<a name="IDX1857"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>vector</b><i> ([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</i>
<a name="IDX1858"></a>
</dt>
<dd><p>Dibuja vectores en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>head_both</code>, 
<code>head_length</code>, <code>head_angle</code>, <code>head_type</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>vector ([<var>x</var>,<var>y</var>], [<var>dx</var>,<var>dy</var>])</code> dibuja el vector 
<code>[<var>dx</var>,<var>dy</var>]</code> con origen en <code>[<var>x</var>,<var>y</var>]</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_both = true,
             head_type = 'nofilled,
             line_type = dots,
             vector([6,1],[5,5]))$
</pre>
<p><b>3D</b>
</p>
<p><code>vector([<var>x</var>,<var>y</var>,<var>z</var>], [<var>dx</var>,<var>dy</var>,<var>dz</var>])</code>
dibuja el vector <code>[<var>dx</var>,<var>dy</var>,<var>dz</var>]</code> con 
origen en <code>[<var>x</var>,<var>y</var>,<var>z</var>]</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(color = cyan,
             vector([0,0,0],[1,1,1]/sqrt(3)),
             vector([0,0,0],[1,-1,0]/sqrt(2)),
             vector([0,0,0],[1,1,-2]/sqrt(6)) )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>explicit</b><i> (<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</i>
<a name="IDX1859"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>explicit</b><i> (<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</i>
<a name="IDX1860"></a>
</dt>
<dd><p>Dibuja funciones expl&iacute;citas en 2D y 3D.
</p>
<p><b>2D</b>
</p>
<p><code>explicit (<var>fcn</var>,<var>var</var>,<var>minval</var>,<var>maxval</var>)</code> dibuja la funci&oacute;n expl&iacute;cita <var>fcn</var>,
con la variable <var>var</var> tomando valores desde <var>minval</var> hasta <var>maxval</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>adapt_depth</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>filled_func</code>, <code>fill_color</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_width = 3,
             color      = blue,
             explicit(x^2,x,-3,3) )$
(%i3) draw2d(fill_color  = brown,
             filled_func = true,
             explicit(x^2,x,-3,3) )$
</pre>
<p><b>3D</b>
</p>
<p><code>explicit (<var>fcn</var>,<var>var1</var>,<var>minval1</var>,<var>maxval1</var>,<var>var2</var>,<var>minval2</var>,<var>maxval2</var>)</code>
dibuja la funci&oacute;n expl&iacute;cita <var>fcn</var>, con la variable 
<code>var1</code> tomando valores desde <var>minval1</var> hasta <var>maxval1</var> y 
la variable <var>var2</var> tomando valores desde <var>minval2</var> hasta <var>maxval2</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>:  <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>line_width</code>, <code>key</code>, <code>enhanced3d</code>,
<code>meshed_surface</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(key   = &quot;Gauss&quot;,
             color = &quot;#a02c00&quot;,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
             yv_grid     = 10,
             color = blue,
             key   = &quot;Plane&quot;,
             explicit(x+y,x,-5,5,y,-5,5),
             surface_hide = true)$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>filled_func</code> para el relleno de curvas.
</p></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>implicit</b><i> (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</i>
<a name="IDX1861"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>implicit</b><i> (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>,<var>z</var>,<var>zmin</var>,<var>zmax</var>)</i>
<a name="IDX1862"></a>
</dt>
<dd><p>Dibuja funciones impl&iacute;citas en 2D y 3D.
</p>
<p><b>2D</b>
</p>
<p><code>implicit (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>,<var>y</var>,<var>ymin</var>,<var>ymax</var>)</code>
dibuja la funci&oacute;n impl&iacute;cita <var>fcn</var>, con la variable
<code>x</code> tomando valores desde <var>xmin</var> hasta <var>xmax</var>,
y la variable <var>y</var> tomando valores desde <var>ymin</var> hasta <var>ymax</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>ip_grid</code>, 
<code>ip_grid_in</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal  = eps,
             grid      = true,
             line_type = solid,
             key       = &quot;y^2=x^3-2*x+1&quot;,
             implicit(y^2=x^3-2*x+1, x, -4,4, y, -4,4),
             line_type = dots,
             key       = &quot;x^3+y^3 = 3*x*y^2-x-1&quot;,
             implicit(x^3+y^3 = 3*x*y^2-x-1, x,-4,4, y,-4,4),
             title     = &quot;Two implicit functions&quot; )$
</pre>
<p><b>3D</b>
</p>
<p><code>implicit (<var>fcn</var>,<var>x</var>,<var>xmin</var>,<var>xmax</var>, <var>y</var>,<var>ymin</var>,<var>ymax</var>, <var>z</var>,<var>zmin</var>,<var>zmax</var>)</code>
dibuja la funci&oacute;n impl&iacute;cita <var>fcn</var>, con la variable <var>x</var> 
tomando valores desde <var>xmin</var> hasta <var>xmax</var>, la variable <var>y</var> tomando 
valores desde <var>ymin</var> hasta <var>ymax</var> y la variable <var>z</var> tomando 
valores desde <var>zmin</var> hasta <var>zmax</var>. Este objeto est&aacute; programado con el 
algoritmo <i>marching cubes</i>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>x_voxel</code>, 
<code>y_voxel</code>, <code>z_voxel</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(
        color=blue,
        implicit((x^2+y^2+z^2-1)*(x^2+(y-1.5)^2+z^2-0.5)=0.015,
                 x,-1,1,y,-1.2,2.3,z,-1,1),
        surface_hide=true);
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>polar</b><i> (<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</i>
<a name="IDX1863"></a>
</dt>
<dd><p>Dibuja funciones 2D definidas en coordenadas polares.
</p>
<p><b>2D</b>
</p>
<p><code>polar (<var>radius</var>,<var>ang</var>,<var>minang</var>,<var>maxang</var>)</code> dibuja la funci&oacute;n
<code><var>radius</var>(<var>ang</var>)</code> definida en coordenadas polares, con la variable 
<var>ang</var> tomando valores desde <var>minang</var> hasta <var>maxang</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(user_preamble = &quot;set grid polar&quot;,
             nticks        = 200,
             xrange        = [-5,5],
             yrange        = [-5,5],
             color         = blue,
             line_width    = 3,
             title         = &quot;Hyperbolic Spiral&quot;,
             polar(10/theta,theta,1,10*%pi) )$
</pre></dd></dl>



<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>spherical</b><i> (<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</i>
<a name="IDX1864"></a>
</dt>
<dd><p>Dibuja funciones 3D definidas en coordenadas esf&eacute;ricas.
</p>
<p><b>3D</b>
</p>
<p><code>spherical (<var>radius</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>,<var>zen</var>,<var>minzen</var>,<var>maxzen</var>)</code>
dibuja la funci&oacute;n <code><var>radius</var>(<var>azi</var>,<var>zen</var>)</code> definida en coordenadas esf&eacute;ricas, con el <i>azimut</i>
<var>azi</var> tomando valores desde <var>minazi</var> hasta <var>maxazi</var> y el <i>zenit</i> <var>zen</var> tomando valores desde
<var>minzen</var> hasta <var>maxzen</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(spherical(1,a,0,2*%pi,z,0,%pi))$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>cylindrical</b><i> (<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</i>
<a name="IDX1865"></a>
</dt>
<dd><p>Dibuja funciones 3D definidas en coordenadas cil&iacute;ndricas.
</p>
<p><b>3D</b>
</p>
<p><code>cylindrical (<var>radius</var>,<var>z</var>,<var>minz</var>,<var>maxz</var>,<var>azi</var>,<var>minazi</var>,<var>maxazi</var>)</code>
dibuja la funci&oacute;n <code><var>radius</var>(<var>z</var>,<var>azi</var>)</code> definida en coordenadas cil&iacute;ndricas, con la variable
<var>z</var> tomando valores desde <var>minz</var> hasta <var>maxz</var> y el <i>azimut</i> <var>azi</var> tomando valores desde
<var>minazi</var> hasta <var>maxazi</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(cylindrical(1,z,-2,2,az,0,2*%pi))$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>parametric</b><i> (<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</i>
<a name="IDX1866"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>parametric</b><i> (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</i>
<a name="IDX1867"></a>
</dt>
<dd><p>Dibuja funciones param&eacute;tricas en 2D y 3D.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> y <code>color</code>.
</p>
<p><b>2D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> dibuja la funci&oacute;n param&eacute;trica 
<code>[<var>xfun</var>,<var>yfun</var>]</code>, con el par&aacute;metro <var>par</var> tomando valores desde 
<var>parmin</var> hasta <var>parmax</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x),x,-1,3),
             color = red,
             key   = &quot;This is the parametric one!!&quot;,
             parametric(2*cos(rrr),rrr^2,rrr,0,2*%pi))$
</pre>
<p><b>3D</b>
</p>
<p><code>parametric (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par</var>,<var>parmin</var>,<var>parmax</var>)</code> 
dibuja la curva param&eacute;trica <code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, con el par&aacute;metro
<var>par</var> tomando valores desde <var>parmin</var> hasta <var>parmax</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = royalblue,
             parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2),
             color      = turquoise,
             line_width = 2,
             parametric(t^2,sin(t),2+t,t,0,2),
             surface_hide = true,
             title = &quot;Surface &amp; curves&quot; )$
</pre></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>image</b><i> (<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</i>
<a name="IDX1868"></a>
</dt>
<dd><p>Reproduce una imagen en 2D.
</p>
<p><b>2D</b>
</p>
<p><code>image (<var>im</var>,<var>x0</var>,<var>y0</var>,<var>width</var>,<var>height</var>)</code>:
dibuja la imagen <var>im</var> en la regi&oacute;n rectangular desde el v&eacute;rtice <var>(<var>x0</var>,<var>y0</var>)</var>
hasta el <code>(x0+<var>width</var>,y0+<var>height</var>)</code> del plano real. El argumento <var>im</var> debe ser una
matriz de n&uacute;meros reales, una matriz de vectores de longitud tres o un objeto
de tipo <code>picture</code>.
</p>
<p>Si <var>im</var> es una matriz de n&uacute;meros reales, los valores de los
p&iacute;xeles se interpretan seg&uacute;n indique la opci&oacute;n
gr&aacute;fica <code>palette</code>, que es un vector de longitud tres con sus componentes tomando
valores enteros en el rango desde -36 a +36; cada valor es un 
&iacute;ndice para seleccionar una f&oacute;rmula que transforma los niveles
num&eacute;ricos en las componentes crom&aacute;ticas rojo, verde y azul:
</p><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84
32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre><p>los n&uacute;meros negativos se interpretan como colores invertidos
de las componentes crom&aacute;ticas.
</p>
<p><code>palette = gray</code> y <code>palette = color</code> son atajos para
<code>palette = [3,3,3]</code> y <code>palette = [7,5,15]</code>, respectivamente.
</p>
<p>Si <var>im</var> es una matriz de vectores de longitud tres, &eacute;stos se
interpretar&aacute;n como las componentes crom&aacute;ticas rojo, verde y azul.
</p>
<p>Ejemplos:
</p>
<p>Si <var>im</var> es una matriz de n&uacute;meros reales, los valores de los
p&iacute;xeles se interpretan seg&uacute;n indique la opci&oacute;n
gr&aacute;fica <code>palette</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre>
<p>V&eacute;ase tambi&eacute;n <code>colorbox</code>.
</p>
<p>Si <var>im</var> es una matriz de vectores de longitud tres, &eacute;stos se
interpretar&aacute;n como las componentes crom&aacute;ticas rojo, verde y azul.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
            'matrix,
             makelist(
               makelist([random(300),
                         random(300),
                         random(300)],i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
</pre>
<p>El paquete <code>draw</code> carga autom&aacute;ticamente el paquete <code>picture</code>. 
En este ejemplo, una imagen de niveles se define a mano, reproduci&eacute;ndola
a continuaci&oacute;n.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: make_level_picture([45,87,2,134,204,16],3,2);
(%o2)       picture(level, 3, 2, {Array:  #(45 87 2 134 204 16)})
(%i3) /* default color palette */
      draw2d(image(im,0,0,30,30))$
(%i4) /* gray palette */
      draw2d(palette = gray,
             image(im,0,0,30,30))$
</pre>
<p>Se lee un fichero xpm y se reproduce.
</p><pre class="example">(%i1) load(draw)$
(%i2) im: read_xpm(&quot;myfile.xpm&quot;)$
(%i3) draw2d(image(im,0,0,10,7))$
</pre>
<p>V&eacute;anse tambi&eacute;n <code>make_level_picture</code>, <code>make_rgb_picture</code> y <code>read_xpm</code>.
</p>
<p>En <a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/image">http://www.telefonica.net/web2/biomates/maxima/gpdraw/image</a>
se encuentran ejemplos m&aacute;s elaborados.
</p></dd></dl>


<dl>
<dt><u>Global variable:</u> <b>boundaries_array</b>
<a name="IDX1869"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p><code>boundaries_array</code> es donde el objeto gr&aacute;fico <code>geomap</code> lee
las coordenadas de las l&iacute;neas fronterizas.
</p>
<p>Cada componente de <code>boundaries_array</code> es un array de n&uacute;meros decimales
en coma flotante representando las coordenadas que definen un segmento
poligonal o l&iacute;nea fronteriza.
</p>
<p>V&eacute;ase tambi&eacute;n <code>geomap</code>.
</p></dd></dl>


<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>geomap</b><i> (<var>numlist</var>)</i>
<a name="IDX1870"></a>
</dt>
<dt><u>Objeto gr&aacute;fico:</u> <b>geomap</b><i> (<var>numlist</var>,<var>3Dprojection</var>)</i>
<a name="IDX1871"></a>
</dt>
<dd><p>Dibuja mapas cartogr&aacute;ficos en 2D y 3D.
</p>
<p><b>2D</b>
</p>
<p>Esta funci&oacute;n trabaja junto con la variable global <code>boundaries_array</code>.
</p>
<p>El argumento <var>numlist</var> es una lista de n&uacute;meros o de listas de 
n&uacute;meros. Todos estos n&uacute;meros deben ser enteros mayores o iguales que cero,
representando las componentes del array global <code>boundaries_array</code>.
</p>
<p>Cada componente de <code>boundaries_array</code> es un array de decimales en
coma flotante, las coordenadas de un segmento poligonal o l&iacute;nea
fronteriza.
</p>
<p><code>geomap (<var>numlist</var>)</code> toma los enteros de sus argumentos y 
dibuja los segmentos poligonales asociados de <code>boundaries_array</code>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>line_width</code>, 
<code>line_type</code> y <code>color</code>.
</p>
<p>Ejemplos:
</p>
<p>Un sencillo mapa hecho a mano:
</p><pre class="example">(%i1) load(draw)$
(%i2) /* Vertices of boundary #0: {(1,1),(2,5),(4,3)} */
   ( bnd0: make_array(flonum,6),
     bnd0[0]:1.0, bnd0[1]:1.0, bnd0[2]:2.0,
     bnd0[3]:5.0, bnd0[4]:4.0, bnd0[5]:3.0 )$
(%i3) /* Vertices of boundary #1: {(4,3),(5,4),(6,4),(5,1)} */
   ( bnd1: make_array(flonum,8),
     bnd1[0]:4.0, bnd1[1]:3.0, bnd1[2]:5.0, bnd1[3]:4.0,
     bnd1[4]:6.0, bnd1[5]:4.0, bnd1[6]:5.0, bnd1[7]:1.0)$
(%i4) /* Vertices of boundary #2: {(5,1), (3,0), (1,1)} */
   ( bnd2: make_array(flonum,6),
     bnd2[0]:5.0, bnd2[1]:1.0, bnd2[2]:3.0,
     bnd2[3]:0.0, bnd2[4]:1.0, bnd2[5]:1.0 )$
(%i5) /* Vertices of boundary #3: {(1,1), (4,3)} */
   ( bnd3: make_array(flonum,4),
     bnd3[0]:1.0, bnd3[1]:1.0, bnd3[2]:4.0, bnd3[3]:3.0)$
(%i6) /* Vertices of boundary #4: {(4,3), (5,1)} */
   ( bnd4: make_array(flonum,4),
     bnd4[0]:4.0, bnd4[1]:3.0, bnd4[2]:5.0, bnd4[3]:1.0)$
(%i7) /* Pack all together in boundaries_array */
   ( boundaries_array: make_array(any,5),
     boundaries_array[0]: bnd0, boundaries_array[1]: bnd1,
     boundaries_array[2]: bnd2, boundaries_array[3]: bnd3,
     boundaries_array[4]: bnd4 )$
(%i8) draw2d(geomap([0,1,2,3,4]))$
</pre>
<p>El paquete auxiliar <code>worldmap</code> asigna al array global
<code>boundaries_array</code> l&iacute;neas fronterizas
reales en coordenadas (longitud, latitud). Estos datos son
de dominio p&uacute;blico y proceden de
<a href="http://www-cger.nies.go.jp/grid-e/gridtxt/grid19.html">http://www-cger.nies.go.jp/grid-e/gridtxt/grid19.html</a>.
El paquete <code>worldmap</code> tambi&eacute;n define fronteras 
de pa&iacute;ses, continentes y l&iacute;neas
costeras a partir de las
componentes de <code>boundaries_array</code> (v&eacute;ase el
fichero <code>share/draw/worldmap.mac</code> para m&aacute;s
informaci&oacute;n). El paquete <code>draw</code> no carga
autom&aacute;ticamente <code>worldmap</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) c1: gr2d(geomap(Canada,United_States,
                      Mexico,Cuba))$
(%i4) c2: gr2d(geomap(Africa))$
(%i5) c3: gr2d(geomap(Oceania,China,Japan))$
(%i6) c4: gr2d(geomap(France,Portugal,Spain,
                      Morocco,Western_Sahara))$
(%i7) draw(columns  = 2,
           c1,c2,c3,c4)$
</pre>
<p><code>worldmap</code> se puede utilizar para dibujar pa&iacute;ses
como pol&iacute;gonos. En este caso, ya no ser&aacute; necesario
hacer uso del objeto gr&aacute;fico <code>geomap</code>, pero s&iacute; de
<code>polygon</code>. Puesto que en este caso se utilizan listas en lugar de
arrays, los mapas se reproducir&aacute;n de forma m&aacute;s lenta. V&eacute;anse
tambi&eacute;n <code>make_poly_country</code> y <code>make_poly_continent</code> para
comprender el siguiente c&oacute;digo.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) mymap: append(
   [color      = white],  /* borders are white */
   [fill_color = red],             make_poly_country(Bolivia),
   [fill_color = cyan],            make_poly_country(Paraguay),
   [fill_color = green],           make_poly_country(Colombia),
   [fill_color = blue],            make_poly_country(Chile),
   [fill_color = &quot;#23ab0f&quot;],       make_poly_country(Brazil),
   [fill_color = goldenrod],       make_poly_country(Argentina),
   [fill_color = &quot;midnight-blue&quot;], make_poly_country(Uruguay))$
(%i4) apply(draw2d, mymap)$
</pre>
<p><b>3D</b>
</p>
<p><code>geomap (<var>numlist</var>)</code> proyecta los mapas sobre la esfera de radio 1
y centro (0,0,0). Es posible cambiar la esfera o el tipo de proyecci&oacute;n haciendo
uso de <code>geomap (<var>numlist</var>,<var>3Dprojection</var>)</code>.
</p>
<p>Proyecciones 3D disponibles:
</p>
<ul>
<li>
<code>[spherical_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>]</code>: proyecta los mapas sobre la esfera de radio
<var>r</var> y centro (<var>x</var>,<var>y</var>,<var>z</var>).
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap(Australia), /* default projection */
             geomap(Australia,
                    [spherical_projection,2,2,2,3]))$
</pre>
</li><li>
<code>[cylindrical_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>,<var>rc</var>]</code>: re-proyecta mapas esf&eacute;ricos
sobre el cilindro de radio <var>rc</var> cuyo eje pasa a trav&eacute;s de los polos del globo
de radio <var>r</var> y centro (<var>x</var>,<var>y</var>,<var>z</var>).
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap([America_coastlines,Eurasia_coastlines],
                    [cylindrical_projection,2,2,2,3,4]))$
</pre>
</li><li>
<code>[conic_projection,<var>x</var>,<var>y</var>,<var>z</var>,<var>r</var>,<var>alpha</var>]</code>: re-proyecta mapas esf&eacute;ricos sobre los
conos de &aacute;ngulo <var>alpha</var>, cuyos ejes pasan a trav&eacute;s de los polos del globo de radio <var>r</var> 
y centro (<var>x</var>,<var>y</var>,<var>z</var>). Ambos conos, norte y sur, son tangentes a la esfera.
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) draw3d(geomap(World_coastlines,
                    [conic_projection,0,0,0,1,90]))$
</pre></li></ul>

<p>En <a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/geomap">http://www.telefonica.net/web2/biomates/maxima/gpdraw/geomap</a>
hay ejemplos m&aacute;s elaborados.
</p></dd></dl>










<dl>
<dt><u>Objeto gr&aacute;fico:</u> <b>parametric_surface</b><i> (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</i>
<a name="IDX1872"></a>
</dt>
<dd><p>Dibuja superficies param&eacute;tricas en 3D.
</p>
<p><b>3D</b>
</p>
<p><code>parametric_surface (<var>xfun</var>,<var>yfun</var>,<var>zfun</var>,<var>par1</var>,<var>par1min</var>,<var>par1max</var>,<var>par2</var>,<var>par2min</var>,<var>par2max</var>)</code>
dibuja la superficie param&eacute;trica <code>[<var>xfun</var>,<var>yfun</var>,<var>zfun</var>]</code>, 
con el par&aacute;metro <var>par1</var> tomando valores desde <var>par1min</var> hasta <var>par1max</var>
y el par&aacute;metro <var>par2</var> tomando valores desde <var>par2min</var> hasta <var>par2max</var>.
</p>
<p>Este objeto se ve afectado por las siguientes <i>opciones gr&aacute;ficas</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>line_width</code>, <code>key</code>, <code>enhanced3d</code>,
<code>meshed_surface</code> y <code>color</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) draw3d(title          = &quot;Sea shell&quot;,
             xu_grid        = 100,
             yv_grid        = 25,
             rot_vertical   = 100,
             rot_horizontal = 20,
             surface_hide   = true,
             parametric_surface(0.5*u*cos(u)*(cos(v)+1),
                           0.5*u*sin(u)*(cos(v)+1),
                           u*sin(v) - ((u+3)/8*%pi)^2 - 20,
                           u, 0, 13*%pi, v, -%pi, %pi) )$
</pre></dd></dl>







<dl>
<dt><u>Funci&oacute;n:</u> <b>draw</b><i> (<var>gr2d</var>, ..., <var>gr3d</var>, ..., <var>options</var>, ...)</i>
<a name="IDX1873"></a>
</dt>
<dd><p>Representa gr&aacute;ficamente una serie de escenas; sus argumentos son objetos
<code>gr2d</code> y/o <code>gr3d</code>, junto con algunas opciones. Por defecto, 
las escenas se representan en una columna.
</p>
<p>La funci&oacute;n <code>draw</code> acepta las siguientes opciones globales: <code>terminal</code>,
<code>columns</code>, <code>pic_width</code>, <code>pic_height</code>, <code>eps_width</code>,
<code>eps_height</code>, <code>file_name</code> y <code>delay</code>.
</p>
<p>Las funciones <code>draw2d</code> y <code>draw3d</code> son atajos a utilizar
cuando se quiere representar una &uacute;nica escena en dos o tres
dimensiones, respectivamente.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre>
<p>Las dos sentencias gr&aacute;ficas siguientes son equivalentes:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(gr3d(explicit(x^2+y^2,x,-1,1,y,-1,1)));
(%o2)                          [gr3d(explicit)]
(%i3) draw3d(explicit(x^2+y^2,x,-1,1,y,-1,1));
(%o3)                          [gr3d(explicit)]
</pre>
<p>Un fichero gif animado:
</p><pre class="example">(%i1) load(draw)$
(%i2) draw(
        delay     = 100,
        file_name = &quot;zzz&quot;,
        terminal  = 'animated_gif,
        gr2d(explicit(x^2,x,-1,1)),
        gr2d(explicit(x^3,x,-1,1)),
        gr2d(explicit(x^4,x,-1,1)));
End of animation sequence
(%o2)          [gr2d(explicit), gr2d(explicit), gr2d(explicit)]
</pre>
<p>V&eacute;anse tambi&eacute;n <code>gr2d</code>, <code>gr3d</code>, <code>draw2d</code> y <code>draw3d</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>draw2d</b><i> (<var>option</var>, <var>graphic_object</var>, ...)</i>
<a name="IDX1874"></a>
</dt>
<dd><p>Esta funci&oacute;n es un atajo para
<code>draw(gr2d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una &uacute;nica escena en 2d.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>draw</code> y <code>gr2d</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>draw3d</b><i> (<var>option</var>, <var>graphic_object</var>, ...)</i>
<a name="IDX1875"></a>
</dt>
<dd><p>Esta funci&oacute;n es un atajo para
<code>draw(gr3d(<var>options</var>, ..., <var>graphic_object</var>, ...))</code>.
</p>
<p>Puede utilizarse para representar una &uacute;nica escena en 3d.
</p>
<p>Para utilizar esta funci&oacute;n, ejec&uacute;tese primero <code>load(draw)</code>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>draw</code> y <code>gr3d</code>.
</p></dd></dl>








<hr size="6">
<a name="Funciones-y-variables-para-picture"></a>
<a name="SEC188"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC187" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC189" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC185" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.3 Funciones y variables para picture </h2>



<dl>
<dt><u>Funci&oacute;n:</u> <b>make_level_picture</b><i> (<var>data</var>)</i>
<a name="IDX1876"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>make_level_picture</b><i> (<var>data</var>,<var>width</var>,<var>height</var>)</i>
<a name="IDX1877"></a>
</dt>
<dd><p>Devuelve un objeto <code>picture</code> consistente en una imagen de niveles.
<code>make_level_picture (<var>data</var>)</code> construye el objeto <code>picture</code>
a partir de la matriz <var>data</var>.
<code>make_level_picture (<var>data</var>,<var>width</var>,<var>height</var>)</code>
construye el objeto a partir de una lista de n&uacute;meros, en cuyo
caso deben indicarse el ancho <var>width</var> y la altura <var>height</var>
en p&iacute;xeles.
</p>
<p>El objeto  <code>picture</code> devuelto contiene los siguientes cuatro
elemento:
</p>
<ol>
<li> el s&iacute;mbolo <code>level</code>
</li><li> anchura de la imagen
</li><li> altura de la imagen
</li><li> un array de enteros con los valores de los p&iacute;xeles
entre 0 y 255. El argumento <var>data</var> debe contener s&oacute;lo n&uacute;meros
entre 0 y 255; los cantidades negativas se transforman en ceros y las 
que son mayores de 255 se igualan a este n&uacute;mero.
</li></ol>

<p>Ejemplo:
</p>
<p>Imagen de niveles a partir de una matriz.
</p><pre class="example">(%i1) load(draw)$
(%i2) make_level_picture(matrix([3,2,5],[7,-9,3000]));
(%o2)         picture(level, 3, 2, {Array:  #(3 2 5 7 0 255)})
</pre>
<p>Imagen de niveles a partir de una lista num&eacute;rica.
</p><pre class="example">(%i1) load(draw)$
(%i2) make_level_picture([-2,0,54,%pi],2,2);
(%o2)            picture(level, 2, 2, {Array:  #(0 0 54 3)})
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>picturep</b><i> (<var>x</var>)</i>
<a name="IDX1878"></a>
</dt>
<dd><p>Devuelve <code>true</code> si el argumento es una imagen bien formada,
o <code>false</code> en caso contrario.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>picture_equalp</b><i> (<var>x</var>,<var>y</var>)</i>
<a name="IDX1879"></a>
</dt>
<dd><p>Devuelve <code>true</code> si los dos argumentos son im&aacute;genes id&eacute;nticas,
o <code>false</code> en caso contrario.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>make_rgb_picture</b><i> (<var>redlevel</var>,<var>greenlevel</var>,<var>bluelevel</var>)</i>
<a name="IDX1880"></a>
</dt>
<dd><p>Devuelve un objeto <var>picture</var> conteniendo una imagen en color (RGB).
Los tres argumentos deben ser im&aacute;genes de niveles, para el rojo (R),
verde (G) y azul (B).
</p>
<p>El objeto  <var>picture</var> devuelto contiene los siguientes cuatro
elemento:
</p>
<ol>
<li> el s&iacute;mbolo <code>rgb</code>
</li><li> anchura de la imagen
</li><li> altura de la imagen
</li><li> un array de enteros de <var>3*ancho*alto</var> con los valores de los p&iacute;xeles
entre 0 y 255. Cada valor de pixel se representa en el array con tres n&uacute;meros consecutivos
(rojo, verde, azul).
</li></ol>

<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) red: make_level_picture(matrix([3,2],[7,260]));
(%o2)           picture(level, 2, 2, {Array:  #(3 2 7 255)})
(%i3) green: make_level_picture(matrix([54,23],[73,-9]));
(%o3)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
(%i4) blue: make_level_picture(matrix([123,82],[45,32.5698]));
(%o4)          picture(level, 2, 2, {Array:  #(123 82 45 33)})
(%i5) make_rgb_picture(red,green,blue);
(%o5) picture(rgb, 2, 2, 
              {Array:  #(3 54 123 2 23 82 7 73 45 255 0 33)})
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>take_channel</b><i> (<var>im</var>,<var>color</var>)</i>
<a name="IDX1881"></a>
</dt>
<dd><p>Si el argumento <var>color</var> es <code>red</code>, <code>green</code> o <code>blue</code>,
la funci&oacute;n <code>take_channel</code> devuelve el canal de color correspondiente
de la imagen <var>im</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) red: make_level_picture(matrix([3,2],[7,260]));
(%o2)           picture(level, 2, 2, {Array:  #(3 2 7 255)})
(%i3) green: make_level_picture(matrix([54,23],[73,-9]));
(%o3)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
(%i4) blue: make_level_picture(matrix([123,82],[45,32.5698]));
(%o4)          picture(level, 2, 2, {Array:  #(123 82 45 33)})
(%i5) make_rgb_picture(red,green,blue);
(%o5) picture(rgb, 2, 2, 
              {Array:  #(3 54 123 2 23 82 7 73 45 255 0 33)})
(%i6) take_channel(%,'green);  /* simple quote!!! */
(%o6)           picture(level, 2, 2, {Array:  #(54 23 73 0)})
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>negative_picture</b><i> (<var>pic</var>)</i>
<a name="IDX1882"></a>
</dt>
<dd><p>Devuelve el negativo de la imagen, sea &eacute;sta de tipo nivel (<var>level</var>)
o color (<var>rgb</var>).
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>rgb2level</b><i> (<var>pic</var>)</i>
<a name="IDX1883"></a>
</dt>
<dd><p>Transforma una imagen en color <var>rgb</var> a otra de niveles <var>level</var>
promediando los niveles.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>get_pixel</b><i> (<var>pic</var>,<var>x</var>,<var>y</var>)</i>
<a name="IDX1884"></a>
</dt>
<dd><p>Devuelve el pixel de la imagen <var>pic</var>. Las coordenadas <var>x</var> e <var>y</var>
van desde 0 hasta <code>ancho-1</code> y <code>alto-1</code>, respectivamente.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>read_xpm</b><i> (<var>xpm_file</var>)</i>
<a name="IDX1885"></a>
</dt>
<dd><p>Lee el fichero gr&aacute;fico en formato xpm y devuelve un objeto <code>picture</code>.
</p></dd></dl>








<hr size="6">
<a name="Funciones-y-variables-para-worldmap"></a>
<a name="SEC189"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC188" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC185" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 48.4 Funciones y variables para worldmap </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>region_boundaries</b><i> (<var>x1</var>,<var>y1</var>,<var>x2</var>,<var>y2</var>)</i>
<a name="IDX1886"></a>
</dt>
<dd><p>Detecta los segmentos poligonales almacenados en la variable global
<code>boundaries_array</code> contenidos en el rect&aacute;ngulo de v&eacute;rtices
(<var>x1</var>,<var>y1</var>) -superior izquierdo- y (<var>x2</var>,<var>y2</var>)
-inferior derecho-.
</p>
<p>Ejemplo:
</p>
<p>Devuelve los n&uacute;meros de los segmentos necesarios para
dibujar el sur de Italia.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) region_boundaries(10.4,41.5,20.7,35.4);
(%o3)                [1846, 1863, 1864, 1881, 1888, 1894]
(%i4) draw2d(geomap(%))$
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>numbered_boundaries</b><i> (<var>nlist</var>)</i>
<a name="IDX1887"></a>
</dt>
<dd><p>Dibuja una lista de segmentos poligonales (l&iacute;neas 
fronterizas), etiquetadas con sus n&uacute;meros correspondientes
(coordenadas de <code>boundaries_array</code>). Esta funci&oacute;n es
de mucha ayuda a la hora de definir nuevas entidades
geogr&aacute;ficas.
</p>
<p>Ejemplo:
</p>
<p>Mapa de Europa con las fronteras y costas etiquetadas con
su componente num&eacute;rica de <code>boundaries_array</code>.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) european_borders: 
         region_boundaries(-31.81,74.92,49.84,32.06)$
(%i4) numbered_boundaries(european_borders)$
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>make_polygon</b><i> (<var>nlist</var>)</i>
<a name="IDX1888"></a>
</dt>
<dd><p>Devuelve un objeto <code>polygon</code> a partie de una lista
de l&iacute;neas fronterizas y de costas. El
argumento <var>nlist</var> debe ser una lista de componentes
de <code>boundaries_array</code>.
</p>
<p>Ejemplo:
</p>
<p>La variable Bhutan (But&aacute;n) est&aacute; definida con los n&uacute;meros
fronterizos 171, 173 y 1143, de manera que <code>make_polygon([171,173,1143])</code>
concatena los arrays <code>boundaries_array[171]</code>, <code>boundaries_array[173]</code> y
<code>boundaries_array[1143]</code> y devuelve un objeto <code>polygon</code>
apto para ser dibujado por <code>draw</code>. A fin de evitar mensajes
de errores, los arrays deben ser compatibles en el sentido de que dos
de ellos consecutivos deben tener dos coordenadas comunes en los
extremos. En este ejemplo, las dos primeras componentes de 
<code>boundaries_array[171]</code> son iguales a las dos &uacute;ltimas de
<code>boundaries_array[173]</code>, y las dos primeras de <code>boundaries_array[173]</code>
coinciden con las dos primeras de <code>boundaries_array[1143]</code>;
en conclusi&oacute;n, los n&uacute;meros de segmentos poligonales171, 173 y 1143
(en este orden) son compatibles y el pol&iacute;gono
coloreado se podr&aacute; dibujar.
</p><pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) Bhutan;
(%o3)                        [[171, 173, 1143]]
(%i4) boundaries_array[171];
(%o4) {Array:  
       #(88.750549 27.14727 88.806351 27.25305 88.901367 27.282221
         88.917877 27.321039)}
(%i5) boundaries_array[173];
(%o5) {Array:
       #(91.659554 27.76511 91.6008 27.66666 91.598022 27.62499
         91.631348 27.536381 91.765533 27.45694 91.775253 27.4161 
         92.007751 27.471939 92.11441 27.28583 92.015259 27.168051
         92.015533 27.08083 92.083313 27.02277 92.112183 26.920271
         92.069977 26.86194 91.997192 26.85194 91.915253 26.893881
         91.916924 26.85416 91.8358 26.863331 91.712479 26.799999 
         91.542191 26.80444 91.492188 26.87472 91.418854 26.873329
         91.371353 26.800831 91.307457 26.778049 90.682457 26.77417
         90.392197 26.903601 90.344131 26.894159 90.143044 26.75333
         89.98996 26.73583 89.841919 26.70138 89.618301 26.72694 
         89.636093 26.771111 89.360786 26.859989 89.22081 26.81472
         89.110237 26.829161 88.921631 26.98777 88.873016 26.95499
         88.867737 27.080549 88.843307 27.108601 88.750549 
         27.14727)}
(%i6) boundaries_array[1143];
(%o6) {Array:  
       #(91.659554 27.76511 91.666924 27.88888 91.65831 27.94805 
         91.338028 28.05249 91.314972 28.096661 91.108856 27.971109
         91.015808 27.97777 90.896927 28.05055 90.382462 28.07972
         90.396088 28.23555 90.366074 28.257771 89.996353 28.32333
         89.83165 28.24888 89.58609 28.139999 89.35997 27.87166 
         89.225517 27.795 89.125793 27.56749 88.971077 27.47361
         88.917877 27.321039)}
(%i7) Bhutan_polygon: make_polygon([171,173,1143])$
(%i8) draw2d(Bhutan_polygon)$
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>make_poly_country</b><i> (<var>country_name</var>)</i>
<a name="IDX1889"></a>
</dt>
<dd><p>Construye los pol&iacute;gonos necesarios para dibujar
un pa&iacute;s coloreado. En caso de contener islas,
un pa&iacute;s tendr&aacute; asociados varios pol&iacute;gonos.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) make_poly_country(India)$
(%i4) apply(draw2d, %)$
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>make_poly_continent</b><i> (<var>continent_name</var>)</i>
<a name="IDX1890"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>make_poly_continent</b><i> (<var>country_list</var>)</i>
<a name="IDX1891"></a>
</dt>
<dd><p>Construye los pol&iacute;gonos necesarios para dibujar
un continente o lista de pa&iacute;ses coloreados.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) load(draw)$
(%i2) load(worldmap)$
(%i3) /* A continent */
      make_poly_continent(Africa)$
(%i4) apply(draw2d, %)$
(%i5) /* A list of countries */
      make_poly_continent([Germany,Denmark,Poland])$
(%i6) apply(draw2d, %)$
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC190" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_78.html#SEC302" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>diciembre, 2 2008</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
