<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<!-- Created by GNU Texinfo 5.1, http://www.gnu.org/software/texinfo/ -->
<head>
<title>Maxima Manual: Функции и переменные пакета graphs</title>

<meta name="description" content="Maxima Manual: Функции и переменные пакета graphs">
<meta name="keywords" content="Maxima Manual: Функции и переменные пакета graphs">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="maxima_toc.html#Top" rel="start" title="Top">
<link href="maxima_262.html#g_t_0423_043a_0430_0437_0430_0442_0435_043b_044c-_0444_0443_043d_043a_0446_0438_0439-_0438-_043f_0435_0440_0435_043c_0435_043d_043d_044b_0445" rel="index" title="Указатель функций и переменных">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="maxima_186.html#g_t_041f_0430_043a_0435_0442-graphs" rel="up" title="Пакет graphs">
<link href="maxima_189.html#g_t_041f_0430_043a_0435_0442-grobner" rel="next" title="Пакет grobner">
<link href="maxima_187.html#g_t_0412_0432_0435_0434_0435_043d_0438_0435-_0432-_043f_0430_043a_0435_0442-graphs" rel="previous" title="Введение в пакет graphs">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
blockquote.smallquotation {font-size: smaller}
div.display {margin-left: 3.2em}
div.example {margin-left: 3.2em}
div.indentedblock {margin-left: 3.2em}
div.lisp {margin-left: 3.2em}
div.smalldisplay {margin-left: 3.2em}
div.smallexample {margin-left: 3.2em}
div.smallindentedblock {margin-left: 3.2em; font-size: smaller}
div.smalllisp {margin-left: 3.2em}
kbd {font-style:oblique}
pre.display {font-family: inherit}
pre.format {font-family: inherit}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: inherit; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: inherit; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.nocodebreak {white-space:nowrap}
span.nolinebreak {white-space:nowrap}
span.roman {font-family:serif; font-weight:normal}
span.sansserif {font-family:sans-serif; font-weight:normal}
ul.no-bullet {list-style: none}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<link rel="icon" href="figures/favicon.ico">

</head>

<body lang="ru" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">
<a name="g_t_0424_0443_043d_043a_0446_0438_0438-_0438-_043f_0435_0440_0435_043c_0435_043d_043d_044b_0435-_043f_0430_043a_0435_0442_0430-graphs"></a>
<div class="header">
<p>
Previous: <a href="maxima_187.html#g_t_0412_0432_0435_0434_0435_043d_0438_0435-_0432-_043f_0430_043a_0435_0442-graphs" accesskey="p" rel="previous">Введение в пакет graphs</a>, Up: <a href="maxima_186.html#g_t_041f_0430_043a_0435_0442-graphs" accesskey="u" rel="up">Пакет graphs</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="maxima_262.html#g_t_0423_043a_0430_0437_0430_0442_0435_043b_044c-_0444_0443_043d_043a_0446_0438_0439-_0438-_043f_0435_0440_0435_043c_0435_043d_043d_044b_0445" title="Index" rel="index">Index</a>]</p>
</div>
<a name="Funkcii-i-peremennye-paketa-graphs"></a>
<h3 class="section">50.2 Функции и переменные пакета graphs</h3>

<a name="Postroenie-grafov"></a>
<h4 class="subsection">50.2.1 Построение графов</h4>

<a name="Item_003a-graphs_002fdeffn_002fcreate_005fgraph"></a><dl>
<dt><a name="index-create_005fgraph"></a>Функция: <strong>create_graph</strong> <em>(<var>v_list</var>, <var>e_list</var>)</em></dt>
<dt><a name="index-create_005fgraph-1"></a>Функция: <strong>create_graph</strong> <em>(<var>n</var>, <var>e_list</var>)</em></dt>
<dt><a name="index-create_005fgraph-2"></a>Функция: <strong>create_graph</strong> <em>(<var>v_list</var>, <var>e_list</var>, <var>directed</var>)</em></dt>
<dd><p>Создает новый граф с множеством вершин <var>v_list</var> и ребрами <var>e_list</var>.
</p>
<p><var>v_list</var> &ndash; список вершин (<code>[v1, v2,..., vn]</code>) или вершин вместе с метками
(<code>[[v1,l1], [v2,l2],..., [vn,ln]]</code>).
</p>
<p>Если <var>n</var> &ndash; число вершин, то они будут обозначаться целыми числами от 0 до n-1.
</p>
<p><var>e_list</var> &ndash; список ребер вида (<code>[e1, e2,..., em]</code>) или список ребер вместе с весами
(<code>[[e1, w1], ..., [em, wm]]</code>).
</p>
<p>Если <var>directed</var> отлично от <code>false</code>, то возвращается ориентированный граф.
</p>
<p>Пример 1: цикл с тремя вершинами:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([1,2,3], [[1,2], [2,3], [1,3]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre></div>

<p>Пример 2: цикл с тремя вершинами и весами ребер:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([1,2,3], [[[1,2], 1.0], [[2,3], 2.0],
                          [[1,3], 3.0]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre></div>

<p>Пример 3: ориентированный граф:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) d : create_graph(
        [1,2,3,4],
        [
         [1,3], [1,4],
         [2,3], [2,4]
        ],
        'directed = true)$
(%i3) print_graph(d)$
Digraph on 4 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :
  2 :  4  3
  1 :  4  3
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcopy_005fgraph"></a><dl>
<dt><a name="index-copy_005fgraph"></a>Функция: <strong>copy_graph</strong> <em>(<var>g</var>)</em></dt>
<dd><p>Возвращает копию графа <var>g</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcirculant_005fgraph"></a><dl>
<dt><a name="index-circulant_005fgraph"></a>Функция: <strong>circulant_graph</strong> <em>(<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Возвращает циркулянтный граф граф с параметрами <var>n</var> и <var>d</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : circulant_graph(10, [1,3])$
(%i3) print_graph(g)$
Graph on 10 vertices with 20 edges.
Adjacencies:
  9 :  2  6  0  8
  8 :  1  5  9  7
  7 :  0  4  8  6
  6 :  9  3  7  5
  5 :  8  2  6  4
  4 :  7  1  5  3
  3 :  6  0  4  2
  2 :  9  5  3  1
  1 :  8  4  2  0
  0 :  7  3  9  1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fclebsch_005fgraph"></a><dl>
<dt><a name="index-clebsch_005fgraph"></a>Функция: <strong>clebsch_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф Клебша (Clebsch graph).
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcomplement_005fgraph"></a><dl>
<dt><a name="index-complement_005fgraph"></a>Функция: <strong>complement_graph</strong> <em>(<var>g</var>)</em></dt>
<dd><p>Возвращает граф, дополнительный графу <var>g</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcomplete_005fbipartite_005fgraph"></a><dl>
<dt><a name="index-complete_005fbipartite_005fgraph"></a>Функция: <strong>complete_bipartite_graph</strong> <em>(<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Возвращает полный двудольный граф с <var>n+m</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcomplete_005fgraph"></a><dl>
<dt><a name="index-complete_005fgraph"></a>Функция: <strong>complete_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает полный граф с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcycle_005fdigraph"></a><dl>
<dt><a name="index-cycle_005fdigraph"></a>Функция: <strong>cycle_digraph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает ориентированный циклический граф с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcycle_005fgraph"></a><dl>
<dt><a name="index-cycle_005fgraph"></a>Функция: <strong>cycle_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает циклический граф с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcube_005fgraph"></a><dl>
<dt><a name="index-cube_005fgraph"></a>Функция: <strong>cube_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает <var>n</var>-мерный куб.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fdodecahedron_005fgraph"></a><dl>
<dt><a name="index-dodecahedron_005fgraph"></a>Функция: <strong>dodecahedron_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф додекаэдра.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fempty_005fgraph"></a><dl>
<dt><a name="index-empty_005fgraph"></a>Функция: <strong>empty_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает пустой граф с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fflower_005fsnark"></a><dl>
<dt><a name="index-flower_005fsnark"></a>Функция: <strong>flower_snark</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает цветочный граф (flower graph) с <var>4n</var> вершинами.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) f5 : flower_snark(5)$
(%i3) chromatic_index(f5);
(%o3)                           4
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002ffrom_005fadjacency_005fmatrix"></a><dl>
<dt><a name="index-from_005fadjacency_005fmatrix"></a>Функция: <strong>from_adjacency_matrix</strong> <em>(<var>A</var>)</em></dt>
<dd><p>Возвращает граф с матрицей смежности <var>A</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002ffrucht_005fgraph"></a><dl>
<dt><a name="index-frucht_005fgraph"></a>Функция: <strong>frucht_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф Фручта (Frucht graph).
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005fproduct"></a><dl>
<dt><a name="index-graph_005fproduct"></a>Функция: <strong>graph_product</strong> <em>(<var>g1</var>, <var>g1</var>)</em></dt>
<dd><p>Возвращает прямое произведение графов <var>g1</var> и <var>g2</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) grid : graph_product(path_graph(3), path_graph(4))$
(%i3) draw_graph(grid)$
</pre></div>
</dd></dl>

<img src="./figures/graphs01.png" alt="./figures/graphs01">

<a name="Item_003a-graphs_002fdeffn_002fgraph_005funion"></a><dl>
<dt><a name="index-graph_005funion"></a>Функция: <strong>graph_union</strong> <em>(<var>g1</var>, <var>g1</var>)</em></dt>
<dd><p>Возвращает объединение (сумму) графов <var>g1</var> и <var>g2</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgrid_005fgraph"></a><dl>
<dt><a name="index-grid_005fgraph"></a>Функция: <strong>grid_graph</strong> <em>(<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Возвращает решетку <var>n x m</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgrotzch_005fgraph"></a><dl>
<dt><a name="index-grotzch_005fgraph"></a>Функция: <strong>grotzch_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф Гротча (Grotzch graph).
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fheawood_005fgraph"></a><dl>
<dt><a name="index-heawood_005fgraph"></a>Функция: <strong>heawood_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф Хейвуда (Heawood graph).
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002ficosahedron_005fgraph"></a><dl>
<dt><a name="index-icosahedron_005fgraph"></a>Функция: <strong>icosahedron_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф икосаэдра.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002finduced_005fsubgraph"></a><dl>
<dt><a name="index-induced_005fsubgraph"></a>Функция: <strong>induced_subgraph</strong> <em>(<var>V</var>, <var>g</var>)</em></dt>
<dd><p>Возвращает граф, состоящий из подмножества вершин <var>V</var> графа <var>g</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) V : [0,1,2,3,4]$
(%i4) g : induced_subgraph(V, p)$
(%i5) print_graph(g)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  3  0
  3 :  2  4
  2 :  1  3
  1 :  0  2
  0 :  1  4
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fline_005fgraph"></a><dl>
<dt><a name="index-line_005fgraph"></a>Функция: <strong>line_graph</strong> <em>(<var>g</var>)</em></dt>
<dd><p>Возвращает граф двойственный (line graph) графу <var>g</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmake_005fgraph"></a><dl>
<dt><a name="index-make_005fgraph"></a>Функция: <strong>make_graph</strong> <em>(<var>vrt</var>, <var>f</var>)</em></dt>
<dt><a name="index-make_005fgraph-1"></a>Функция: <strong>make_graph</strong> <em>(<var>vrt</var>, <var>f</var>, <var>oriented</var>)</em></dt>
<dd><p>Создает граф, используя функцию предикат <var>f</var>.
</p>
<p><var>vrt</var> &ndash; есть список/множество вкршин или целое число. 
Если <var>vrt</var> есть целое число,
то вершины графа будут целыми от 1 до
<var>vrt</var>.
</p>
<p><var>f</var> &ndash; функция предикат.  Вершины <var>a</var> и <var>b</var> будут
соединены, если <code>f(a,b)=true</code>.
</p>
<p>Если <var>directed</var> не равно <var>false</var>, то граф будет ориентированным.
</p>
<p>Пример 1:
</p><div class="example">
<pre class="example">(%i1) load(&quot;graphs&quot;)$
(%i2) g : make_graph(powerset({1,2,3,4,5}, 2), disjointp)$
(%i3) is_isomorphic(g, petersen_graph());
(%o3)                         true
(%i4) get_vertex_label(1, g);
(%o4)                        {1, 2}
</pre></div>

<p>Пример 2:
</p><div class="example">
<pre class="example">(%i1) load(&quot;graphs&quot;)$
(%i2) f(i, j) := is (mod(j, i)=0)$
(%i3) g : make_graph(20, f, directed=true)$
(%i4) out_neighbors(4, g);
(%o4)                    [8, 12, 16, 20]
(%i5) in_neighbors(18, g);
(%o5)                    [1, 2, 3, 6, 9]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmycielski_005fgraph"></a><dl>
<dt><a name="index-mycielski_005fgraph"></a>Функция: <strong>mycielski_graph</strong> <em>(<var>g</var>)</em></dt>
<dd><p>Возвращает граф Мицельского (mycielskian graph) графа <var>g</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fnew_005fgraph"></a><dl>
<dt><a name="index-new_005fgraph"></a>Функция: <strong>new_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф без вершин и ребер.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fpath_005fdigraph"></a><dl>
<dt><a name="index-path_005fdigraph"></a>Функция: <strong>path_digraph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает ориентированный путь с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fpath_005fgraph"></a><dl>
<dt><a name="index-path_005fgraph"></a>Функция: <strong>path_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает путь с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fpetersen_005fgraph"></a><dl>
<dt><a name="index-petersen_005fgraph"></a>Функция: <strong>petersen_graph</strong> <em>()</em></dt>
<dt><a name="index-petersen_005fgraph-1"></a>Функция: <strong>petersen_graph</strong> <em>(<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Возвращает граф Петерсена <var>P_{n,d}</var>. Значения по умолчанию для
<var>n</var> и <var>d</var> есть <code>n=5</code> и <code>d=2</code>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fbipartite_005fgraph"></a><dl>
<dt><a name="index-random_005fbipartite_005fgraph"></a>Функция: <strong>random_bipartite_graph</strong> <em>(<var>a</var>, <var>b</var>, <var>p</var>)</em></dt>
<dd><p>Возвращает случайный двудольный граф с <code>a+b</code> вершинами. 
Каждая вершина присутствует с вероятностью <var>p</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fdigraph"></a><dl>
<dt><a name="index-random_005fdigraph"></a>Функция: <strong>random_digraph</strong> <em>(<var>n</var>, <var>p</var>)</em></dt>
<dd><p>Возвращает случайный ориентированный граф с <var>n</var> вершинами. 
Каждое ребро присутствует с вероятностью <var>p</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fregular_005fgraph"></a><dl>
<dt><a name="index-random_005fregular_005fgraph"></a>Функция: <strong>random_regular_graph</strong> <em>(<var>n</var>)</em></dt>
<dt><a name="index-random_005fregular_005fgraph-1"></a>Функция: <strong>random_regular_graph</strong> <em>(<var>n</var>, <var>d</var>)</em></dt>
<dd><p>Возвращает случайный <var>d</var>-регулярный граф с <var>n</var> вершинами. 
Значение по умолчанию для <var>d</var> есть <code>d=3</code>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fgraph"></a><dl>
<dt><a name="index-random_005fgraph"></a>Функция: <strong>random_graph</strong> <em>(<var>n</var>, <var>p</var>)</em></dt>
<dd><p>Возвращает случайный граф с <var>n</var> вершинами. 
Каждое ребро присутствует с вероятностью <var>p</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fgraph1"></a><dl>
<dt><a name="index-random_005fgraph1"></a>Функция: <strong>random_graph1</strong> <em>(<var>n</var>, <var>m</var>)</em></dt>
<dd><p>Возвращает случайный граф с <var>n</var> вершинами и <var>m</var> случайными ребрами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005fnetwork"></a><dl>
<dt><a name="index-random_005fnetwork"></a>Функция: <strong>random_network</strong> <em>(<var>n</var>, <var>p</var>, <var>w</var>)</em></dt>
<dd><p>Возвращает случайную сеть на <var>n</var> вершинах. Каждое ребро присутствует
с вероятностью <var>p</var> и имеет вес в интервале <code>[0,w]</code>. 
Эта функция возвращает список <code>[network, source, sink]</code>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) [net, s, t] : random_network(50, 0.2, 10.0);
(%o2)                   [DIGRAPH, 50, 51]
(%i3) max_flow(net, s, t)$
(%i4) first(%);
(%o4)                   27.65981397932507
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005ftournament"></a><dl>
<dt><a name="index-random_005ftournament"></a>Функция: <strong>random_tournament</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает случайный полный ориентированный граф (tournament) с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002frandom_005ftree"></a><dl>
<dt><a name="index-random_005ftree"></a>Функция: <strong>random_tree</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает случайное дерево с <var>n</var> вершинами.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002ftutte_005fgraph"></a><dl>
<dt><a name="index-tutte_005fgraph"></a>Функция: <strong>tutte_graph</strong> <em>()</em></dt>
<dd><p>Возвращает граф Татта (Tutte).
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002funderlying_005fgraph"></a><dl>
<dt><a name="index-underlying_005fgraph"></a>Функция: <strong>underlying_graph</strong> <em>(<var>g</var>)</em></dt>
<dd><p>Возвращает неориентированный граф, получаемый заменой ребер ориентированного графа <var>g</var> на неориентированные.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fwheel_005fgraph"></a><dl>
<dt><a name="index-wheel_005fgraph"></a>Функция: <strong>wheel_graph</strong> <em>(<var>n</var>)</em></dt>
<dd><p>Возвращает колесный граф (wheel graph) с <var>n+1</var> вершинами.
</p></dd></dl>

<a name="Svoistva-grafov"></a>
<h4 class="subsection">50.2.2 Свойства графов</h4>

<a name="Item_003a-graphs_002fdeffn_002fadjacency_005fmatrix"></a><dl>
<dt><a name="index-adjacency_005fmatrix"></a>Функция: <strong>adjacency_matrix</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает матрицу смежности графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c5 : cycle_graph(4)$
(%i3) adjacency_matrix(c5);
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
(%o3)                    [            ]
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002faverage_005fdegree"></a><dl>
<dt><a name="index-average_005fdegree"></a>Функция: <strong>average_degree</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает среднюю степень вершин графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) average_degree(grotzch_graph());
                               40
(%o2)                          --
                               11
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fbiconected_005fcomponents"></a><dl>
<dt><a name="index-biconected_005fcomponents"></a>Функция: <strong>biconected_components</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает (наборы вершин) 2-связных компонент графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph(
            [1,2,3,4,5,6,7],
            [
             [1,2],[2,3],[2,4],[3,4],
             [4,5],[5,6],[4,6],[6,7]
            ])$
(%i3) biconnected_components(g);
(%o3)        [[6, 7], [4, 5, 6], [1, 2], [2, 3, 4]]
</pre></div>

<img src="./figures/graphs13.png" alt="./figures/graphs13">
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fbipartition"></a><dl>
<dt><a name="index-bipartition"></a>Функция: <strong>bipartition</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает двудольное разложение графа <var>gr</var> или пустой список,
если <var>gr</var> не является двудольным.
</p>
<p>Пример:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) h : heawood_graph()$
(%i3) [A,B]:bipartition(h);
(%o3)  [[8, 12, 6, 10, 0, 2, 4], [13, 5, 11, 7, 9, 1, 3]]
(%i4) draw_graph(h, show_vertices=A, program=circular)$
</pre></div>
</dd></dl>

<img src="./figures/graphs02.png" alt="./figures/graphs02">

<a name="Item_003a-graphs_002fdeffn_002fchromatic_005findex"></a><dl>
<dt><a name="index-chromatic_005findex"></a>Функция: <strong>chromatic_index</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает хроматический индекс графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) chromatic_index(p);
(%o3)                           4
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fchromatic_005fnumber"></a><dl>
<dt><a name="index-chromatic_005fnumber"></a>Функция: <strong>chromatic_number</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает хроматическое число графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) chromatic_number(cycle_graph(5));
(%o2)                           3
(%i3) chromatic_number(cycle_graph(6));
(%o3)                           2
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fclear_005fedge_005fweight"></a><dl>
<dt><a name="index-clear_005fedge_005fweight"></a>Функция: <strong>clear_edge_weight</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Удаляет вес ребра <var>e</var> в графе <var>gr</var>.
</p>
<p>Пример:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph(3, [[[0,1], 1.5], [[1,2], 1.3]])$
(%i3) get_edge_weight([0,1], g);
(%o3)                          1.5
(%i4) clear_edge_weight([0,1], g)$
(%i5) get_edge_weight([0,1], g);
(%o5)                           1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fclear_005fvertex_005flabel"></a><dl>
<dt><a name="index-clear_005fvertex_005flabel"></a>Функция: <strong>clear_vertex_label</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Удаляет метку вершины <var>v</var> в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                        Zero
(%i4) clear_vertex_label(0, g);
(%o4)                        done
(%i5) get_vertex_label(0, g);
(%o5)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fconnected_005fcomponents"></a><dl>
<dt><a name="index-connected_005fcomponents"></a>Функция: <strong>connected_components</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает (наборы вершин) компоненты связности графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g: graph_union(cycle_graph(5), path_graph(4))$
(%i3) connected_components(g);
(%o3)           [[1, 2, 3, 4, 0], [8, 7, 6, 5]]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fdiameter"></a><dl>
<dt><a name="index-diameter"></a>Функция: <strong>diameter</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает диаметр графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) diameter(dodecahedron_graph());
(%o2)                          5
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fedge_005fcoloring"></a><dl>
<dt><a name="index-edge_005fcoloring"></a>Функция: <strong>edge_coloring</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает оптимальную раскраску ребер графа <var>gr</var>.
</p>
<p>Эта функция возвращает хроматический индекс и список, представляющий раскраску ребер графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) [ch_index, col] : edge_coloring(p);
(%o3) [4, [[[0, 5], 3], [[5, 7], 1], [[0, 1], 1], [[1, 6], 2], 
[[6, 8], 1], [[1, 2], 3], [[2, 7], 4], [[7, 9], 2], [[2, 3], 2], 
[[3, 8], 3], [[5, 8], 2], [[3, 4], 1], [[4, 9], 4], [[6, 9], 3], 
[[0, 4], 2]]]
(%i4) assoc([0,1], col);
(%o4)                           1
(%i5) assoc([0,5], col);
(%o5)                           3
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fdegree_005fsequence"></a><dl>
<dt><a name="index-degree_005fsequence"></a>Функция: <strong>degree_sequence</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает список степеней вершин графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) degree_sequence(random_graph(10, 0.4));
(%o2)            [3, 3, 3, 4, 4, 4, 5, 5, 6, 7]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fedges"></a><dl>
<dt><a name="index-edges"></a>Функция: <strong>edges</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает список ребер/дуг ориентированного или неориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) edges(complete_graph(4));
(%o2)   [[2, 3], [1, 3], [1, 2], [0, 3], [0, 2], [0, 1]]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fget_005fedge_005fweight"></a><dl>
<dt><a name="index-get_005fedge_005fweight"></a>Функция: <strong>get_edge_weight</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dt><a name="index-get_005fedge_005fweight-1"></a>Функция: <strong>get_edge_weight</strong> <em>(<var>e</var>, <var>gr</var>, <var>ifnot</var>)</em></dt>
<dd><p>Возвращает вес ребра <var>e</var> графа <var>gr</var>.
</p>
<p>Если вес не присвоен ребру, то возвращается 1. 
Если ребро в графе отсутствует, то выдается ошибка или 
возвращает необязательный аргумент <var>ifnot</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c5 : cycle_graph(5)$
(%i3) get_edge_weight([1,2], c5);
(%o3)                           1
(%i4) set_edge_weight([1,2], 2.0, c5);
(%o4)                         done
(%i5) get_edge_weight([1,2], c5);
(%o5)                          2.0
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fget_005fvertex_005flabel"></a><dl>
<dt><a name="index-get_005fvertex_005flabel"></a>Функция: <strong>get_vertex_label</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает метку вершины <var>v</var> графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                         Zero
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005fcharpoly"></a><dl>
<dt><a name="index-graph_005fcharpoly"></a>Функция: <strong>graph_charpoly</strong> <em>(<var>gr</var>, <var>x</var>)</em></dt>
<dd><p>Возвращает характеристический многочлен (от переменной <var>x</var>) графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) graph_charpoly(p, x), factor;
                                   5        4
(%o3)               (x - 3) (x - 1)  (x + 2)
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005fcenter"></a><dl>
<dt><a name="index-graph_005fcenter"></a>Функция: <strong>graph_center</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает центр графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_center(g);
(%o3)                         [12]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005feigenvalues"></a><dl>
<dt><a name="index-graph_005feigenvalues"></a>Функция: <strong>graph_eigenvalues</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает собственные значения графа <var>gr</var>. Значение возвращаются
в том же формате, что возвращает Maxima функция <code>eigenvalue</code>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) graph_eigenvalues(p);
(%o3)               [[3, - 2, 1], [1, 4, 5]]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005fperiphery"></a><dl>
<dt><a name="index-graph_005fperiphery"></a>Функция: <strong>graph_periphery</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает периферию графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_periphery(g);
(%o3)                    [24, 20, 4, 0]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005fsize"></a><dl>
<dt><a name="index-graph_005fsize"></a>Функция: <strong>graph_size</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает число вершин в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) graph_size(p);
(%o3)                          10
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph_005forder"></a><dl>
<dt><a name="index-graph_005forder"></a>Функция: <strong>graph_order</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает число ребер в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) graph_order(p);
(%o3)                          15
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgirth"></a><dl>
<dt><a name="index-girth"></a>Функция: <strong>girth</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает длину наикратчайшего цикла в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : heawood_graph()$
(%i3) girth(g);
(%o3)                           5
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fhamilton_005fcycle"></a><dl>
<dt><a name="index-hamilton_005fcycle"></a>Функция: <strong>hamilton_cycle</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает гамильтонов цикл графа <var>gr</var> или пустой список, если граф <var>gr</var> не является гамильтоновым.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c : cube_graph(3)$
(%i3) hc : hamilton_cycle(c);
(%o3)              [7, 3, 2, 6, 4, 0, 1, 5, 7]
(%i4) draw_graph(c, show_edges=vertices_to_cycle(hc))$
</pre></div>
</dd></dl>

<img src="./figures/graphs03.png" alt="./figures/graphs03">

<a name="Item_003a-graphs_002fdeffn_002fhamilton_005fpath"></a><dl>
<dt><a name="index-hamilton_005fpath"></a>Функция: <strong>hamilton_path</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает гамильтонов путь графа <var>gr</var> или пустой список, если граф <var>gr</var> не 
имеет гамильтонова пути.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) hp : hamilton_path(p);
(%o3)            [0, 5, 7, 2, 1, 6, 8, 3, 4, 9]
(%i4) draw_graph(p, show_edges=vertices_to_path(hp))$
</pre></div>
</dd></dl>

<img src="./figures/graphs04.png" alt="./figures/graphs04">

<a name="Item_003a-graphs_002fdeffn_002fisomorphism"></a><dl>
<dt><a name="index-isomorphism"></a>Функция: <strong>isomorphism</strong> <em>(<var>gr1</var>, <var>gr2</var>)</em></dt>
<dd>
<p>Возвращает хэш-таблицу изоморфизма между (ориентированными) графами 
<var>gr1</var> и <var>gr2</var>. Если <var>gr1</var> и <var>gr2</var> не изоморфны,
то возвращается <code>false</code>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) hash_table_data(isomorphism(clk5, petersen_graph()));
(%o3) [8 -&gt; 9, 7 -&gt; 8, 4 -&gt; 7, 3 -&gt; 6, 1 -&gt; 5, 0 -&gt; 4, 5 -&gt; 3, 
                                          6 -&gt; 2, 2 -&gt; 1, 9 -&gt; 0]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fin_005fneighbors"></a><dl>
<dt><a name="index-in_005fneighbors"></a>Функция: <strong>in_neighbors</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает список входящих соседей (in-neighbors) вершины <var>v</var> 
ориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                          [1]
(%i4) out_neighbors(2, p);
(%o4)                          []
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fbiconnected"></a><dl>
<dt><a name="index-is_005fbiconnected"></a>Функция: <strong>is_biconnected</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если граф <var>gr</var> 2-связный, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_biconnected(cycle_graph(5));
(%o2)                         true
(%i3) is_biconnected(path_graph(5));
(%o3)                         false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fbipartite"></a><dl>
<dt><a name="index-is_005fbipartite"></a>Функция: <strong>is_bipartite</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если граф <var>gr</var> двудольный, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_bipartite(petersen_graph());
(%o2)                        false
(%i3) is_bipartite(heawood_graph());
(%o3)                        true
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fconnected"></a><dl>
<dt><a name="index-is_005fconnected"></a>Функция: <strong>is_connected</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если граф <var>gr</var> связный, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_connected(graph_union(cycle_graph(4), path_graph(3)));
(%o2)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fdigraph"></a><dl>
<dt><a name="index-is_005fdigraph"></a>Функция: <strong>is_digraph</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если <var>gr</var> является ориентированным графом, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_digraph(path_graph(5));
(%o2)                        false
(%i3) is_digraph(path_digraph(5));
(%o3)                        true
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fedge_005fin_005fgraph"></a><dl>
<dt><a name="index-is_005fedge_005fin_005fgraph"></a>Функция: <strong>is_edge_in_graph</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если <var>e</var> есть ребро (ориентированного) графа <var>g</var>,
и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_edge_in_graph([2,3], c4);
(%o3)                        true
(%i4) is_edge_in_graph([3,2], c4);
(%o4)                        true
(%i5) is_edge_in_graph([2,4], c4);
(%o5)                        false
(%i6) is_edge_in_graph([3,2], cycle_digraph(4));
(%o6)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fgraph"></a><dl>
<dt><a name="index-is_005fgraph"></a>Функция: <strong>is_graph</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если <var>gr</var> является графом, 
и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_graph(path_graph(5));
(%o2)                        true
(%i3) is_graph(path_digraph(5));
(%o3)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fgraph_005for_005fdigraph"></a><dl>
<dt><a name="index-is_005fgraph_005for_005fdigraph"></a>Функция: <strong>is_graph_or_digraph</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если <var>gr</var> является графом или ориентированным графом, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_graph_or_digraph(path_graph(5));
(%o2)                        true
(%i3) is_graph_or_digraph(path_digraph(5));
(%o3)                        true
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fisomorphic"></a><dl>
<dt><a name="index-is_005fisomorphic"></a>Функция: <strong>is_isomorphic</strong> <em>(<var>gr1</var>, <var>gr2</var>)</em></dt>
<dd>
<p>Возвращает <code>true</code>, если (ориентированные) графы <var>gr1</var> и <var>gr2</var> изоморфны,
и <code>false</code> в противном случае.
</p>
<p>См. также <code>isomorphism</code>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) is_isomorphic(clk5, petersen_graph());
(%o3)                       true
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fplanar"></a><dl>
<dt><a name="index-is_005fplanar"></a>Функция: <strong>is_planar</strong> <em>(<var>gr</var>)</em></dt>
<dd>
<p>Возвращает <code>true</code>, если <var>gr</var> является планарным графом, и <code>false</code> в противном случае.
</p>
<p>Используется алгоритм Демукрона, который является квадратичным по времени.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_planar(dodecahedron_graph());
(%o2)                         true
(%i3) is_planar(petersen_graph());
(%o3)                         false
(%i4) is_planar(petersen_graph(10,2));
(%o4)                         true
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fsconnected"></a><dl>
<dt><a name="index-is_005fsconnected"></a>Функция: <strong>is_sconnected</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если ориентированный граф <var>gr</var> является сильно связным, 
и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_sconnected(cycle_digraph(5));
(%o2)                        true
(%i3) is_sconnected(path_digraph(5));
(%o3)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005fvertex_005fin_005fgraph"></a><dl>
<dt><a name="index-is_005fvertex_005fin_005fgraph"></a>Функция: <strong>is_vertex_in_graph</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если <var>v</var> есть вершина в графе <var>g</var>, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_vertex_in_graph(0, c4);
(%o3)                        true
(%i4) is_vertex_in_graph(6, c4);
(%o4)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fis_005ftree"></a><dl>
<dt><a name="index-is_005ftree"></a>Функция: <strong>is_tree</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает <code>true</code>, если граф <var>gr</var> является деревом, и <code>false</code> в противном случае.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) is_tree(random_tree(4));
(%o2)                        true
(%i3) is_tree(graph_union(random_tree(4), random_tree(5)));
(%o3)                        false
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002flaplacian_005fmatrix"></a><dl>
<dt><a name="index-laplacian_005fmatrix"></a>Функция: <strong>laplacian_matrix</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает матрицу Лапласа графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) laplacian_matrix(cycle_graph(5));
                   [  2   - 1   0    0   - 1 ]
                   [                         ]
                   [ - 1   2   - 1   0    0  ]
                   [                         ]
(%o2)              [  0   - 1   2   - 1   0  ]
                   [                         ]
                   [  0    0   - 1   2   - 1 ]
                   [                         ]
                   [ - 1   0    0   - 1   2  ]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmax_005fclique"></a><dl>
<dt><a name="index-max_005fclique"></a>Функция: <strong>max_clique</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает максимальную клику графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : random_graph(100, 0.5)$
(%i3) max_clique(g);
(%o3)          [2, 6, 13, 17, 21, 23, 31, 62, 65]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmax_005fdegree"></a><dl>
<dt><a name="index-max_005fdegree"></a>Функция: <strong>max_degree</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает максимальную степень вершины графа <var>gr</var> и саму вершину
с максимальной степенью.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : random_graph(100, 0.02)$
(%i3) max_degree(g);
(%o3)                        [6, 70]
(%i4) vertex_degree(95, g);
(%o4)                           3
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmax_005fflow"></a><dl>
<dt><a name="index-max_005fflow"></a>Функция: <strong>max_flow</strong> <em>(<var>net</var>, <var>s</var>, <var>t</var>)</em></dt>
<dd><p>Возвращает максимальный поток через сеть <var>net</var> с истоком <var>s</var> и стоком <var>t</var>.
</p>
<p>Функция возвращает значение максимального потока и список весов ребер
оптимального потока.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) net : create_graph(
  [1,2,3,4,5,6],
  [[[1,2], 1.0],
   [[1,3], 0.3],
   [[2,4], 0.2],
   [[2,5], 0.3],
   [[3,4], 0.1],
   [[3,5], 0.1],
   [[4,6], 1.0],
   [[5,6], 1.0]],
  directed=true)$
(%i3) [flow_value, flow] : max_flow(net, 1, 6);
(%o3) [0.7, [[[1, 2], 0.5], [[1, 3], 0.2], [[2, 4], 0.2], 
[[2, 5], 0.3], [[3, 4], 0.1], [[3, 5], 0.1], [[4, 6], 0.3], 
[[5, 6], 0.4]]]
(%i4) fl : 0$
(%i5) for u in out_neighbors(1, net)
     do fl : fl + assoc([1, u], flow)$
(%i6) fl;
(%o6)                          0.7
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmax_005findependent_005fset"></a><dl>
<dt><a name="index-max_005findependent_005fset"></a>Функция: <strong>max_independent_set</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает максимальное независимое множество графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) d : dodecahedron_graph()$
(%i3) mi : max_independent_set(d);
(%o3)             [0, 3, 5, 9, 10, 11, 18, 19]
(%i4) draw_graph(d, show_vertices=mi)$
</pre></div>
</dd></dl>

<img src="./figures/graphs05.png" alt="./figures/graphs05">

<a name="Item_003a-graphs_002fdeffn_002fmax_005fmatching"></a><dl>
<dt><a name="index-max_005fmatching"></a>Функция: <strong>max_matching</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает максимальный набор ребер, не имеющих общих вершин (maximal matching), для графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) d : dodecahedron_graph()$
(%i3) m : max_matching(d);
(%o3) [[1, 2], [3, 4], [0, 15], [11, 16], [12, 17], [13, 18], 
                               [14, 19], [6, 10], [8, 9], [5, 7]]
(%i4) draw_graph(d, show_edges=m)$
</pre></div>
</dd></dl>

<img src="./figures/graphs06.png" alt="./figures/graphs06">

<a name="Item_003a-graphs_002fdeffn_002fmin_005fdegree"></a><dl>
<dt><a name="index-min_005fdegree"></a>Функция: <strong>min_degree</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает минимальную степень вершины графа <var>gr</var> и саму вершину
с минимальной степенью.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : random_graph(100, 0.1)$
(%i3) min_degree(g);
(%o3)                        [4, 83]
(%i4) vertex_degree(21, g);
(%o4)                          12
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fmin_005fvertex_005fcover"></a><dl>
<dt><a name="index-min_005fvertex_005fcover"></a>Функция: <strong>min_vertex_cover</strong> <em>(<var>gr</var>)</em></dt>
<dd>
<p>Возвращает минимальное вершинное покрытие графа <var>gr</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fminimum_005fspanning_005ftree"></a><dl>
<dt><a name="index-minimum_005fspanning_005ftree"></a>Функция: <strong>minimum_spanning_tree</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает минимальный каркас (минимальное остовное дерево) графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : graph_product(path_graph(10), path_graph(10))$
(%i3) t : minimum_spanning_tree(g)$
(%i4) draw_graph(g, show_edges=edges(t))$
</pre></div>
</dd></dl>

<img src="./figures/graphs07.png" alt="./figures/graphs07">

<a name="Item_003a-graphs_002fdeffn_002fneighbors"></a><dl>
<dt><a name="index-neighbors"></a>Функция: <strong>neighbors</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает список соседей вершины <var>v</var> в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : petersen_graph()$
(%i3) neighbors(3, p);
(%o3)                       [4, 8, 2]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fodd_005fgirth"></a><dl>
<dt><a name="index-odd_005fgirth"></a>Функция: <strong>odd_girth</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает длину наикратчайшего нечетного цикла в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : graph_product(cycle_graph(4), cycle_graph(7))$
(%i3) girth(g);
(%o3)                           4
(%i4) odd_girth(g);
(%o4)                           7
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fout_005fneighbors"></a><dl>
<dt><a name="index-out_005fneighbors"></a>Функция: <strong>out_neighbors</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает список исходящих соседей (out-neighbors) вершины <var>v</var> 
ориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                           [1]
(%i4) out_neighbors(2, p);
(%o4)                           []
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fplanar_005fembedding"></a><dl>
<dt><a name="index-planar_005fembedding"></a>Функция: <strong>planar_embedding</strong> <em>(<var>gr</var>)</em></dt>
<dd>
<p>Возвращает список поверхностных маршрутов (facial walks) в плоской укладке графа <var>gr</var>,
и <code>false</code>, если граф <var>gr</var> не является планарным.
</p>
<p>Граф <var>gr</var> должен быть бисвязным.
</p>
<p>Используется алгоритм Демукрона, который является квадратичным по времени.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) planar_embedding(grid_graph(3,3));
(%o2) [[3, 6, 7, 8, 5, 2, 1, 0], [4, 3, 0, 1], [3, 4, 7, 6], 
                                      [8, 7, 4, 5], [1, 2, 5, 4]]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fprint_005fgraph"></a><dl>
<dt><a name="index-print_005fgraph"></a>Функция: <strong>print_graph</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Выводит некоторую информацию о графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c5 : cycle_graph(5)$
(%i3) print_graph(c5)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  0  3
  3 :  4  2
  2 :  3  1
  1 :  2  0
  0 :  4  1
(%i4) dc5 : cycle_digraph(5)$
(%i5) print_graph(dc5)$
Digraph on 5 vertices with 5 arcs.
Adjacencies:
  4 :  0
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i6) out_neighbors(0, dc5);
(%o6)                          [1]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fradius"></a><dl>
<dt><a name="index-radius"></a>Функция: <strong>radius</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает радиус графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) radius(dodecahedron_graph());
(%o2)                           5
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fset_005fedge_005fweight"></a><dl>
<dt><a name="index-set_005fedge_005fweight"></a>Функция: <strong>set_edge_weight</strong> <em>(<var>e</var>, <var>w</var>, <var>gr</var>)</em></dt>
<dd><p>Присваивает вес <var>w</var> ребру <var>e</var> графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([1, 2], [[[1,2], 1.2]])$
(%i3) get_edge_weight([1,2], g);
(%o3)                          1.2
(%i4) set_edge_weight([1,2], 2.1, g);
(%o4)                         done
(%i5) get_edge_weight([1,2], g);
(%o5)                          2.1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fset_005fvertex_005flabel"></a><dl>
<dt><a name="index-set_005fvertex_005flabel"></a>Функция: <strong>set_vertex_label</strong> <em>(<var>v</var>, <var>l</var>, <var>gr</var>)</em></dt>
<dd><p>Присваивает метку <var>l</var> вершине <var>v</var> графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : create_graph([[1, &quot;One&quot;], [2, &quot;Two&quot;]], [[1,2]])$
(%i3) get_vertex_label(1, g);
(%o3)                           One
(%i4) set_vertex_label(1, &quot;oNE&quot;, g);
(%o4)                          done
(%i5) get_vertex_label(1, g);
(%o5)                           oNE
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fshortest_005fpath"></a><dl>
<dt><a name="index-shortest_005fpath"></a>Функция: <strong>shortest_path</strong> <em>(<var>u</var>, <var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает кратчайший путь из вершины <var>u</var> в вершину <var>v</var> в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) d : dodecahedron_graph()$
(%i3) path : shortest_path(0, 7, d);
(%o3)                    [0, 1, 19, 13, 7]
(%i4) draw_graph(d, show_edges=vertices_to_path(path))$
</pre></div>
</dd></dl>

<img src="./figures/graphs08.png" alt="./figures/graphs08">

<a name="Item_003a-graphs_002fdeffn_002fstrong_005fcomponents"></a><dl>
<dt><a name="index-strong_005fcomponents"></a>Функция: <strong>strong_components</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает сильную компоненту ориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) t : random_tournament(4)$
(%i3) strong_components(t);
(%o3)                 [[2], [0], [1], [3]]
(%i4) vertex_out_degree(3, t);
(%o4)                           2
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002ftopological_005fsort"></a><dl>
<dt><a name="index-topological_005fsort"></a>Функция: <strong>topological_sort</strong> <em>(<var>dag</var>)</em></dt>
<dd>
<p>Возвращает топологическую сортировку вершин ориентированного графа
<var>dag</var>, или пустой список, если <var>dag</var> не является ориентированным ациклическим графом.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g:create_graph(
         [1,2,3,4,5],
         [
          [1,2], [2,5], [5,3],
          [5,4], [3,4], [1,3]
         ],
         directed=true)$
(%i3) topological_sort(g);
(%o3)                     [1, 2, 5, 3, 4]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005fdegree"></a><dl>
<dt><a name="index-vertex_005fdegree"></a>Функция: <strong>vertex_degree</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает степень вершины <var>v</var> в графе <var>gr</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005fdistance"></a><dl>
<dt><a name="index-vertex_005fdistance"></a>Функция: <strong>vertex_distance</strong> <em>(<var>u</var>, <var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает длину кратчайшего пути между вершинами <var>u</var> и <var>v</var> в
(ориентированном) графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) d : dodecahedron_graph()$
(%i3) vertex_distance(0, 7, d);
(%o3)                           4
(%i4) shortest_path(0, 7, d);
(%o4)                   [0, 1, 19, 13, 7]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005feccentricity"></a><dl>
<dt><a name="index-vertex_005feccentricity"></a>Функция: <strong>vertex_eccentricity</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd>
<p>Возвращает эксцентриситет вершины <var>v</var> графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g:cycle_graph(7)$
(%i3) vertex_eccentricity(0, g);
(%o4)                            3
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005fin_005fdegree"></a><dl>
<dt><a name="index-vertex_005fin_005fdegree"></a>Функция: <strong>vertex_in_degree</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает входящую степень вершины <var>v</var> ориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p5 : path_digraph(5)$
(%i3) print_graph(p5)$
Digraph on 5 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i4) vertex_in_degree(4, p5);
(%o4)                           1
(%i5) in_neighbors(4, p5);
(%o5)                          [3]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005fout_005fdegree"></a><dl>
<dt><a name="index-vertex_005fout_005fdegree"></a>Функция: <strong>vertex_out_degree</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Возвращает исходящую степень вершины <var>v</var> ориентированного графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) t : random_tournament(10)$
(%i3) vertex_out_degree(0, t);
(%o3)                           6
(%i4) out_neighbors(0, t);
(%o4)                  [9, 6, 4, 3, 2, 1]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertices"></a><dl>
<dt><a name="index-vertices"></a>Функция: <strong>vertices</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает список вершин графа  <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) vertices(complete_graph(4));
(%o2)                     [3, 2, 1, 0]
</pre></div>
</dd></dl>

<a name="Izmenenie-grafov"></a>
<h4 class="subsection">50.2.3 Изменение графов</h4>

<a name="Item_003a-graphs_002fdeffn_002fadd_005fedge"></a><dl>
<dt><a name="index-add_005fedge"></a>Функция: <strong>add_edge</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Добавляет ребро <var>e</var> к графу <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p : path_graph(4)$
(%i3) neighbors(0, p);
(%o3)                          [1]
(%i4) add_edge([0,3], p);
(%o4)                         done
(%i5) neighbors(0, p);
(%o5)                        [3, 1]
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fadd_005fedges"></a><dl>
<dt><a name="index-add_005fedges"></a>Функция: <strong>add_edges</strong> <em>(<var>e_list</var>, <var>gr</var>)</em></dt>
<dd><p>Добавляет ребра из списка <var>e_list</var> к графу <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : empty_graph(3)$
(%i3) add_edges([[0,1],[1,2]], g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  1
  1 :  2  0
  0 :  1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fadd_005fvertex"></a><dl>
<dt><a name="index-add_005fvertex"></a>Функция: <strong>add_vertex</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Добавляет вершину <var>v</var> к графу <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : path_graph(2)$
(%i3) add_vertex(2, g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 1 edges.
Adjacencies:
  2 :
  1 :  0
  0 :  1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fadd_005fvertices"></a><dl>
<dt><a name="index-add_005fvertices"></a>Функция: <strong>add_vertices</strong> <em>(<var>v_list</var>, <var>gr</var>)</em></dt>
<dd><p>Добавляет все вершины из списка <var>v_list</var> к графу <var>gr</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fconnect_005fvertices"></a><dl>
<dt><a name="index-connect_005fvertices"></a>Функция: <strong>connect_vertices</strong> <em>(<var>v_list</var>, <var>u_list</var>, <var>gr</var>)</em></dt>
<dd><p>Соединяет все вершины из списка <var>v_list</var> с вершинами из списка <var>u_list</var> 
в графе <var>gr</var>.
</p>
<p><var>v_list</var> и <var>u_list</var> могут быть отдельными вершинами или списками вершин.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g : empty_graph(4)$
(%i3) connect_vertices(0, [1,2,3], g)$
(%i4) print_graph(g)$
Graph on 4 vertices with 3 edges.
Adjacencies:
  3 :  0
  2 :  0
  1 :  0
  0 :  3  2  1
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fcontract_005fedge"></a><dl>
<dt><a name="index-contract_005fedge"></a>Функция: <strong>contract_edge</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Стягивает ребро <var>e</var> в графе <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g: create_graph(
      8, [[0,3],[1,3],[2,3],[3,4],[4,5],[4,6],[4,7]])$
(%i3) print_graph(g)$
Graph on 8 vertices with 7 edges.
Adjacencies:
  7 :  4
  6 :  4
  5 :  4
  4 :  7  6  5  3
  3 :  4  2  1  0
  2 :  3
  1 :  3
  0 :  3
(%i4) contract_edge([3,4], g)$
(%i5) print_graph(g)$
Graph on 7 vertices with 6 edges.
Adjacencies:
  7 :  3
  6 :  3
  5 :  3
  3 :  5  6  7  2  1  0
  2 :  3
  1 :  3
  0 :  3
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fremove_005fedge"></a><dl>
<dt><a name="index-remove_005fedge"></a>Функция: <strong>remove_edge</strong> <em>(<var>e</var>, <var>gr</var>)</em></dt>
<dd><p>Удаляет ребро <var>e</var> из графа <var>gr</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) c3 : cycle_graph(3)$
(%i3) remove_edge([0,1], c3)$
(%i4) print_graph(c3)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  0  1
  1 :  2
  0 :  2
</pre></div>
</dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fremove_005fvertex"></a><dl>
<dt><a name="index-remove_005fvertex"></a>Функция: <strong>remove_vertex</strong> <em>(<var>v</var>, <var>gr</var>)</em></dt>
<dd><p>Удаляет вершину <var>v</var> из графа <var>gr</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertex_005fcoloring"></a><dl>
<dt><a name="index-vertex_005fcoloring"></a>Функция: <strong>vertex_coloring</strong> <em>(<var>gr</var>)</em></dt>
<dd><p>Возвращает оптимальную раскраску вершин графа <var>gr</var>.
</p>
<p>Функция возвращает хроматическое число и список, 
описывающий раскраску вершин графа <var>g</var>.
</p>
<p>Пример:
</p><div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) p:petersen_graph()$
(%i3) vertex_coloring(p);
(%o3) [3, [[0, 2], [1, 3], [2, 2], [3, 3], [4, 1], [5, 3], 
                                 [6, 1], [7, 1], [8, 2], [9, 2]]]
</pre></div>
</dd></dl>

<a name="Chtenie-i-zapisx-failov"></a>
<h4 class="subsection">50.2.4 Чтение и запись файлов</h4>

<a name="Item_003a-graphs_002fdeffn_002fdimacs_005fexport"></a><dl>
<dt><a name="index-dimacs_005fexport"></a>Функция: <strong>dimacs_export</strong> <em>(<var>gr</var>, <var>fl</var>)</em></dt>
<dt><a name="index-dimacs_005fexport-1"></a>Функция: <strong>dimacs_export</strong> <em>(<var>gr</var>, <var>fl</var>, <var>comment1</var>, ..., <var>commentn</var>)</em></dt>
<dd>
<p>Экспортирует граф в файл <var>fl</var> в формате DIMACS. 
Необязательный комментарий будет добавлен к началу файла.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fdimacs_005fimport"></a><dl>
<dt><a name="index-dimacs_005fimport"></a>Функция: <strong>dimacs_import</strong> <em>(<var>fl</var>)</em></dt>
<dd>
<p>Возвращает граф из файла <var>fl</var>, в котором он записан в формате DIMACS.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph6_005fdecode"></a><dl>
<dt><a name="index-graph6_005fdecode"></a>Функция: <strong>graph6_decode</strong> <em>(<var>str</var>)</em></dt>
<dd>
<p>Возвращает граф, закодированный в формате graph6 в строке <var>str</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph6_005fencode"></a><dl>
<dt><a name="index-graph6_005fencode"></a>Функция: <strong>graph6_encode</strong> <em>(<var>gr</var>)</em></dt>
<dd>
<p>Возвращает строку &ndash; закодированное представление графа <var>gr</var> в формате graph6.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph6_005fexport"></a><dl>
<dt><a name="index-graph6_005fexport"></a>Функция: <strong>graph6_export</strong> <em>(<var>gr_list</var>, <var>fl</var>)</em></dt>
<dd>
<p>Экспортирует графы из списка <var>gr_list</var> в файл <var>fl</var> в формате graph6.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fgraph6_005fimport"></a><dl>
<dt><a name="index-graph6_005fimport"></a>Функция: <strong>graph6_import</strong> <em>(<var>fl</var>)</em></dt>
<dd>
<p>Возвращает список графов из файла <var>fl</var>, где они закодированы в формате graph6.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fsparse6_005fdecode"></a><dl>
<dt><a name="index-sparse6_005fdecode"></a>Функция: <strong>sparse6_decode</strong> <em>(<var>str</var>)</em></dt>
<dd>
<p>Возвращает граф, закодированный в формате sparse6 в строке <var>str</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fsparse6_005fencode"></a><dl>
<dt><a name="index-sparse6_005fencode"></a>Функция: <strong>sparse6_encode</strong> <em>(<var>gr</var>)</em></dt>
<dd>
<p>Возвращает строку &ndash; закодированное представление графа <var>gr</var> в формате sparse6.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fsparse6_005fexport"></a><dl>
<dt><a name="index-sparse6_005fexport"></a>Функция: <strong>sparse6_export</strong> <em>(<var>gr_list</var>, <var>fl</var>)</em></dt>
<dd>
<p>Экспортирует графы из списка <var>gr_list</var> в файл <var>fl</var> в формате sparse6.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fsparse6_005fimport"></a><dl>
<dt><a name="index-sparse6_005fimport"></a>Функция: <strong>sparse6_import</strong> <em>(<var>fl</var>)</em></dt>
<dd>
<p>Возвращает список графов из файла <var>fl</var>, где они закодированы в формате sparse6.
</p></dd></dl>

<a name="Vizualizaciya"></a>
<h4 class="subsection">50.2.5 Визуализация</h4>

<a name="Item_003a-graphs_002fdeffn_002fdraw_005fgraph"></a><dl>
<dt><a name="index-draw_005fgraph"></a>Функция: <strong>draw_graph</strong> <em>(<var>graph</var>)</em></dt>
<dt><a name="index-draw_005fgraph-1"></a>Функция: <strong>draw_graph</strong> <em>(<var>graph</var>, <var>option1</var>, ..., <var>optionk</var>)</em></dt>
<dd><p>Изображает граф с помощью пакета <code>draw</code>.
</p>
<p>Алгоритм, используемый для размещения вершин, определяется необязательной переменной <var>program</var>. 
Значение по умолчанию <code>program=spring_embedding</code>. 
Может также использоваться программа graphviz, но она должна быть установлена отдельно.
</p>
<p>Необязательные аргументы <var>draw_graph</var> могут быть:
</p><ul>
<li> <em>show_id=show</em>: если <var>show</var> равно <var>true</var>, то изображаются
идентификаторы (id) вершин.
</li><li> <em>show_label=show</em>: если <var>show</var> равно <var>true</var>, то изображаются
метки вершин.
</li><li> <em>label_alignment=pos</em>: как разместить метку или идентификатор вершины. 
Может быть <code>left</code>, <code>center</code> или  <code>right</code>. 
По умолчанию <code>left</code>.
</li><li> <em>show_weight=show</em>: если <var>show</var> равно <var>true</var>, то изображаются
веса ребер.
</li><li> <em>vertex_type=type</em>: определяет, как изображаются вершины. 
См. опцию <var>point_type</var> пакета <code>draw</code>.
</li><li> <em>vertex_size=size</em>: размер вершин.
</li><li> <em>vertex_color=c</em>: цвет вершин.
</li><li> <em>show_vertices=v_list</em>: изобразить вершины из списка <var>v_list</var>
другим цветом.
</li><li> <em>show_vertex_type=type</em>: определяет, как изображаются вершины из списка <var>show_vertices</var>. 
См. опцию <var>point_type</var> пакета <code>draw</code>.
</li><li> <em>show_vertex_size=size</em>: размер вершин в списке <var>show_vertices</var>.
</li><li> <em>show_vertex_color=c</em>: цвет вершин в списке <var>show_vertices</var>.
</li><li> <em>vertex_partition=part</em>: разбиение
<code>[[v1,v2,...],...,[vk,...,vn]]</code> вершин графа. 
Вершины в каждом списка будут изображаться разными цветами.
</li><li> <em>vertex_coloring=col</em>: раскраска вершин. Раскраска <var>col</var> должна
быть задана в формате, возвращаемом <var>vertex_coloring</var>.
</li><li> <em>edge_color=c</em>: цвет, используемый для изображения ребер.
</li><li> <em>edge_width=width</em>: толщина ребер.
</li><li> <em>edge_type=type</em>: определяет способ изображения ребер. 
См. опцию <var>line_type</var> пакета <code>draw</code>.
</li><li> <em>show_edges=e_list</em>: изображать ребра из списка <var>e_list</var>
другим цветом.
</li><li> <em>show_edge_color=c</em>: цвет, используемый для изображения ребер из списка <var>show_edges</var>.
</li><li> <em>show_edge_width=width</em>: ширина ребер <var>show_edges</var>.
</li><li> <em>show_edge_type=type</em>: определяет, как изображаются ребра из списка <var>show_edges</var>. 
См. опцию <var>line_type</var> пакета <code>draw</code>.
</li><li> <em>edge_partition=partition</em>: разбиение 
<code>[[e1,e2,...],...,[ek,...,em]]</code> ребер графа. Ребра в каждом списке
будут изображаться разными цветами.
</li><li> <em>edge_coloring=col</em>: раскраска ребер. Раскраска <var>col</var> должна
быть задана в формате, возвращаемом функцией <var>edge_coloring</var>.
</li><li> <em>redraw=r</em>: если <var>redraw</var> равно <code>true</code>, то положение вершин
вычисляется снова, даже если оно было сохранено с предыдущего изображения
графа.
</li><li> <em>head_angle=angle</em>: угол наконечников стрелок, изображаемых на ребрах
ориентированных графов. Значение по умолчанию: 15.
</li><li> <em>head_length=len</em>: длина наконечников стрелок, изображаемых на ребрах
ориентированных графов. Значение по умолчанию: 0.1.
</li><li> <em>spring_embedding_depth=depth</em>: число итераций в алгоритме пружин
(метод взаимодействия сил). Значение по умолчанию: 50.
</li><li> <em>terminal=term</em>: терминал, используемый для изображения (см. опцию <var>terminal</var> 
пакета <code>draw</code>).
</li><li> <em>file_name=file</em>: имя файла изображения, если терминал не является дисплеем.
</li><li> <em>program=prg</em>: определяет программу, используемую для расположения вершин графа. 
Может быть одной из опций программы graphviz (dot, neato, twopi, circ,
fdp), <var>circular</var>, <var>spring_embedding</var> или
<var>planar_embedding</var>. <var>planar_embedding</var> примеменимо только
2-связным планарным графам. Когда <code>program=spring_embedding</code>, то набор
вершин с фиксированным расположением может быть задан с помощью опции
<var>fixed_vertices</var>.
</li><li> <em>fixed_vertices=[]</em>: задает список вершин, которые будут расположены в
фиксорованных позициях по правильному многограннику. 
Может использоваться совместно с <code>program=spring_embedding</code>.
</li></ul>

<p>Пример 1:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g:grid_graph(10,10)$
(%i3) m:max_matching(g)$
(%i4) draw_graph(g,
   spring_embedding_depth=100,
   show_edges=m, edge_type=dots,
   vertex_size=0)$
</pre></div>

<img src="./figures/graphs09.png" alt="./figures/graphs09">

<p>Пример 2:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g:create_graph(16,
    [
     [0,1],[1,3],[2,3],[0,2],[3,4],[2,4],
     [5,6],[6,4],[4,7],[6,7],[7,8],[7,10],[7,11],
     [8,10],[11,10],[8,9],[11,12],[9,15],[12,13],
     [10,14],[15,14],[13,14]
    ])$
(%i3) t:minimum_spanning_tree(g)$
(%i4) draw_graph(
    g,
    show_edges=edges(t),
    show_edge_width=4,
    show_edge_color=green,
    vertex_type=filled_square,
    vertex_size=2
    )$
</pre></div>

<img src="./figures/graphs10.png" alt="./figures/graphs10">

<p>Пример 3:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) g:create_graph(16,
    [
     [0,1],[1,3],[2,3],[0,2],[3,4],[2,4],
     [5,6],[6,4],[4,7],[6,7],[7,8],[7,10],[7,11],
     [8,10],[11,10],[8,9],[11,12],[9,15],[12,13],
     [10,14],[15,14],[13,14]
    ])$
(%i3) mi : max_independent_set(g)$
(%i4) draw_graph(
    g,
    show_vertices=mi,
    show_vertex_type=filled_up_triangle,
    show_vertex_size=2,
    edge_color=cyan,
    edge_width=3,
    show_id=true,
    text_color=brown
    )$
</pre></div>

<img src="./figures/graphs11.png" alt="./figures/graphs11">

<p>Пример 4:
</p>
<div class="example">
<pre class="example">(%i1) load (&quot;graphs&quot;)$
(%i2) net : create_graph(
    [0,1,2,3,4,5],
    [
     [[0,1], 3], [[0,2], 2],
     [[1,3], 1], [[1,4], 3],
     [[2,3], 2], [[2,4], 2],
     [[4,5], 2], [[3,5], 2]
    ],
    directed=true
    )$
(%i3) draw_graph(
    net,
    show_weight=true,
    vertex_size=0,
    show_vertices=[0,5],
    show_vertex_type=filled_square,
    head_length=0.2,
    head_angle=10,
    edge_color=&quot;dark-green&quot;,
    text_color=blue
    )$
</pre></div>

<img src="./figures/graphs12.png" alt="./figures/graphs12">

</dd></dl>

<a name="Item_003a-graphs_002fdefvr_002fdraw_005fgraph_005fprogram"></a><dl>
<dt><a name="index-draw_005fgraph_005fprogram"></a>Управляющая переменная: <strong>draw_graph_program</strong></dt>
<dd><p>Значение по умолчанию: <var>spring_embedding</var>.
</p>
<p>Значение по умолчанию, которое используется для расположения вершин в программе <code>draw_graph</code>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertices_005fto_005fpath"></a><dl>
<dt><a name="index-vertices_005fto_005fpath"></a>Функция: <strong>vertices_to_path</strong> <em>(<var>v_list</var>)</em></dt>
<dd><p>Преобразует список вершин <var>v_list</var> в список ребер пути, определяемого списком <var>v_list</var>.
</p></dd></dl>

<a name="Item_003a-graphs_002fdeffn_002fvertices_005fto_005fcycle"></a><dl>
<dt><a name="index-vertices_005fto_005fcycle"></a>Функция: <strong>vertices_to_cycle</strong> <em>(<var>v_list</var>)</em></dt>
<dd><p>Преобразует список вершин <var>v_list</var> в список ребер цикла, определяемого списком <var>v_list</var>.
</p></dd></dl>

<hr>
<div class="header">
<p>
Previous: <a href="maxima_187.html#g_t_0412_0432_0435_0434_0435_043d_0438_0435-_0432-_043f_0430_043a_0435_0442-graphs" accesskey="p" rel="previous">Введение в пакет graphs</a>, Up: <a href="maxima_186.html#g_t_041f_0430_043a_0435_0442-graphs" accesskey="u" rel="up">Пакет graphs</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="maxima_262.html#g_t_0423_043a_0430_0437_0430_0442_0435_043b_044c-_0444_0443_043d_043a_0446_0438_0439-_0438-_043f_0435_0440_0435_043c_0435_043d_043d_044b_0445" title="Index" rel="index">Index</a>]</p>
</div>



</body>
</html>
