<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on May, 2 2007 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 47. draw</title>

<meta name="description" content="Maxima Manual: 47. draw">
<meta name="keywords" content="Maxima Manual: 47. draw">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,180); /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    font-family: "Lucida Console", monospace
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}
-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="en" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="draw"></a>
<a name="SEC189"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_46.html#SEC188" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC190" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_46.html#SEC185" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC192" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_76.html#SEC290" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 47. draw </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC190">47.1 Introduction to draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC191">47.2 Definitions for draw</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>





<hr size="6">
<a name="Introduction-to-draw"></a>
<a name="SEC190"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC189" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC191" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC189" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC189" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC192" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_76.html#SEC290" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 47.1 Introduction to draw </h2>


<p><code>draw</code> is a Maxima-Gnuplot interface.
</p>
<p>There are three functions to be used at Maxima level: 
<code>draw2d</code>, <code>draw3d</code> and <code>draw</code>.
</p>
<p>Follow this link for more elaborated examples of this package:
</p>
<p>http://www.telefonica.net/web2/biomates/maxima/gpdraw
</p>
<p>You need Gnuplot 4.2 to run this program.
</p>



<hr size="6">
<a name="Definitions-for-draw"></a>
<a name="SEC191"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC190" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC192" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC189" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC189" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC192" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_76.html#SEC290" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 47.2 Definitions for draw </h2>




<dl>
<dt><u>Graphic option:</u> <b>xrange</b>
<a name="IDX1720"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>xrange</code> is <code>false</code>, the range for the <var>x</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>x</var>, it must be given as a 
Maxima list, as in <code>xrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [-3,5],
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>yrange</code> and <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>yrange</b>
<a name="IDX1721"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>yrange</code> is <code>false</code>, the range for the <var>y</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>y</var>, it must be given as a 
Maxima list, as in <code>yrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(yrange = [-2,3],
             explicit(x^2,x,-1,1),
             xrange = [-3,3])$
</pre></td></tr></table>
<p>See also <code>xrange</code> and <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>zrange</b>
<a name="IDX1722"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>zrange</code> is <code>false</code>, the range for the <var>z</var> coordinate is
computed automatically.
</p>
<p>If the user wants a specific interval for <var>z</var>, it must be given as a 
Maxima list, as in <code>zrange=[-2, 3]</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(yrange = [-3,3],
             zrange = [-2,5],
             explicit(x^2+y^2,x,-1,1,y,-1,1),
             xrange = [-3,3])$
</pre></td></tr></table>
<p>See also <code>yrange</code> and <code>zrange</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>logx</b>
<a name="IDX1723"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logx</code> is <code>true</code>, the <var>x</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(log(x),x,0.01,5),
             logx = true)$
</pre></td></tr></table>
<p>See also <code>logy</code> and <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>logy</b>
<a name="IDX1724"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logy</code> is <code>true</code>, the <var>y</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(logy = true,
             explicit(exp(x),x,0,5))$
</pre></td></tr></table>
<p>See also <code>logx</code> and <code>logz</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>logz</b>
<a name="IDX1725"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>logz</code> is <code>true</code>, the <var>z</var> axis will be drawn in the
logarithmic scale.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(logz = true,
             explicit(exp(u^2+v^2),u,-2,2,v,-2,2))$
</pre></td></tr></table>
<p>See also <code>logx</code> and <code>logy</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>terminal</b>
<a name="IDX1726"></a>
</dt>
<dd><p>Default value: <code>screen</code>
</p>
<p>Selects the terminal to be used by Gnuplot; possible values are:
<code>screen</code> (default), <code>png</code>, <code>jpg</code>, <code>eps</code>, and <code>eps_color</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Examples:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* screen terminal (default) */
      draw2d(explicit(x^2,x,-1,1))$
(%i3) /* png file */
      draw2d(terminal  = 'png,
             pic_width = 300,
             explicit(x^2,x,-1,1))$
(%i4) /* jpg file */
      draw2d(terminal   = 'jpg,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
(%i5) /* eps file */
      draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'eps)$
</pre></td></tr></table>
<p>See also <code>file_name</code>, <code>pic_width</code>, and <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>grid</b>
<a name="IDX1727"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>grid</code> is <code>true</code>, a grid will be drawn on the <var>xy</var> plane.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(grid = true,
             explicit(exp(u),u,-2,2))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>title</b>
<a name="IDX1728"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>title</code> stores a Maxima string with the main title for the scene.
By default, no title is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(u),u,-2,2),
             title = &quot;Exponential function&quot;)$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>xlabel</b>
<a name="IDX1729"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>xlabel</code> stores a Maxima string with the label for the <var>x</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             explicit(exp(u),u,-2,2),
             ylabel = &quot;Population&quot;)$
</pre></td></tr></table>
<p>See also <code>ylabel</code>, and <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>ylabel</b>
<a name="IDX1730"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>ylabel</code> stores a Maxima string with the label for the <var>y</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xlabel = &quot;Time&quot;,
             ylabel = &quot;Population&quot;,
             explicit(exp(u),u,-2,2) )$
</pre></td></tr></table>
<p>See also <code>xlabel</code>, and <code>zlabel</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>zlabel</b>
<a name="IDX1731"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Option <code>zlabel</code> stores a Maxima string with the label for the <var>z</var> axis.
By default, no label is written.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(zlabel = &quot;Z variable&quot;,
             ylabel = &quot;Y variable&quot;,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2),
             xlabel = &quot;X variable&quot; )$
</pre></td></tr></table>
<p>See also <code>xlabel</code>, and <code>ylabel</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>xtics</b>
<a name="IDX1732"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>xtics</code> is <code>true</code>, tics will be written in the <var>x</var> axis.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* No tics in the x-axis */
      draw2d(xtics = false,
             explicit(exp(u),u,-2,2))$
</pre></td></tr></table>
<p>See also <code>ytics</code>, and <code>ztics</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>ytics</b>
<a name="IDX1733"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>ytics</code> is <code>true</code>, tics will be written in the <var>y</var> axis.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(ytics = false,
             explicit(exp(u),u,-2,2),
             xtics = false)$
</pre></td></tr></table>
<p>See also <code>xtics</code>, and <code>ztics</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>ztics</b>
<a name="IDX1734"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>ztics</code> is <code>true</code>, tics will be written in the <var>z</var> axis.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) /* No tics in the z-axis */
      draw3d(ztics = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>See also <code>xtics</code>, and <code>ytics</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>rot_vertical</b>
<a name="IDX1735"></a>
</dt>
<dd><p>Default value: 60
</p>
<p><code>rot_vertical</code> is the angle (in degrees) of vertical rotation (around 
the <var>x</var> axis) to set the view point in 3d scenes.
</p>
<p>The angle is bounded to the <em>[0, 180]</em> interval.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>See also <code>rot_horizontal</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>rot_horizontal</b>
<a name="IDX1736"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>rot_horizontal</code> is the angle (in degrees) of horizontal rotation (around 
the <var>z</var> axis) to set the view point in 3d scenes.
</p>
<p>The angle is bounded to the <em>[0, 360]</em> interval.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(rot_vertical = 170,
             rot_horizontal = 360,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>See also <code>rot_vertical</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>xy_file</b>
<a name="IDX1737"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p><code>xy_file</code> is the name of the file where the coordinates will be saved
after clicking with the mouse button and hitting the 'x' key. By default,
no coordinates are saved.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>user_preamble</b>
<a name="IDX1738"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p>Expert Gnuplot users can make use of this option to fine tune Gnuplot's
behaviour by writing settings to be sent before the <code>plot</code> or <code>splot</code>
command.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<p>The <i>dumb</i> terminal is not supported by package <code>draw</code>,
but it is possible to set it by making use of option <code>user_preamble</code>,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x)-1,x,-1,1),
             parametric(cos(u),sin(u),u,0,2*%pi),
             user_preamble=&quot;set terminal dumb&quot;)$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>file_name</b>
<a name="IDX1739"></a>
</dt>
<dd><p>Default value: <code>&quot;maxima_out&quot;</code>
</p>
<p>This is the name of the file where terminals <code>png</code>, <code>jpg</code>, <code>eps</code>
and <code>eps_color</code> will save the graphic.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(file_name = &quot;myfile&quot;,
             explicit(x^2,x,-1,1),
             terminal  = 'png)$
</pre></td></tr></table>
<p>See also <code>terminal</code>, <code>pic_width</code>, and <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>pic_width</b>
<a name="IDX1740"></a>
</dt>
<dd><p>Default value: 640
</p>
<p>This is the width of the bitmap file generated by terminals <code>png</code> and <code>jpg</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>pic_height</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>pic_height</b>
<a name="IDX1741"></a>
</dt>
<dd><p>Default value: 640
</p>
<p>This is the height of the bitmap file generated by terminals <code>png</code> and <code>jpg</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'png,
             pic_width  = 300,
             pic_height = 300,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>pic_width</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>eps_width</b>
<a name="IDX1742"></a>
</dt>
<dd><p>Default value: 12
</p>
<p>This is the width (measured in cm) of the Postscipt file
generated by terminals <code>eps</code> and <code>eps_color</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>eps_height</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>eps_height</b>
<a name="IDX1743"></a>
</dt>
<dd><p>Default value: 8
</p>
<p>This is the height (measured in cm) of the Postscipt file
generated by terminals <code>eps</code> and <code>eps_color</code>.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal   = 'eps,
             eps_width  = 3,
             eps_height = 3,
             explicit(x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>terminal</code>, <code>file_name</code>, and <code>eps_width</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>axis_bottom</b>
<a name="IDX1744"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_bottom</code> is <code>true</code>, the bottom axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_bottom = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>axis_left</code>,  <code>axis_top</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>axis_left</b>
<a name="IDX1745"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_left</code> is <code>true</code>, the left axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_left = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>axis_bottom</code>,  <code>axis_top</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>axis_top</b>
<a name="IDX1746"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_top</code> is <code>true</code>, the top axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_top = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_right</code>, and <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>axis_right</b>
<a name="IDX1747"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_right</code> is <code>true</code>, the right axis is shown in 2d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(axis_right = false,
             explicit(x^3,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code>, and <code>axis_3d</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>axis_3d</b>
<a name="IDX1748"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>axis_3d</code> is <code>true</code>, the <var>x</var>, <var>y</var> and <var>z</var> axis are shown in 3d scenes.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(axis_3d = false,
             explicit(sin(x^2+y^2),x,-2,2,y,-2,2) )$
</pre></td></tr></table>
<p>See also <code>axis_bottom</code>,  <code>axis_left</code>, <code>axis_top</code>, and <code>axis_right</code> for axis in 2d.
</p></dd></dl>





<dl>
<dt><u>Graphic option:</u> <b>palette</b>
<a name="IDX1749"></a>
</dt>
<dd><p>Default value: <code>color</code>
</p>
<p><code>palette</code> indicates how to map the real values of a matrix
passed to object <code>image</code> onto color components.
</p>
<p><code>palette</code> is a vector of length three with components 
ranging from -36 to +36; each value is an index for a formula mapping the levels
onto red, green and blue colors, respectively:
</p><table><tr><td>&nbsp;</td><td><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></td></tr></table><p>negative numbers mean negative colour component.
</p>
<p><code>palette = gray</code> and <code>palette = color</code> are short cuts for
<code>palette = [3,3,3]</code> and <code>palette = [7,5,15]</code>, respectively.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Examples:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></td></tr></table>
<p>See also <code>colorbox</code>. 
</p></dd></dl>




<dl>
<dt><u>Graphic option:</u> <b>colorbox</b>
<a name="IDX1750"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>colorbox</code> is <code>true</code>, a color scale is drawn together with
<code>image</code> objects.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply('matrix,
                 makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
(%i4) draw2d(colorbox=false, image(im,0,0,30,30))$
</pre></td></tr></table>
<p>See also <code>palette</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>enhanced3d</b>
<a name="IDX1751"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>enhanced3d</code> is <code>true</code>, surfaces are colored in 3d plots;
in other words, it sets Gnuplot's pm3d mode.
</p>
<p>See option <code>palette</code> to learn how palettes are specified.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(surface_hide = true,
             enhanced3d   = true,
             palette      = gray,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>point_size</b>
<a name="IDX1752"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>point_size</code> sets the size for plotted points. It must be a
non negative number.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(points(makelist([random(20),random(50)],k,1,10)),
             point_size = 5,
             points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>point_type</b>
<a name="IDX1753"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>point_type</code> is an index (greater or equal than -1) to specify how points are displayed.
Point colors are controlled with this option.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange = [0,10],
             yrange = [0,10],
             point_size = 3,
             point_type = 1,
             points([[1,1],[5,1],[9,1]]),
             point_type = 2,
             points([[1,2],[5,2],[9,2]]),
             point_type = 3,
             points([[1,3],[5,3],[9,3]]),
             point_type = 4,
             points([[1,4],[5,4],[9,4]]),
             point_type = 5,
             points([[1,5],[5,5],[9,5]]),
             point_type = 6,
             points([[1,6],[5,6],[9,6]]),
             point_type = 7,
             points([[1,7],[5,7],[9,7]]),
             point_type = 8,
             points([[1,8],[5,8],[9,8]]),
             point_type = 9,
             points([[1,9],[5,9],[9,9]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>points_joined</b>
<a name="IDX1754"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>points_joined</code> is <code>true</code>, points are joined by lines.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>.

</li><li>
<code>gr3d</code>: <code>points</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange        = [0,10],
             yrange        = [0,4],
             point_size    = 3,
             point_type    = 1,
             line_type     = 3,
             points([[1,1],[5,1],[9,1]]),
             points_joined = true,
             point_type    = 3,
             line_type     = 5,
             points([[1,2],[5,2],[9,2]]),
             point_type    = 5,
             line_type     = 8,
             line_width    = 7,
             points([[1,3],[5,3],[9,3]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>filled_func</b>
<a name="IDX1755"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>filled_func</code> indicates whether a function is filled (<code>true</code>)
or not (<code>false</code>).
</p>
<p>This option affects only the 2d graphic object <code>explicit</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             filled_func = true,
             explicit(sin(x),x,0,10) )$
</pre></td></tr></table>
<p>See also <code>fill_color</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>transparent</b>
<a name="IDX1756"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>transparent</code> is <code>true</code>, interior regions of polygons are 
filled according to <code>fill_color</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code>, and <code>ellipse</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(polygon([[3,2],[7,2],[5,5]]),
             transparent = true,
             color       = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>border</b>
<a name="IDX1757"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>If <code>border</code> is <code>true</code>, borders of polygons are painted
according to <code>line_type</code> and <code>line_width</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>polygon</code>, <code>rectangle</code>, and <code>ellipse</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(color       = brown,
             line_width  = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = blue,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>head_both</b>
<a name="IDX1758"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>head_both</code> is <code>true</code>, vectors are plotted with two arrow heads.
If <code>false</code>, only one arrow is plotted.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,8],
             yrange      = [0,8],
             head_length = 0.7,
             vector([1,1],[6,0]),
             head_both   = true,
             vector([1,7],[6,0]) )$
</pre></td></tr></table>
<p>See also <code>head_length</code>, <code>head_angle</code>, and <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>head_length</b>
<a name="IDX1759"></a>
</dt>
<dd><p>Default value: 2
</p>
<p><code>head_length</code> indicates, in <var>x</var>-axis units, the length of arrow heads.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,8],
             vector([0,1],[5,5]),
             head_length = 1,
             vector([2,1],[5,5]),
             head_length = 0.5,
             vector([4,1],[5,5]),
             head_length = 0.25,
             vector([6,1],[5,5]))$
</pre></td></tr></table>
<p>See also <code>head_both</code>, <code>head_angle</code>, and <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>head_angle</b>
<a name="IDX1760"></a>
</dt>
<dd><p>Default value: 45
</p>
<p><code>head_angle</code> indicates the angle, in degrees, between the arrow heads and
the segment.
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,10],
             yrange      = [0,9],
             head_length = 0.7,
             head_angle  = 10,
             vector([1,1],[0,6]),
             head_angle  = 20,
             vector([2,1],[0,6]),
             head_angle  = 30,
             vector([3,1],[0,6]),
             head_angle  = 40,
             vector([4,1],[0,6]),
             head_angle  = 60,
             vector([5,1],[0,6]),
             head_angle  = 90,
             vector([6,1],[0,6]),
             head_angle  = 120,
             vector([7,1],[0,6]),
             head_angle  = 160,
             vector([8,1],[0,6]),
             head_angle  = 180,
             vector([9,1],[0,6]) )$
</pre></td></tr></table>
<p>See also <code>head_both</code>, <code>head_length</code>, and <code>head_type</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>head_type</b>
<a name="IDX1761"></a>
</dt>
<dd><p>Default value: <code>filled</code>
</p>
<p><code>head_type</code> is used to specify how arrow heads are plotted. Possible
values are: <code>filled</code> (closed and filled arrow heads), <code>empty</code>
(closed but not filled arrow heads), and <code>nofilled</code> (open arrow heads).
</p>
<p>This option is relevant only for <code>vector</code> objects.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_type = 'nofilled,
             vector([6,1],[5,5]))$
</pre></td></tr></table>
<p>See also <code>head_both</code>, <code>head_angle</code>, and <code>head_length</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>label_alignment</b>
<a name="IDX1762"></a>
</dt>
<dd><p>Default value: <code>center</code>
</p>
<p><code>label_alignment</code> is used to specify where to write labels with
respect to the given coordinates. Possible values are: <code>center</code>,
<code>left</code>, and <code>right</code>.
</p>
<p>This option is relevant only for <code>label</code> objects.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange          = [0,10],
             yrange          = [0,10],
             points_joined   = true,
             points([[5,0],[5,10]]),
             color           = blue,
             label(&quot;Centered alignment (default)&quot;,5,2),
             label_alignment = 'left,
             label(&quot;Left alignment&quot;,5,5),
             label_alignment = 'right,
             label(&quot;Right alignment&quot;,5,8))$
</pre></td></tr></table>
<p>See also <code>label_orientation</code>, and <code>color</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>label_orientation</b>
<a name="IDX1763"></a>
</dt>
<dd><p>Default value: <code>horizontal</code>
</p>
<p><code>label_orientation</code> is used to specify orientation of labels.
Possible values are: <code>horizontal</code>, and <code>vertical</code>.
</p>
<p>This option is relevant only for <code>label</code> objects.
</p>
<p>Example:
</p>
<p>In this example, a dummy point is added to get an image.
Package <code>draw</code> needs always data to draw an scene.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange     = [0,10],
             yrange     = [0,10],
             point_size = 0,
             points([[5,5]]),
             color      = navy,
             label(&quot;Horizontal orientation (default)&quot;,5,2),
             label_orientation = 'vertical,
             color             = &quot;#654321&quot;,
             label(&quot;Vertical orientation&quot;,1,5))$
</pre></td></tr></table>
<p>See also <code>label_alignment</code> and <code>color</code>. 
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>color</b>
<a name="IDX1764"></a>
</dt>
<dd><p>Default value: <code>&quot;black&quot;</code>
</p>
<p><code>color</code> specifies the color for plotting lines, points, borders of
polygons and labels.
</p>
<p>Colors can be given as names or in hexadecimal <i>rgb</i> code.
</p>
<p>Available color names are: 
<code>&quot;white&quot;</code>, <code>&quot;black&quot;</code>, <code>&quot;gray0&quot;</code>, <code>&quot;grey0&quot;</code>, <code>&quot;gray10&quot;</code>,
<code>&quot;grey10&quot;</code>, <code>&quot;gray20&quot;</code>, <code>&quot;grey20&quot;</code>, <code>&quot;gray30&quot;</code>, <code>&quot;grey30&quot;</code>,
<code>&quot;gray40&quot;</code>, <code>&quot;grey40&quot;</code>, <code>&quot;gray50&quot;</code>, <code>&quot;grey50&quot;</code>, <code>&quot;gray60&quot;</code>,
<code>&quot;grey60&quot;</code>, <code>&quot;gray70&quot;</code>, <code>&quot;grey70&quot;</code>, <code>&quot;gray80&quot;</code>, <code>&quot;grey80&quot;</code>,
<code>&quot;gray90&quot;</code>, <code>&quot;grey90&quot;</code>, <code>&quot;gray100&quot;</code>, <code>&quot;grey100&quot;</code>, <code>&quot;gray&quot;</code>,
<code>&quot;grey&quot;</code>, <code>&quot;light-gray&quot;</code>, <code>&quot;light-grey&quot;</code>, <code>&quot;dark-gray&quot;</code>,
<code>&quot;dark-grey&quot;</code>, <code>&quot;red&quot;</code>, <code>&quot;light-red&quot;</code>, <code>&quot;dark-red&quot;</code>, <code>&quot;yellow&quot;</code>,
<code>&quot;light-yellow&quot;</code>, <code>&quot;dark-yellow&quot;</code>, <code>&quot;green&quot;</code>, <code>&quot;light-green&quot;</code>,
<code>&quot;dark-green&quot;</code>, <code>&quot;spring-green&quot;</code>, <code>&quot;forest-green&quot;</code>, <code>&quot;sea-green&quot;</code>,
<code>&quot;blue&quot;</code>, <code>&quot;light-blue&quot;</code>, <code>&quot;dark-blue&quot;</code>, <code>&quot;midnight-blue&quot;</code>, 
<code>&quot;navy&quot;</code>, <code>&quot;medium-blue&quot;</code>, <code>&quot;royalblue&quot;</code>, <code>&quot;skyblue&quot;</code>, 
<code>&quot;cyan&quot;</code>, <code>&quot;light-cyan&quot;</code>, <code>&quot;dark-cyan&quot;</code>, <code>&quot;magenta&quot;</code>, 
<code>&quot;light-magenta&quot;</code>, <code>&quot;dark-magenta&quot;</code>, <code>&quot;turquoise&quot;</code>, 
<code>&quot;light-turquoise&quot;</code>, <code>&quot;dark-turquoise&quot;</code>, <code>&quot;pink&quot;</code>, <code>&quot;light-pink&quot;</code>,
<code>&quot;dark-pink&quot;</code>, <code>&quot;coral&quot;</code>, <code>&quot;light-coral&quot;</code>, <code>&quot;orange-red&quot;</code>,
<code>&quot;salmon&quot;</code>, <code>&quot;light-salmon&quot;</code>, <code>&quot;dark-salmon&quot;</code>, <code>&quot;aquamarine&quot;</code>,
<code>&quot;khaki&quot;</code>, <code>&quot;dark-khaki&quot;</code>, <code>&quot;goldenrod&quot;</code>, <code>&quot;light-goldenrod&quot;</code>,
<code>&quot;dark-goldenrod&quot;</code>, <code>&quot;gold&quot;</code>, <code>&quot;beige&quot;</code>, <code>&quot;brown&quot;</code>, <code>&quot;orange&quot;</code>,
<code>&quot;dark-orange&quot;</code>, <code>&quot;violet&quot;</code>, <code>&quot;dark-violet&quot;</code>, <code>&quot;plum&quot;</code> and <code>&quot;purple&quot;</code>.
</p>
<p>Cromatic componentes in hexadecimal code are introduced in the form <code>&quot;#rrggbb&quot;</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default is black */
             color = &quot;red&quot;,
             explicit(0.5 + x^2,x,-1,1),
             color = blue,
             explicit(1 + x^2,x,-1,1),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             explicit(1.5 + x^2,x,-1,1),
             color = &quot;#23ab0f&quot;,
             label(&quot;This is a label&quot;,0,1.2)  )$
</pre></td></tr></table>
<p>See also <code>fill_color</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>fill_color</b>
<a name="IDX1765"></a>
</dt>
<dd><p>Default value: <code>&quot;red&quot;</code>
</p>
<p><code>fill_color</code> specifies the color for filling polygons and
2d explicit functions.
</p>
<p>See <code>color</code> to learn how colors are specified.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>line_width</b>
<a name="IDX1766"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>line_width</code> is the width of plotted lines.
Its value must be a positive number.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code> and <code>parametric</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1), /* default width */
             line_width = 5.5,
             explicit(1 + x^2,x,-1,1),
             line_width = 10,
             explicit(2 + x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>line_type</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>line_type</b>
<a name="IDX1767"></a>
</dt>
<dd><p>Default value: <code>solid</code>
</p>
<p><code>line_type</code> indicates how lines are displayed; possible values are
<code>solid</code> and <code>dots</code>.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>, 
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>, 
<code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_type = dots,
             explicit(1 + x^2,x,-1,1),
             line_type = solid, /* default */
             explicit(2 + x^2,x,-1,1))$
</pre></td></tr></table>
<p>See also <code>line_width</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>nticks</b>
<a name="IDX1768"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>nticks</code> is the number of sample points used by the plotting routine.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>ellipse</code>, <code>explicit</code>, <code>parametric</code> and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>parametric</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = true,
             ellipse(0,0,4,2,0,180),
             nticks = 5,
             ellipse(0,0,4,2,180,180) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>adapt_depth</b>
<a name="IDX1769"></a>
</dt>
<dd><p>Default value: 10
</p>
<p><code>adapt_depth</code> is the maximum number of splittings used by the adaptive plotting routine.
</p>
<p>This option is relevant only for 2d <code>explicit</code> functions.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>key</b>
<a name="IDX1770"></a>
</dt>
<dd><p>Default value: <code>&quot;&quot;</code> (empty string)
</p>
<p><code>key</code> is the name of a function in the legend. If <code>key</code> is an
empty string, no key is assigned to the function.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr2d</code>: <code>points</code>, <code>polygon</code>, <code>rectangle</code>,
<code>ellipse</code>, <code>vector</code>, <code>explicit</code>, <code>implicit</code>,
<code>parametric</code>, and <code>polar</code>.

</li><li>
<code>gr3d</code>: <code>points</code>, <code>explicit</code>, <code>parametric</code>,
and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(key = &quot;Sinus&quot;,
             explicit(sin(x),x,0,10),
             key = &quot;Cosinus&quot;,
             line_type = 3,
             explicit(cos(x),x,0,10) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>xu_grid</b>
<a name="IDX1771"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>xu_grid</code> is the number of coordinates of the first variable
(<code>x</code> in explicit and <code>u</code> in parametric 3d surfaces) to 
build the grid of sample points.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></td></tr></table>
<p>See also <code>yv_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>yv_grid</b>
<a name="IDX1772"></a>
</dt>
<dd><p>Default value: 30
</p>
<p><code>yv_grid</code> is the number of coordinates of the second variable
(<code>y</code> in explicit and <code>v</code> in parametric 3d surfaces) to 
build the grid of sample points.
</p>
<p>This option affects the following graphic objects:
</p><ul>
<li>
<code>gr3d</code>: <code>explicit</code> and <code>parametric_surface</code>.
</li></ul>

<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(xu_grid = 10,
             yv_grid = 50,
             explicit(x^2+y^2,x,-3,3,y,-3,3) )$
</pre></td></tr></table>
<p>See also <code>xu_grid</code>.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>surface_hide</b>
<a name="IDX1773"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>surface_hide</code> is <code>true</code>, hidden parts are not plotted in 3d surfaces.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw(columns=2,
           gr3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)),
           gr3d(surface_hide = true,
                explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3)) )$
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>contour</b>
<a name="IDX1774"></a>
</dt>
<dd><p>Default value: <code>none</code>
</p>
<p>Option <code>contour</code> enables the user to select where to plot contour lines.
Possible values are:
</p>
<ul>
<li>
<code>none</code>:
no contour lines are plotted.

</li><li>
<code>base</code>:
contour lines are projected on the xy plane.

</li><li>
<code>surface</code>:
contour lines are plotted on the surface.

</li><li>
<code>both</code>:
two contour lines are plotted: on the xy plane and on the surface.

</li><li>
<code>map</code>:
contour lines are projected on the xy plane, and the view point is
set just in the vertical.

</li></ul>

<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>contour_levels</b>
<a name="IDX1775"></a>
</dt>
<dd><p>Default value: 5
</p>
<p><code>contour_levels</code> is the number of levels in contour plots.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(20*exp(-x^2-y^2)-10,x,0,2,y,-3,3),
             contour_levels = 15,
             contour        = both,
             surface_hide   = true) $
</pre></td></tr></table></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>columns</b>
<a name="IDX1776"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>columns</code> is the number of columns in multiple plots.
</p>
<p>Since this is a global graphics option, its position in the scene description
does not matter. It can be also used as an argument of function <code>draw</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></td></tr></table>
</dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>ip_grid</b>
<a name="IDX1777"></a>
</dt>
<dd><p>Default value: <code>[50, 50]</code>
</p>
<p><code>ip_grid</code> sets the grid for the first sampling in implicit plots.
</p>
<p>This option is relevant only for <code>implicit</code> objects.
</p></dd></dl>



<dl>
<dt><u>Graphic option:</u> <b>ip_grid_in</b>
<a name="IDX1778"></a>
</dt>
<dd><p>Default value: <code>[5, 5]</code>
</p>
<p><code>ip_grid_in</code> sets the grid for the second sampling in implicit plots.
</p>
<p>This option is relevant only for <code>implicit</code> objects.
</p></dd></dl>










<dl>
<dt><u>Scene constructor:</u> <b>gr2d</b><i> (<var>graphic option</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1779"></a>
</dt>
<dd><p>Function <code>gr2d</code> builds an object describing a 2d scene. Arguments are
<i>graphic options</i> and <i>graphic objects</i>. This scene is interpreted
sequentially: <i>graphic options</i> affect those <i>graphic objects</i> placed
on its right.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>This is the list of <i>graphic objects</i> available for scenes in two dimensions:
</p>
<ul>
<li>
<code>points([[x1,y1], [x2,y2], [x3,y3],...])</code> or <code>points([x1,x2,x3,...], [y1,y2,y3,...])</code>:
allocates points <code>[x1,y1]</code>, <code>[x2,y2]</code>, <code>[x2,y2]</code>, ....

<p>This object is affected by the following <i>graphic options</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(key           = &quot;Small points&quot;,
             points(makelist([random(20),random(50)],k,1,10)),
             point_type    = 6,
             point_size    = 3,
             points_joined = true,
             key           = &quot;Great points&quot;,
             points(makelist(k,k,1,20),makelist(random(30),k,1,20)))$
</pre></td></tr></table>
</li><li>
<code>polygon([[x1,y1], [x2,y2], [x3,y3],...])</code> or <code>polygon([x1,x2,x3,...], [y1,y2,y3,...])</code>:
plots a polygon with vertices <code>[x1,y1]</code>, <code>[x2,y2]</code>, <code>[x2,y2]</code>, ... on the plane.

<p>This object is affected by the following <i>graphic options</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
 <code>line_type</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(color      = &quot;#e245f0&quot;,
             line_width = 8,
             polygon([[3,2],[7,2],[5,5]]),
             border      = false,
             fill_color  = yellow,
             polygon([[5,2],[9,2],[7,5]]) )$
</pre></td></tr></table>


</li><li>
<code>rectangle([x1,y1], [x2,y2])</code>:
plots a rectangle with opposite vertices <code>[x1,y1]</code> and <code>[x2,y2]</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>transparent</code>, 
<code>fill_color</code>, <code>border</code>, <code>line_width</code>, <code>key</code>,
<code>line_type</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(fill_color  = red,
             line_width  = 6,
             line_type   = dots,
             transparent = false,
             fill_color  = blue,
             rectangle([-2,-2],[8,-1]),   /* opposite vertices */
             transparent = true,
             line_type   = solid,
             line_width  = 1,
             rectangle([9,4],[2,-1.5]),
             xrange      = [-3,10],
             yrange      = [-3,4.5] )$
</pre></td></tr></table>

</li><li>
<code>ellipse(xc, yc, a, b, ang1, ang2)</code>:
plots an ellipse centered at <code>[xc, yc]</code> with horizontal and vertical
semi axis <code>a</code> and <code>b</code>, respectively, from angle <code>ang1</code> to angle
<code>ang2</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>transparent</code>, <code>fill_color</code>, <code>border</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(transparent = false,
             fill_color  = red,
             color       = gray30,
             transparent = false,
             line_width  = 5,
             ellipse(0,6,3,2,270,-270),  /* center (x,y), a, b, start &amp; end in degrees */
             transparent = true,
             color       = blue,
             line_width  = 3,
             ellipse(2.5,6,2,3,30,-90),
             xrange      = [-3,6],
             yrange      = [2,9] )$
</pre></td></tr></table>

</li><li>
<code>label(string,x,y)</code>:
writes the <code>string</code> at point <code>[x,y]</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>label_alignment</code>, 
<code>label_orientation</code> and <code>color</code>.
</p>
<p>Example:
</p>
<p>In this example, a dummy point is added to get an image.
Package <code>draw</code> needs always data to draw an scene.
These colors may change in different terminals.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(x^2,x,-1,1),
             color = &quot;red&quot;,
             label(&quot;Label in red&quot;,0,0.3),
             color = &quot;#0000ff&quot;,
             label(&quot;Label in blue&quot;,0,0.6),
             color = &quot;light-blue&quot;, /* double quotes if - is used */
             label(&quot;Label in light-blue&quot;,0,0.9)  )$
</pre></td></tr></table>

</li><li>
<code>vector([x,y], [dx,dy])</code>:
plots vector <code>[dx,dy]</code> with origin in <code>[x,y]</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>head_both</code>, 
<code>head_length</code>, <code>head_angle</code>, <code>head_type</code>, <code>line_width</code>, 
<code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(xrange      = [0,12],
             yrange      = [0,10],
             head_length = 1,
             vector([0,1],[5,5]), /* default type */
             head_type = 'empty,
             vector([3,1],[5,5]),
             head_both = true,
             head_type = 'nofilled,
             line_type = dots,
             vector([6,1],[5,5]))$
</pre></td></tr></table>

</li><li>
<code>explicit(fcn,var,minval,maxval)</code>:
plots explicit function <code>fcn</code>, with variable <code>var</code> taking values
from <code>minval</code> to <code>maxval</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>adapt_depth</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code>, 
<code>filled_func</code>, <code>fill_color</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(line_width = 3,
             color      = blue,
             explicit(x^2,x,-3,3) )$
(%i3) draw2d(fill_color  = brown,
             filled_func = true,
             explicit(x^2,x,-3,3) )$
</pre></td></tr></table>

</li><li>
<code>implicit(fcn,x-var,x-minval,x-maxval,y-var,y-minval,y-maxval)</code>:
plots the implicit function defined by <code>fcn</code>, with variable <code>x-var</code> taking values
from <code>x-minval</code> to <code>x-maxval</code>, and variable <code>y-var</code> taking values
from <code>y-minval</code> to <code>y-maxval</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>ip_grid</code>, 
<code>ip_grid_in</code>, <code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(terminal  = eps,
             grid      = true,
             line_type = solid,
             key       = &quot;y^2=x^3-2*x+1&quot;,
               implicit(y^2=x^3-2*x+1, x, -4,4, y, -4,4),
             line_type = dots,
             key       = &quot;x^3+y^3 = 3*x*y^2-x-1&quot;,
              implicit(x^3+y^3 = 3*x*y^2-x-1, x, -4,4, y, -4,4),
             title     = &quot;Two implicit functions&quot; )$
</pre></td></tr></table>

</li><li>
<code>polar(radius,ang,minang,maxang)</code>:
plots function <code>radius(ang)</code> defined in polar coordinates, with variable <code>ang</code>
taking values from <code>minang</code> to <code>maxang</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(user_preamble = &quot;set grid polar&quot;,
             nticks        = 200,
             xrange        = [-5,5],
             yrange        = [-5,5],
             line_type     = 6,
             line_width    = 3,
             title         = &quot;Hyperbolic Spiral&quot;,
             polar(10/theta,theta,1,10*%pi) )$
</pre></td></tr></table>

</li><li>
<code>parametric(xfun,yfun,par,parmin,parmax)</code>:
plots parametric function <code>[xfun,yfun]</code>, with parameter <code>par</code>
taking values from <code>parmin</code> to <code>parmax</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code>and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw2d(explicit(exp(x),x,-1,3),
             color = red,
             key   = &quot;This is the parametric one!!&quot;,
             parametric(2*cos(rrr),rrr^2,rrr,0,2*%pi))$
</pre></td></tr></table>


</li><li>
<code>image(im,x0,y0,width,height)</code>:
plots image <code>im</code> in the rectangular region from vertex <code>(x0,y0)</code> to
<code>(x0+width,y0+height)</code> on the real plane. Argument <code>im</code> must be a
matrix of real numbers, or a matrix of vectors of length three.

<p>If <code>im</code> is a matrix of real numbers, pixel values are interpreted according
to graphic option <code>palette</code>, which is a vector of length three with components 
ranging from -36 to +36; each value is an index for a formula mapping the levels
onto red, green and blue colors, respectively:
</p><table><tr><td>&nbsp;</td><td><pre class="example"> 0: 0               1: 0.5           2: 1
 3: x               4: x^2           5: x^3
 6: x^4             7: sqrt(x)       8: sqrt(sqrt(x))
 9: sin(90x)       10: cos(90x)     11: |x-0.5|
12: (2x-1)^2       13: sin(180x)    14: |cos(180x)|
15: sin(360x)      16: cos(360x)    17: |sin(360x)|
18: |cos(360x)|    19: |sin(720x)|  20: |cos(720x)|
21: 3x             22: 3x-1         23: 3x-2
24: |3x-1|         25: |3x-2|       26: (3x-1)/2
27: (3x-2)/2       28: |(3x-1)/2|   29: |(3x-2)/2|
30: x/0.32-0.78125 31: 2*x-0.84     32: 4x;1;-2x+1.84;x/0.08-11.5
33: |2*x - 0.5|    34: 2*x          35: 2*x - 0.5
36: 2*x - 1
</pre></td></tr></table><p>negative numbers mean negative colour component.
</p>
<p><code>palette = gray</code> and <code>palette = color</code> are short cuts for
<code>palette = [3,3,3]</code> and <code>palette = [7,5,15]</code>, respectively.
</p>
<p>If <code>im</code> is a matrix of vectors of length three, they are interpreted
as red, green and blue color components.
</p>
<p>Examples:
</p>
<p>If <code>im</code> is a matrix of real numbers, pixel values are interpreted according
to graphic option <code>palette</code>.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
           'matrix,
            makelist(makelist(random(200),i,1,30),i,1,30))$
(%i3) /* palette = color, default */
      draw2d(image(im,0,0,30,30))$
(%i4) draw2d(palette = gray, image(im,0,0,30,30))$
(%i5) draw2d(palette = [15,20,-4],
             colorbox=false,
             image(im,0,0,30,30))$
</pre></td></tr></table>
<p>See also <code>colorbox</code>.
</p>
<p>If <code>im</code> is a matrix of vectors of length three, they are interpreted
as red, green and blue color components.
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) im: apply(
            'matrix,
             makelist(
               makelist([random(300),
                         random(300),
                         random(300)],i,1,30),i,1,30))$
(%i3) draw2d(image(im,0,0,30,30))$
</pre></td></tr></table>
</li></ul>

<p>See also the following graphic options: <code>xrange</code>, <code>yrange</code>, 
<code>logx</code>, <code>logy</code>, <code>terminal</code>, <code>grid</code>, <code>title</code>, 
<code>xlabel</code>, <code>ylabel</code>, <code>xtics</code>, <code>ytics</code>, <code>xy_file</code>, 
<code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, <code>axis_top</code>, 
and <code>axis_right</code>.
</p>
</dd></dl>









<dl>
<dt><u>Scene constructor:</u> <b>gr3d</b><i> (<var>graphic option</var>, ..., <var>graphic object</var>, ...)</i>
<a name="IDX1780"></a>
</dt>
<dd><p>Function <code>gr3d</code> builds an object describing a 3d scene. Arguments are
<i>graphic options</i> and <i>graphic objects</i>. This scene is interpreted
sequentially: <i>graphic options</i> affect those <i>graphic objects</i> placed
on its right.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>This is the list of <i>graphic objects</i> available for scenes in three dimensions:
</p>
<ul>
<li>
<code>points([[x1,y1,z1], [x2,y2,z2], [x3,y3,z3],...])</code> or 
<code>points([x1,x2,x3,...], [y1,y2,y3,...], [z1,z2,z3,...])</code>:
allocates points <code>[x1,y1,z1]</code>, <code>[x2,y2,z2]</code>, <code>[x2,y2,z3]</code>, ....

<p>This object is affected by the following <i>graphic options</i>: <code>point_size</code>, 
<code>point_type</code>, <code>points_joined</code>, <code>line_width</code>, <code>key</code>, <code>line_type</code>
and <code>color</code>.
</p>
<p>Examples:
</p>
<p>One tridimensional sample,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title      = &quot;Daily average wind speeds&quot;,
             point_size = 2,
             points(args(submatrix (s2, 4, 5))) )$
</pre></td></tr></table>
<p>Two tridimensional samples,
</p><table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) load (numericalio)$
(%i3) s2 : read_matrix (file_search (&quot;wind.data&quot;))$
(%i4) draw3d(title      = &quot;Daily average wind speeds. Two data sets&quot;,
             point_size = 2,
             key        = &quot;Sample from stations 1, 2 and 3&quot;,
             points(args(submatrix (s2, 4, 5))),
             point_type = 4,
             key        = &quot;Sample from stations 1, 4 and 5&quot;,
             points(args(submatrix (s2, 2, 3))) )$
</pre></td></tr></table>

</li><li>
<code>label(string,x,y,z)</code>:
writes the <code>string</code> at point <code>[x,y,z]</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>label_alignment</code>, 
<code>label_orientation</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = red,
             label(&quot;UP&quot;,-2,0,3),
             color = blue,
             label(&quot;DOWN&quot;,2,0,-3) )$
</pre></td></tr></table>

</li><li>
<code>explicit(fcn,var1,minval1,maxval1,var2,minval2,maxval2)</code>:
plots explicit function <code>fcn</code>, with variable <code>var1</code> taking values
from <code>minval1</code> to <code>maxval1</code> and variable <code>var2</code> taking values
from <code>minval2</code> to <code>maxval2</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(key   = &quot;Gauss&quot;,
             color = &quot;#a02c00&quot;,
             explicit(20*exp(-x^2-y^2)-10,x,-3,3,y,-3,3),
             yv_grid     = 10,
             color = blue,
             key   = &quot;Plane&quot;,
             explicit(x+y,x,-5,5,y,-5,5),
             surface_hide = true)$
</pre></td></tr></table>

</li><li>
<code>parametric(xfun,yfun,zfun,par,parmin,parmax)</code>:
plots parametric curve <code>[xfun,yfun,zfun]</code>, with parameter <code>par</code>
taking values from <code>parmin</code> to <code>parmax</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>nticks</code>, 
<code>line_width</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(explicit(exp(sin(x)+cos(x^2)),x,-3,3,y,-3,3),
             color = royalblue,
             parametric(cos(5*u)^2,sin(7*u),u-2,u,0,2),
             color      = turquoise,
             line_width = 2,
             parametric(t^2,sin(t),2+t,t,0,2),
             surface_hide = true,
             title = &quot;Surface &amp; curves&quot; )$
</pre></td></tr></table>

</li><li>
<code>parametric_surface(xfun,yfun,zfun,par1,par1min,par1max,par2,par2min,par2max)</code>:
plots parametric surface <code>[xfun,yfun,zfun]</code>, with parameter <code>par1</code>
taking values from <code>par1min</code> to <code>par1max</code> and parameter <code>par2</code>
taking values from <code>par2min</code> to <code>par2max</code>.

<p>This object is affected by the following <i>graphic options</i>: <code>xu_grid</code>, 
<code>yv_grid</code>, <code>line_type</code>, <code>key</code> and <code>color</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) draw3d(title          = &quot;Sea shell&quot;,
             xu_grid        = 100,
             yv_grid        = 25,
             rot_vertical   = 100,
             rot_horizontal = 20,
             surface_hide   = true,
             parametric_surface(0.5*u*cos(u)*(cos(v)+1),
                                0.5*u*sin(u)*(cos(v)+1),
                                u*sin(v) - ((u+3)/8*%pi)^2 - 20,
                                u, 0, 13*%pi, v, -%pi, %pi) )$
</pre></td></tr></table>
</li></ul>

<p>See also the following graphic options: <code>xrange</code>, <code>yrange</code>, 
<code>zrange</code>, <code>logx</code>, <code>logy</code>, <code>logz</code>, <code>terminal</code>, 
<code>grid</code>, <code>title</code>, <code>xlabel</code>, <code>ylabel</code>, <code>zlabel</code>, 
<code>xtics</code>, <code>ytics</code>, <code>ztics</code>, <code>xy_file</code>, 
<code>user_preamble</code>, <code>axis_bottom</code>, <code>axis_left</code>, 
<code>axis_top</code>, <code>file_name</code>, <code>pic_width</code>, <code>pic_height</code>, 
<code>eps_width</code>, <code>eps_height</code>,
<code>axis_right</code>, <code>rot_vertical</code>, <code>rot_horizontal</code>, 
<code>axis_3d</code>, <code>xu_grid</code>, <code>yv_grid</code>, <code>surface_hide</code>, 
<code>contour</code>, <code>contour_levels</code>, <code>palette</code>, <code>colorbox</code>
and <code>enhanced3d</code>.
</p>
</dd></dl>







<dl>
<dt><u>Function:</u> <b>draw</b><i> (<var>gr2d</var>, ..., <var>gr3d</var>, ..., <var>options</var>, ...)</i>
<a name="IDX1781"></a>
</dt>
<dd><p>Plots a series of scenes; its arguments are <code>gr2d</code> and <code>gr3d</code> 
objects, together with some options. By default, the scenes are put together
in one column.
</p>
<p>Function <code>draw</code> accepts two possible options: <code>terminal</code> 
and <code>columns</code>.
</p>
<p>Functions <code>draw2d</code> and <code>draw3d</code> are short cuts to be used 
when only one scene is required, in two or three dimensions, respectively.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
<p>Example:
</p>
<table><tr><td>&nbsp;</td><td><pre class="example">(%i1) load(draw)$
(%i2) scene1: gr2d(title=&quot;Ellipse&quot;,
                   nticks=30,
                   parametric(2*cos(t),5*sin(t),t,0,2*%pi))$
(%i3) scene2: gr2d(title=&quot;Triangle&quot;,
                   polygon([4,5,7],[6,4,2]))$
(%i4) draw(scene1, scene2, columns = 2)$
</pre></td></tr></table></dd></dl>


<dl>
<dt><u>Function:</u> <b>draw2d</b><i> (<var>option</var>, <var>graphic object</var>, ...)</i>
<a name="IDX1782"></a>
</dt>
<dd><p>This function is a short cut for
<code>draw2d(gr2d(<var>options</var>, ..., <var>graphic object</var>, ...))</code>.
</p>
<p>It can be used to plot a unique scene in 2d.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
</dd></dl>


<dl>
<dt><u>Function:</u> <b>draw3d</b><i> (<var>option</var>, <var>graphic object</var>, ...)</i>
<a name="IDX1783"></a>
</dt>
<dd><p>This function is a short cut for
<code>draw3d(gr3d(<var>options</var>, ..., <var>graphic object</var>, ...))</code>.
</p>
<p>It can be used to plot a unique scene in 3d.
</p>
<p>To make use of this function, write first <code>load(draw)</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable:</u> <b>draw_pipes</b>
<a name="IDX1784"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>draw_pipes</code> is <code>true</code>, Maxima communicates with Gnuplot
via pipes. If <code>draw_pipes</code> is <code>false</code>, Maxima communicates 
with Gnuplot via files. This is only useful in non Windows systems.
</p>
</dd></dl>


<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC189" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_48.html#SEC192" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_76.html#SEC290" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert Dodier</em> on <em>May, 2 2007</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
