<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezember, 10 2011 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 21. Zahlentheorie</title>

<meta name="description" content="Maxima Manual: 21. Zahlentheorie">
<meta name="keywords" content="Maxima Manual: 21. Zahlentheorie">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Zahlentheorie"></a>
<a name="SEC160"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_20.html#SEC159" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC161" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_20.html#SEC128" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_22.html#SEC162" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 21. Zahlentheorie </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC161">21.1 Funktionen und Variablen der Zahlentheorie</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Funktionen-und-Variablen-der-Zahlentheorie"></a>
<a name="SEC161"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC160" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_22.html#SEC162" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC160" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC160" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_22.html#SEC162" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 21.1 Funktionen und Variablen der Zahlentheorie </h2>

<p><a name="bern"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bern</b><i> (<var>n</var>)</i>
<a name="IDX1183"></a>
</dt>
<dd>
<p>Gibt die <var>n</var>-te Bernoulli-Zahl der ganzen Zahl <var>n</var> zur&uuml;ck. Hat die
Optionsvariable <code>zerobern</code> den Wert <code>false</code>, werden Bernoulli-Zahlen
unterdr&uuml;ckt, die Null sind.
</p>
<p>Siehe auch <code><a href="#burn">burn</a></code>.
</p>

<pre class="example">(%i1) zerobern: true$
(%i2) map (bern, [0, 1, 2, 3, 4, 5, 6, 7, 8]);
                  1  1       1      1        1
(%o2)       [1, - -, -, 0, - --, 0, --, 0, - --]
                  2  6       30     42       30
(%i3) zerobern: false$
(%i4) map (bern, [0, 1, 2, 3, 4, 5, 6, 7, 8]);
            1  1    1   5     691   7    3617  43867
(%o4) [1, - -, -, - --, --, - ----, -, - ----, -----]
            2  6    30  66    2730  6    510    798
</pre></dd></dl>

<p><a name="bernpoly"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bernpoly</b><i> (<var>x</var>, <var>n</var>)</i>
<a name="IDX1184"></a>
</dt>
<dd>
<p>Gibt das <var>n</var>-te Bernoulli-Polynom in der Variablen <var>x</var> zur&uuml;ck.
</p></dd></dl>


<p><a name="bfzeta"></a>
</p><dl>
<dt><u>Function:</u> <b>bfzeta</b><i> (<var>s</var>, <var>n</var>)</i>
<a name="IDX1185"></a>
</dt>
<dd>
<p>Die Riemannsche Zeta-Funktion f&uuml;r das Argument <var>s</var>, die wie folgt 
definiert ist:
</p>
<pre class="example">                 inf
                 ====
                 \     1
     zeta(s) =    &gt;    --
                 /      s
                 ====  k
                 k = 1
</pre>
<p><code>bfzeta</code> gibt einen Wert als gro&szlig;e Gleitkommazahl zur&uuml;ck.  Die Anzahl 
der Stellen wird durch das Argument <var>n</var> angegeben.
</p>
<p>Anstatt der Funktion <code>bfzeta</code> ist die Funktion <code><a href="#zeta">zeta</a></code>
 zu bevorzugen,
die sowohl f&uuml;r reelle und komplexe Gleitkommazahlen und Gleitkommazahlen mit
eine beliebigen Genauigkeit die Riemannsche Zeta-Funktion berechnen kann.
</p></dd></dl>

<p><a name="bfhzeta"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bfhzeta</b><i> (<var>s</var>, <var>h</var>, <var>n</var>)</i>
<a name="IDX1186"></a>
</dt>
<dd>

<p>Die Hurwitzsche Zeta-Funktion f&uuml;r die Argumente <var>s</var> und <var>h</var>, die wie
folgt definiert ist:
</p>
<pre class="example">                        inf
                        ====
                        \        1
         zeta (s,h)  =   &gt;    --------
                        /            s
                        ====  (k + h)
                        k = 0
</pre>
<p><code>bfhzeta</code> gibt einen Wert als gro&szlig;e Gleitkommazahl zur&uuml;ck.  Die 
Anzahl der Stellen wird durch das Argument <var>n</var> angegeben.
</p>
</dd></dl>

<p><a name="burn"></a>
</p><dl>
<dt><u>Funktion:</u> <b>burn</b><i> (<var>n</var>)</i>
<a name="IDX1187"></a>
</dt>
<dd>
<p>Gibt eine rational Zahl zur&uuml;ck, die eine N&auml;herung f&uuml;r die <var>n</var>-te 
Bernoulli Zahl f&uuml;r die ganze Zahl <var>n</var> ist.  <code>burn</code> berechnet eine 
N&auml;herung als gro&szlig;e Gleitkommatzahl mit der folgenden Beziehung:
</p>
<pre class="example">                   n - 1  1 - 2 n
              (- 1)      2        zeta(2 n) (2 n)!
     B(2 n) = ------------------------------------
                                2 n
                             %pi
</pre>

<p><code>burn</code> kann effizienter als die Funktion <code>bern</code> f&uuml;r gro&szlig;e, 
einzelne ganze Zahlen <var>n</var> sein, da <code>bern</code> zun&auml;chst alle Bernoulli 
Zahlen bis <var>n</var> berechnet.  <code>burn</code> ruft f&uuml;r ungerade ganze Zahlen und 
Zahlen die kleiner oder gleich 255 die Funktion <code>bern</code> auf.
</p>

<p>Das Kommando <code>load(bffac)</code> l&auml;dt die Funktion.  Siehe auch <code><a href="#bern">bern</a></code>.
</p>
</dd></dl>

<p><a name="divsum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>divsum</b><i> (<var>n</var>, <var>k</var>)</i>
<a name="IDX1188"></a>
</dt>
<dt><u>Funktion:</u> <b>divsum</b><i> (<var>n</var>)</i>
<a name="IDX1189"></a>
</dt>
<dd>
<p><code>divsum(<var>n</var>, <var>k</var>)</code> potenziert die Teiler des Argumentes <var>n</var> 
mit dem Argument <var>k</var> und gibt die Summe als Ergebnis zur&uuml;ck.
</p>

<p><code>divsum(<var>n</var>)</code> gibt die Summe der Teiler der Zahl <var>n</var> zur&uuml;ck.
</p>
<pre class="example">(%i1) divsum (12);
(%o1)                          28
(%i2) 1 + 2 + 3 + 4 + 6 + 12;
(%o2)                          28
(%i3) divsum (12, 2);
(%o3)                          210
(%i4) 1^2 + 2^2 + 3^2 + 4^2 + 6^2 + 12^2;
(%o4)                          210
</pre></dd></dl>

<p><a name="euler"></a>
</p><dl>
<dt><u>Funktion:</u> <b>euler</b><i> (<var>n</var>)</i>
<a name="IDX1190"></a>
</dt>
<dd>
<p>Gibt die <var>n</var>-te Eulersche Zahl f&uuml;r eine nichtnegative ganze Zahl <var>n</var>
zur&uuml;ck.
</p>

<p>F&uuml;r die Euler-Mascheroni Konstante siehe <code><a href="maxima_5.html#g_t_0025gamma">%gamma</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) map (euler, [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o1)    [1, 0, - 1, 0, 5, 0, - 61, 0, 1385, 0, - 50521]
</pre></dd></dl>

<p><a name="fib"></a>
</p><dl>
<dt><u>Funktion:</u> <b>fib</b><i> (<var>n</var>)</i>
<a name="IDX1191"></a>
</dt>
<dd>
<p>Gibt die <var>n-te</var> Fibonacci-Zahl zur&uuml;ck.  Die Fibonacci-Folge ist rekursiv 
definiert:
</p>
<pre class="example">   fib(0) = 0
   fib(1) = 1
   fib(n) = fib(n-1) + fib(n-2)
</pre>
<p>F&uuml;r negative ganze Zahlen kann die Fibonacci-Folge erweitert wird mit:
</p>
<pre class="example">                   n + 1
   fib(- n) = (- 1)      f(n)
</pre>



<p>Nach einem Aufruf der Funktion <code>fib(n)</code>, enth&auml;lt die Systemvariable 
<code>prevfib</code> die zur Zahl <code>n</code> vorhergehende Fibonacci-Zahl.
</p>
<pre class="example">(%i1) map (fib, [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o1)         [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]
</pre></dd></dl>

<p><a name="fibtophi"></a>
</p><dl>
<dt><u>Funktion:</u> <b>fibtophi</b><i> (<var>expr</var>)</i>
<a name="IDX1192"></a>
</dt>
<dd>
<p>Fibonacci-Zahlen im Ausdruck <var>expr</var> werden durch die Goldene Zahl 
<code>%phi</code> ausgedr&uuml;ckt.  Siehe <code><a href="maxima_5.html#g_t_0025phi">%phi</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
</pre></dd></dl>

<p><a name="ifactors"></a>
</p><dl>
<dt><u>Function:</u> <b>ifactors</b><i> (<var>n</var>)</i>
<a name="IDX1193"></a>
</dt>
<dd>
<p>Faktorisiert eine positive ganze Zahl <var>n</var>.  Sind <code>n = p1^e1..pk^nk</code> die
Faktoren der ganzen Zahl <var>n</var>, dann gibt <code>ifactor</code> das Ergebnis
<code>[[p1, e1], ... , [pk, ek]]</code> zur&uuml;ck.
</p>

<p>F&uuml;r die Faktorisierung kommen eine einfache Primfaktorzerlegung mit Primzahlen
bis zu 9973, das Z&auml;hlk&ouml;rpersieb nach Pollard oder die Methode der 
Elliptischen Kurven zum Einsatz.
</p>
<pre class="example">(%i1) ifactors(51575319651600);
(%o1)     [[2, 4], [3, 2], [5, 2], [1583, 1], [9050207, 1]]
(%i2) apply(&quot;*&quot;, map(lambda([u], u[1]^u[2]), %));
(%o2)                        51575319651600
</pre></dd></dl>

<p><a name="igcdex"></a>
</p><dl>
<dt><u>Function:</u> <b>igcdex</b><i> (<var>n</var>, <var>k</var>)</i>
<a name="IDX1194"></a>
</dt>
<dd><p>Returns a list <code>[<var>a</var>, <var>b</var>, <var>u</var>]</code> where <var>u</var> is the greatest
common divisor of <var>n</var> and <var>k</var>, and <var>u</var> is equal to
<code><var>a</var> <var>n</var> + <var>b</var> <var>k</var></code>.  The arguments <var>n</var> and <var>k</var>
must be integers.
</p>
<p><code>igcdex</code> implements the Euclidean algorithm.  See also <code><a href="maxima_17.html#gcdex">gcdex</a></code>.
</p>

<p>The command <code>load(gcdex)</code> loads the function.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) load(gcdex)$

(%i2) igcdex(30,18);
(%o2)                      [- 1, 2, 6]
(%i3) igcdex(1526757668, 7835626735736);
(%o3)            [845922341123, - 164826435, 4]
(%i4) igcdex(fib(20), fib(21));
(%o4)                   [4181, - 2584, 1]
</pre></dd></dl>

<p><a name="inrt"></a>
</p><dl>
<dt><u>Funktion:</u> <b>inrt</b><i> (<var>x</var>, <var>n</var>)</i>
<a name="IDX1195"></a>
</dt>
<dd>
<p>Gibt die ganzzahlige <var>n</var>-te Wurzel des Betrags von <var>x</var> zur&uuml;ck.
</p>
<pre class="example">(%i1) l: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]$
(%i2) map (lambda ([a], inrt (10^a, 3)), l);
(%o2) [2, 4, 10, 21, 46, 100, 215, 464, 1000, 2154, 4641, 10000]
</pre></dd></dl>

<p><a name="inv_005fmod"></a>
</p><dl>
<dt><u>Funktion:</u> <b>inv_mod</b><i> (<var>n</var>, <var>p</var>)</i>
<a name="IDX1196"></a>
</dt>
<dd>
<p>Berechnet das modulare Inverse von <var>n</var> zum Modul <var>p</var>.  Das Argument
<var>n</var> muss eine ganze Zahl und das Modul <var>p</var> eine positive ganze Zahl 
sein.  <code>inv_mod(n,p)</code> gibt <code>false</code> zur&uuml;ck, wenn das modulare Inverse
nicht existiert.  Das modulare Inverse existiert immer, wenn das Modul <var>p</var>
eine Primzahl ist.
</p>
<p>Siehe auch die Funktionen <code><a href="#power_005fmod">power_mod</a></code>
 und <code><a href="#mod">mod</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) inv_mod(3, 41);
(%o1)                           14
(%i2) ratsimp(3^-1), modulus=41;
(%o2)                           14
(%i3) inv_mod(3, 42);
(%o3)                          false
</pre></dd></dl>

<p><a name="isqrt"></a>
</p><dl>
<dt><u>Funktion:</u> <b>isqrt</b><i> (<var>x</var>)</i>
<a name="IDX1197"></a>
</dt>
<dd>
<p>Gibt die ganzzahlige Wurzel des Betrages von <var>x</var> zur&uuml;ck, wenn <var>x</var> eine
ganze Zahl ist.  Andernfalls wird eine Substantivform zur&uuml;ckgegeben.
</p></dd></dl>

<p><a name="jacobi"></a>
</p><dl>
<dt><u>Funktion:</u> <b>jacobi</b><i> (<var>p</var>, <var>q</var>)</i>
<a name="IDX1198"></a>
</dt>
<dd>
<p>Berechnet das Jacobi-Symbol f&uuml;r die Argumente <var>p</var> und <var>q</var>.
</p>
<pre class="example">(%i1) l: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]$
(%i2) map (lambda ([a], jacobi (a, 9)), l);
(%o2)         [1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0]
</pre></dd></dl>

<p><a name="lcm"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lcm</b><i> (<var>expr_1</var>, &hellip;, <var>expr_n</var>)</i>
<a name="IDX1199"></a>
</dt>
<dd>
<p>Gibt den kleinsten gemeinsamen Teiler der Argumente zur&uuml;ck.  Die Argumente 
k&ouml;nnen ganze Zahlen und allgemeine Ausdr&uuml;cke sein.
</p>

<p>Mit dem Kommando <code>load(functs)</code> wird die Funktion geladen.
</p></dd></dl>

<p><a name="mod"></a>
</p><dl>
<dt><u>Funktion:</u> <b>mod</b><i> (<var>x</var>, <var>p</var>)</i>
<a name="IDX1200"></a>
</dt>
<dd>
<p>Berechnet den Modulus <code>x mod p</code> des Arguments <var>x</var> zum Modul <var>p</var>. 
<var>x</var> und <var>p</var> k&ouml;nnen ganze Zahlen, rationale Zahlen, Gleitkommazahlen 
oder allgemeine Ausdr&uuml;cke sein.
</p>
<p>Sind <var>x</var> und <var>p</var> reelle Zahlen und ist <var>p</var> ungleich Null, gibt 
<code>mod(<var>x</var>, <var>p</var>)</code> das Ergebnis von <code><var>x</var> - <var>p</var> * 
floor(<var>x</var> / <var>p</var>)</code> zur&uuml;ck.  Weiterhin gilt f&uuml;r alle reellen Zahlen
<code>mod(<var>x</var>, 0) = <var>x</var></code>.  F&uuml;r eine Diskussion dieser Definition siehe
Kapitel 3.4, &quot;Concrete Mathematics&quot; von Graham, Knuth, and Patashnik.  Die 
Funktion <code>mod(<var>x</var>, 1)</code> ist eine S&auml;gezahnfunktion mit der Periode 1 
mit <code>mod(1, 1) = 0</code> und <code>mod(0, 1) = 0</code>.
</p>

<p>Der Hauptwert einer komplexen Zahl, die im Intervall <code>(-%pi, %pi)</code> liegt,
kann mit <code>%pi - mod(%pi - <var>x</var>, 2*%pi)</code> bestimmt werden, wobei <var>x</var>
die komplexe Zahl ist.
</p>

<p>Wie f&uuml;r die Funktionen <code>floor</code> oder <code>ceiling</code> werden konstante 
Ausdr&uuml;cke, wie zum Beispiel <code>10 * %pi</code>, in gro&szlig;e Gleitkommazahlen 
umgewandelt, um <code>mod</code> zu berechnen.  Diese Umwandlung kann zu Fehlern
f&uuml;hren.
</p>

<p>F&uuml;r nicht nummerische Argumente <var>x</var> oder <var>y</var> kennt <code>mod</code>
verschiedene Vereinfachungen.
</p>
<p>Siehe auch die Funktionen <code><a href="#power_005fmod">power_mod</a></code>
 und <code><a href="#inv_005fmod">inv_mod</a></code>.
</p>

<p>Beispiele:
</p>
<p>Zeige f&uuml;r zwei gro&szlig;e ganze Zahlen, dass f&uuml;r das modulare Rechnen die 
Regel <code>mod(a+b,p) = mod(a,p)+mod(b,p)</code> gilt.
</p>
<pre class="example">(%i1) a:random(10^20)+10^19;
(%o1)                 72588919020045581148
(%i2) b:random(10^20)+10^19;
(%o2)                 35463666253140008825
(%i3) p:random(10^20)+10^19;
(%o3)                 39127433614020247557
(%i4) mod(a+b,p);
(%o4)                 29797718045145094859
(%i5) mod(mod(a,p)+mod(b,p),p);
(%o5)                 29797718045145094859
</pre>
<p>Vereinfachung f&uuml;r nicht nummerische Argumente.
</p>
<pre class="example">(%i1) mod (x, 0);
(%o1)                           x
(%i2) mod (a*x, a*y);
(%o2)                      a mod(x, y)
(%i3) mod (0, x);
(%o3)                           0
</pre></dd></dl>

<p><a name="next_005fprime"></a>
</p><dl>
<dt><u>Funktion:</u> <b>next_prime</b><i> (<var>n</var>)</i>
<a name="IDX1201"></a>
</dt>
<dd>
<p>Gibt die kleinste Primzahl zur&uuml;ck, die der Zahl <var>n</var> folgt.
</p>
<pre class="example">(%i1) next_prime(27);
(%o1)                       29
</pre></dd></dl>

<p><a name="primep"></a>
</p><dl>
<dt><u>Funktion:</u> <b>primep</b><i> (<var>n</var>)</i>
<a name="IDX1202"></a>
</dt>
<dd>
<p>F&uuml;hrt einen Test auf eine Primzahl f&uuml;r das Argument <var>n</var> durch.  Hat
<code>primep</code> das Ergebnis <code>false</code>, ist <var>n</var> keine Primzahl.  Ist das
Ergebnis <code>true</code>, ist <var>n</var> mit gro&szlig;er Wahrscheinlichkeit eine 
Primzahl.
</p>

<p>F&uuml;r ganze Zahlen <var>n</var> die kleiner als 10^16 sind wird eine probalistisches
Miller-Rabin-Verfahren.  Hat in diesem Fall <code>primep</code> das Ergebnis
<code>true</code>, dann ist <var>n</var> eine Primzahl.
</p>

<p>F&uuml;r ganze Zahlen <var>n</var> gr&ouml;&szlig;er als 10^16 nutzt <code>primep</code> den
Pseudo-Primzahlentest nach Miller-Rabin mit <code><a href="#primep_005fnumber_005fof_005ftests">primep_number_of_tests</a></code>
 Tests
und den Pseudo_Primzahlentest nach Lucas.  Die Wahrscheinlichkeit, dass eine
Zahl <var>n</var> den Pseudo-Primzahlentest nach Miller-Rabin passiert, ist kleiner
als 1/4.  Mit dem Standardwert 25 f&uuml;r die Optionsvariable 
<code>primpe_number_of_tests</code> ist die Wahrscheinlichkeit viel kleiner als 
10^-15.
</p></dd></dl>

<p><a name="primep_005fnumber_005fof_005ftests"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>primep_number_of_tests</b>
<a name="IDX1203"></a>
</dt>
<dd><p>Standardwert: 25
</p>

<p>Die Anzal der Pseudo-Primzahlentests nach Miller-Rabin der Funktion 
<code><a href="#primep">primep</a></code>.
</p>
</dd></dl>

<p><a name="prev_005fprime"></a>
</p><dl>
<dt><u>Funktion:</u> <b>prev_prime</b><i> (<var>n</var>)</i>
<a name="IDX1204"></a>
</dt>
<dd>
<p>Gibt die gr&ouml;&szlig;te Primzahl zur&uuml;ck, die kleiner als die Zahl <var>n</var> ist.
</p>
<pre class="example">(%i1) prev_prime(27);
(%o1)                       23
</pre></dd></dl>

<p><a name="power_005fmod"></a>
</p><dl>
<dt><u>Funktion:</u> <b>power_mod</b><i> (<var>a</var>, <var>n</var>, <var>p</var>)</i>
<a name="IDX1205"></a>
</dt>
<dd>
<p>Berechnet den Modulus <code>a^n mod p</code> der Exponentiation <code>a^n</code> zum Modul 
<var>p</var>.  Die Argumente <var>a</var> und <var>n</var> m&uuml;ssen ganze Zahlen sein.  Das 
Modul <var>p</var> muss eine positive ganze Zahl sein.  Ist <var>n</var> negativ, wird die 
Funktion <code><a href="#inv_005fmod">inv_mod</a></code>
 aufgerufen, um das modulare Inverse zu berechnen.
</p>
<p>Die Funktion <code>power_mod</code> ist f&uuml;r ganze Zahlen &auml;quivalent zu 
<code>mod(a^n, p)</code>.  Der Algorithmus von <code>power_mod</code> ist besondere f&uuml;r 
gro&szlig;e ganze Zahlen effizienter.
</p>
<p>Siehe auch die Funktionen <code><a href="#inv_005fmod">inv_mod</a></code>
 und <code><a href="#mod">mod</a></code>.
</p>

<p>Beispiele:
</p>
<p><code>power_mod(a,n,p)</code> ist &auml;quivalent zu <code>mod(a^n,p</code>.  Das modulare
Inverse wird mit der Funktion <code>inv_mod</code> berechnet.
</p>
<pre class="example">(%i1) power_mod(3, 15, 5);
(%o1)                          2
(%i2) mod(3^15,5);
(%o2)                          2
(%i3) power_mod(2, -1, 5);
(%o3)                          3
(%i4) inv_mod(2,5);
(%o4)                          3
</pre>
<p>F&uuml;r gro&szlig;e ganze Zahlen ist <code>power_mod</code> effizienter.  Das folgende 
Ergebnis kann nicht in einer vern&uuml;nftigen Zeit mit <code>mod(a^n,p)</code> berechnet
werden.
</p>
<pre class="example">(%i1) power_mod(123456789,123456789,987654321);
(%o1)                       598987215
</pre></dd></dl>

<p><a name="qunit"></a>
</p><dl>
<dt><u>Funktion:</u> <b>qunit</b><i> (<var>n</var>)</i>
<a name="IDX1206"></a>
</dt>
<dd>
<p>Findet f&uuml;r das Argument <var>n</var> L&ouml;sungen der Pellschen Gleichung 
<code>a^2 - <var>n</var> b^2 = 1</code>.
</p>
<pre class="example">(%i1) qunit (17);
(%o1)                     sqrt(17) + 4
(%i2) expand (% * (sqrt(17) - 4));
(%o2)                           1
</pre></dd></dl>

<p><a name="totient"></a>
</p><dl>
<dt><u>Funktion:</u> <b>totient</b><i> (<var>n</var>)</i>
<a name="IDX1207"></a>
</dt>
<dd>
<p>Gibt die Anzahl der ganzen Zahlen zur&uuml;ck, die kleiner oder gleich <var>n</var>
sind und die kein Teiler von <var>n</var> sind.
</p></dd></dl>

<p><a name="zerobern"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>zerobern</b>
<a name="IDX1208"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p>Hat <code>zerobern</code> den Wert <code>false</code>, werden von den Funktionen <code>bern</code>
die Bernoulli Zahlen und von <code>euler</code> die Euler Zahlen ausgeschlossen,
die als Ergenis Null haben.  Siehe <code><a href="#bern">bern</a></code>
 und <code><a href="#euler">euler</a></code>.
</p>
</dd></dl>

<p><a name="zeta"></a>
</p><dl>
<dt><u>Funktion:</u> <b>zeta</b><i> (<var>n</var>)</i>
<a name="IDX1209"></a>
</dt>
<dd>
<p>Die Riemannsche Zeta-Funktion f&uuml;r <var>s</var>, die wie folgt definiert ist:
</p>
<pre class="example">                 inf
                 ====
                 \     1
     zeta(s) =    &gt;    --
                 /      s
                 ====  k
                 k = 1
</pre>
<p>F&uuml;r negative ganze Zahlen <var>n</var>, Null und postive gerade ganze Zahlen 
vereinfacht <code>zeta</code> zu einem exakten Ergebnis.  Damit diese Vereinfachung
f&uuml;r positive ganze Zahlen ausgef&uuml;hrt wird, muss die Optionsvariable
<code>zeta%pi</code> den Wert <code>true</code> haben.  Siehe <code><a href="#zeta_0025pi">zeta%pi</a></code>.
 F&uuml;r 
einfache und gro&szlig;e Gleitkommazahlen hat <code>zeta</code> ein numerisches 
Ergebnis.  F&uuml;r alle anderen Argumente einschlie&szlig;lich komplexe Zahlen und 
rationale Zahlen gibt <code>zeta</code> eine Substantivform zur&uuml;ck.  Hat die 
Optionsvariable <code>zeta%pi</code> den Wert <code>false</code>, gibt <code>zeta</code> auch 
f&uuml;r gerade ganze Zahlen eine Substantivform zur&uuml;ck.
</p>

<p><code>zeta(1)</code> ist nicht definiert.  Maxima kennt jedoch die einseitigen
Grenzwerte <code>limit(zeta(x), x, 1, plus</code> und 
<code>limit(zeta(x), x, 1, minus</code>.
</p>

<p>Die Riemannsche Zeta-Funktion wird auf die Argumente von Listen, Matrizen und 
Gleichungen angewendendet, wenn die Optionsvariable <code>distribute_over</code>
den Wert <code>true</code> hat.
</p>

<p>Siehe auch <code><a href="#bfzeta">bfzeta</a></code>
 und <code><a href="#zeta_0025pi">zeta%pi</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) zeta([-2,-1,0,0.5,2,3,1+%i]);
                                             2
            1     1                       %pi
(%o1) [0, - --, - -, - 1.460354508809586, ----, zeta(3), 
            12    2                        6
                                                    zeta(%i + 1)]
(%i2) limit(zeta(x),x,1,plus);
(%o2)                          inf
(%i3) limit(zeta(x),x,1,minus);
(%o3)                         minf
</pre></dd></dl>

<p><a name="zeta_0025pi"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>zeta%pi</b>
<a name="IDX1210"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>

<p>Hat <code>zeta%pi</code> den Wert <code>true</code>, vereinfacht die Funktion <code>zeta(n)</code>
f&uuml;r gerade ganzen Zahlen <var>n</var> zu einem Ergebnis, das proportional zu 
<code>%pi^n</code> ist.  Ansonsten ist das Ergebnis von <code>zeta</code> eine 
Substantivform f&uuml;r gerade ganze Zahlen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) zeta%pi: true$
(%i2) zeta (4);
                                 4
                              %pi
(%o2)                         ----
                               90
(%i3) zeta%pi: false$
(%i4) zeta (4);
(%o4)                        zeta(4)
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC160" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_22.html#SEC162" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>Dezember, 10 2011</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
